       IDENTIFICATION DIVISION.
       PROGRAM-ID. BM1.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MIZAN ASSIGN TO DISK ORGANIZATION
           INDEXED ACCESS DYNAMIC RECORD KEY MUSTERI-KODU.
           SELECT CARI ASSIGN TO DISK ORGANIZATION INDEXED 
           ACCESS DYNAMIC RECORD KEY CARI-ANAHTARI.
       DATA DIVISION.
       FILE SECTION.
       COPY B:FD.BLM.
       WORKING-STORAGE SECTION.
       77 N PIC 9 VALUE 0.
       77 CEVAP PIC X VALUE SPACES.
       SCREEN SECTION.
       01 EKRAN-1.
           05 BLANK SCREEN.
           05 LINE 1 COLUMN 1 BLINK VALUE "OZLEM A.S." HIGHLIGHT.
           05 LINE 2 COLUMN 1 VALUE "CARI HESAP PROGRAMI" HIGHLIGHT.
           05 LINE 3 COLUMN 1 PIC X(19) FROM ALL "=" HIGHLIGHT.
           05 LINE 7 COLUMN 10 VALUE 
              "MIZAN ISLEMLERININ YAPILMASI" HIGHLIGHT.
           05 LINE 8 COLUMN 10 PIC X(60) FROM ALL "=".
           05 LINE 9 COLUMN 10 VALUE "[1]:MUSTERI BILGI GIRISI".
           05 LINE 11 COLUMN 10 VALUE 
           "[2]:HERHANGI BIR MUSTERININ SILINMESI".
           05 LINE 13 COLUMN 10 VALUE "[3]:ANA PROGRAMA DONUS".
           05 LINE 15 COLUMN 10 PIC X(60) FROM ALL "=".
           05 LINE 18 COLUMN 10 VALUE 
           "******* SECIMINIZ:  ******".
           05 LINE 18 COLUMN 36 PIC 9 USING N.
       01 EKRAN-2.
           05 BLANK SCREEN.
           05 LINE 1 COLUMN 1 VALUE "OZLEM A.S." HIGHLIGHT.
           05 LINE 2 COLUMN 1 VALUE "CARI HESAP PROGRAMI" HIGHLIGHT.
           05 LINE 3 COLUMN 1 PIC X(19) FROM ALL "=".
           05 LINE 8 COLUMN 10 PIC X(52) FROM ALL "=".
           05 LINE 9 COLUMN 10 VALUE "MUSTERI KODU........:".
           05 LINE 9 COLUMN 30 PIC XXX USING MUSTERI-KODU.
       01 EKRAN-3.
           05 LINE 10 COLUMN 10 VALUE "MUSTERI UNVANI....:".
           05 LINE 10 COLUMN 30 PIC X(30) USING MUSTERI-UNVANI.
           05 LINE 12 COLUMN 10 VALUE "BORC TUTARI.......:".
           05 LINE 12 COLUMN 30 PIC 9(9) USING BORC-TUTARI.
           05 LINE 13 COLUMN 10 VALUE "ALACAK TUTARI.....:".
           05 LINE 13 COLUMN 30 PIC 9(9) USING ALACAK-TUTARI.
           05 LINE 14 COLUMN 10 PIC X(52) FROM ALL "=".
       PROCEDURE DIVISION.
       BASLA. DISPLAY EKRAN-1.
       A10. ACCEPT EKRAN-1.
           IF N = 1 PERFORM GIRIS
           ELSE IF N = 2 PERFORM SILME
           ELSE IF N = 3 GO SONN
           ELSE DISPLAY (21 10) N DISPLAY (21 12) 
           "NOLU SECENEK YANLIS LUTFEN DOGRUSUNU GIRINIZ" GO A10.
           DISPLAY EKRAN-1. DISPLAY (21 10) N DISPLAY (21 12)
           "NOLU ISLEM TAMAMLANMISTIR". GO A10.
       GIRIS SECTION.
       B10. OPEN I-O MIZAN.
       B20. MOVE ALL ZEROS TO BORC-TUTARI ALACAK-TUTARI.
           MOVE ALL "." TO MUSTERI-KODU MUSTERI-UNVANI.
           DISPLAY EKRAN-2. DISPLAY (7 10) "MUSTERI BILGI GIRISI".
       B30. DISPLAY (24 1) "<ESC TUSU ILE ANA MENUYE DONERSINIZ >".
           ACCEPT EKRAN-2 ON ESCAPE GO B-SON.
           READ MIZAN INVALID KEY GO B40. DISPLAY (24 1) ERASE.
           DISPLAY EKRAN-3. DISPLAY (24 1) 
           "** BU KODDA DOSYADA KAYIT MEVCUT <ENT> BAS:   **".
           ACCEPT (24 46) CEVAP. GO B20.
       B40. DISPLAY (24 1) ERASE. DISPLAY EKRAN-3.
           ACCEPT (10 30) MUSTERI-UNVANI WITH PROMPT. DISPLAY (24 1)
           "** VERILER DOGRU MU ?:    **". ACCEPT (24 23) 
           CEVAP WITH PROMPT. IF CEVAP  = "H" GO B40.
           WRITE MIZAN-KAYDI INVALID KEY DISPLAY (24 1)
           "** YAZAMIYORUM ** DISKET DOLU / BOZUK <ENT> BAS:  "
           ACCEPT (24 51) CEVAP GO B-SON. GO B20.
       B-SON. CLOSE MIZAN. 
       SILME SECTION.
       C10. OPEN I-O MIZAN I-O CARI.
       C20. MOVE ALL "." TO MUSTERI-KODU. DISPLAY EKRAN-2.
           DISPLAY (7 10) "HERHANGI BIR MUSTERININ SILINMESI".
           DISPLAY (24 1) "< ESC > TUSU ILE ANA MENUYE DONERSINIZ".
           ACCEPT EKRAN-2 ON ESCAPE GO C-SON.