       IDENTIFICATION DIVISION.
       PROGRAM-ID. BM3.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MIZAN ASSIGN TO DISK ORGANIZATION INDEXED ACCESS
           DYNAMIC RECORD KEY MUSTERI-KODU.
           SELECT CARI ASSIGN DISK ORGANIZATION INDEXED
           ACCESS DYNAMIC RECORD KEY CARI-ANAHTARI.
       DATA DIVISION.
       FILE SECTION.
       COPY B:FD.BLM.
       WORKING-STORAGE SECTION.
       COPY B:TANIM.BLM.
       SCREEN SECTION.
       COPY B:EKRAN.BLM.
       PROCEDURE DIVISION.
       BASLA. DISPLAY EKRAN1. DISPLAY (6 37) "E K R A N D A".
       A10. ACCEPT EKRAN1. 
            IF N = 1 PERFORM CARI-DOKUM
            ELSE IF N = 2 PERFORM MIZAN-DOKUM
            ELSE IF N = 3 GO SONN
            ELSE DISPLAY (22 10) N DISPLAY (22 10)
            "NOLU SECENEK YANLIS LUTFEN DOGRUSUNU GIRINIZ" GO A10.
            DISPLAY EKRAN1. DISPLAY (6 37) "E K R A N D A".
            DISPLAY (22 10) N. DISPLAY (22 12)
            "NOLU ISLEM TAMAMLANMISTIR". GO A10.
       CARI-DOKUM SECTION.
       B10. OPEN I-O CARI INPUT MIZAN.
       B20. PERFORM CARI-BASLANGIC THRU CARI-BAS-SON.
            PERFORM CARI-ISLEM UNTIL DD = "E". GO CARI-SONUC.
       CARI-BASLANGIC. DISPLAY (1 1) ERASE. MOVE "H" TO DD.
            MOVE SPACES TO MUSTERI-KODU.
            MOVE ALL ZEROS TO SON-TARIH ISLEM-TARIHI.
            MOVE "H" TO CEVAP. 
            DISPLAY (8 1) "MUSTERI KODU.......:".
            DISPLAY (10 1) "ILK TARIH..........:  /  /19".
            DISPLAY (11 1) "SON TARIH..........:  /  /19".
            DISPLAY (23 1)
            "** <MUSTERI KODU = SON> ANA MENUYE DONUS  **".
       B30. ACCEPT (8 22) MUSTERI-KODU WITH PROMPT UPDATE.
            IF MUSTERI-KODU = "SON" MOVE "E" TO DD GO CARI-BAS-SON.
            READ MIZAN INVALID KEY DISPLAY (24 1)
            "** BU MUSTERI KODU MIZANDA MEVCUT DEGIL <ENT> BAS: **"
            ACCEPT (24 57) CEVAP DISPLAY (24 1) ERASE GO B30.
            DISPLAY (24 1) ERASE. DISPLAY (24 1)
            "ILK TARIH = 00/00/00 VE SON TARIH = 99/99/99 TUM DOKUM".
       B40. ACCEPT (10 22) ISLEM-GUNU WITH PROMPT UPDATE.
            ACCEPT (10 25) ISLEM-AYI WITH PROMPT UPDATE.
            ACCEPT (10 30) ISLEM-YILI WITH PROMPT UPDATE.
            ACCEPT (11 22) SON-GUN WITH PROMPT UPDATE.
            ACCEPT (11 25) SON-AY WITH PROMPT UPDATE.
            ACCEPT (11 30) SON-YIL WITH PROMPT UPDATE.
            DISPLAY (24 1) ERASE.
            DISPLAY (24 1) "VERILER DOGRU MU ?:".
            ACCEPT (24 20) CEVAP WITH PROMPT. IF CEVAP = "H"
            DISPLAY ( 24 1) ERASE GO B40. MOVE "H" TO CEVAP.
            MOVE MUSTERI-KODU TO CARI-KODU.
            MOVE SPACES TO BORC-ALACAK BELGE-NO.
            START CARI KEY NOT LESS CARI-ANAHTARI INVALID KEY
            DISPLAY (24 1)
            "** CARI DOSYAYA START YAPAMIYORUM <ENT> BAS: **"
            ACCEPT (24 47) CEVAP MOVE "E" TO DD GO CARI-BAS-SON.
            READ CARI NEXT AT END MOVE "E" TO DD GO CARI-BAS-SON.
            IF CARI-KODU NOT = MUSTERI-KODU MOVE "E" TO DD 
            GO CARI-BAS-SON.
            IF ISLEM-TARIHI > SON-TARIH MOVE "E" TO DD GO CARI-BAS-SON.
            MOVE MUSTERI-KODU TO CARI-KOD.
            MOVE MUSTERI-UNVANI TO MUS-UNVAN.
            MOVE ALL ZEROS TO SAYFA-9 SIRA-9 GENEL-BORC-C9
            GENEL-ALACAK-C9. PERFORM CARI-BASLIK.
       CARI-BAS-SON. EXIT.
       CARI-BASLIK. DISPLAY (1 1) ERASE. ADD 1 TO SAYFA-9.
           MOVE SAYFA-9 TO SAYFA-NO-B1. MOVE "E" TO CEVAP.
           MOVE ALL ZEROS TO SAYFA-BORC-C9 SAYFA-ALACAK-C9 KONTROL.
           MOVE 3 TO LIN. DISPLAY (1 1) BAS-1. DISPLAY (2 1) BAS-2.
           DISPLAY (3 1) BAS-3. DISPLAY (4 1) CIZGI.
       CARI-ISLEM. ADD 1 TO LIN. ADD 1 TO KONTROL. ADD 1 TO SIRA-9.
           IF BORC-ALACAK = "B" ADD TUTAR TO SAYFA-BORC-C9
           MOVE TUTAR TO BORC-TUTARI-B4
           MOVE ZEROS TO ALACAK-TUTARI-B4
           ELSE ADD TUTAR TO SAYFA-ALACAK-C9
           MOVE TUTAR TO ALACAK-TUTARI-B4
           MOVE ZEROS TO BORC-TUTARI-B4
           MOVE ISLEM-GUNU TO GUN-B4. 
           MOVE ISLEM-AYI TO AY-B4.
           MOVE ISLEM-YILI TO YIL-B4.
           MOVE SIRA-9 TO SIRA-B4.
           MOVE BELGE-NO TO BELGE-NO-B4.
           MOVE IZAHAT TO IZAHAT-B4.
           DISPLAY (LIN + 1 1) BAS-4. IF KONTROL > 14
           PERFORM CARI-SAYFA-SONU DISPLAY (24 1)
           "** BIR SONRAKI SAYFA DOKUMU ISTIYORMUSUNUZ ?  **"
           ACCEPT (24 46) CEVAP WITH PROMPT IF CEVAP = "H"
           MOVE "E" TO DD ELSE PERFORM CARI-BASLIK.
           READ CARI NEXT AT END MOVE "E" TO DD.
           IF CARI-KODU NOT = MUSTERI-KODU MOVE "E" TO DD.
           IF ISLEM-TARIHI > SON-TARIH MOVE "E" TO DD.
       CARI-SAYFA-SONU.
           ADD SAYFA-BORC-C9 TO GENEL-BORC-C9.
           ADD SAYFA-ALACAK-C9 TO GENEL-ALACAK-C9.
           MOVE SAYFA-BORC-C9 TO S-BORC-B5.
           MOVE SAYFA-ALACAK-C9 TO S-ALACAK-B5.
           MOVE GENEL-BORC-C9 TO G-BORC-B6.
           MOVE GENEL-ALACAK-C9 TO G-ALACAK-B6.
           DISPLAY (LIN + 2 1) CIZGI.
           DISPLAY (LIN + 3 1) BAS-5.
           DISPLAY (LIN + 4 1) BAS-6.
       CARI-SONUC. IF CEVAP = "E" PERFORM CARI-SAYFA-SONU.
           DISPLAY (24 1) ERASE. DISPLAY (24 1)
           "** ANA MENU ICIN <ENT> BAS:  **".
           ACCEPT (24 30) CEVAP. CLOSE MIZAN CARI.
       MIZAN-DOKUM SECTION.
       C10. PERFORM MIZ-BAS THRU MIZ-BAS-SON.
            PERFORM MIZAN-ISLEM UNTIL DD = "E". GO MIZAN-SON.
       MIZ-BAS. OPEN I-O MIZAN. DISPLAY (1 1) ERASE. MOVE "H" TO DD.
           DISPLAY (8 1) "ILK MUSTERI KODU...:".
           DISPLAY (10 1) "SON MUSTERI KODU...:".
           DISPLAY (21 1) "** < ILK MUSTERI KODU = SON > ".
           DISPLAY (21 31) "ANA MENUYE DONUS".
           DISPLAY (23 1) "** ILK MUSTERI KODU = 000 SON MUSTERI".
           DISPLAY (23 41) "KODU=ZZZ GIRINCE TUM DOKUMU ALIRSINIZ**".
           MOVE SPACES TO MUSTERI-KODU SON-MUSTERI-KODU.
       C20. ACCEPT (8 21) MUSTERI-KODU WITH PROMPT UPDATE.
           IF MUSTERI-KODU = "SON" MOVE "E" TO DD GO MIZ-BAS-SON.
           ACCEPT (10 21) SON-MUSTERI-KODU WITH PROMPT UPDATE.
           DISPLAY (15 5) "** DOGRUMU ?: **".
           ACCEPT (15 19) CEVAP WITH PROMPT.
           IF CEVAP = "H" GO C20. MOVE "H" TO CEVAP.
           DISPLAY (1 1) ERASE.
           START MIZAN KEY NOT LESS THAN MUSTERI-KODU INVALID KEY
           DISPLAY (24 1) "** START YAPAMIYORUM <ENT> BAS: **"
           ACCEPT CEVAP MOVE "E" TO DD GO MIZ-BAS-SON.
           READ MIZAN NEXT RECORD AT END
           MOVE "E" TO DD GO MIZ-BAS-SON.
           IF MUSTERI-KODU > SON-MUSTERI-KODU DISPLAY (24 1) 
           "** MUSTERI KODU SON KODUNU GECTI <ENT> BAS:  **"
           ACCEPT CEVAP MOVE "E" TO DD GO MIZ-BAS-SON.
           MOVE ALL ZEROS TO SAYFA-9 SIRA-9 G-BORC-M9 G-ALACAK-M9
           G-BORC-BAKIYE-M9 G-ALACAK-BAKIYE-M9. PERFORM MIZAN-BASLIK.
       MIZ-BAS-SON. EXIT.
       MIZAN-BASLIK. DISPLAY (1 1) ERASE. ADD 1 TO SAYFA-9.
           MOVE ALL ZEROS TO KONTROL S-BORC-M9 S-ALACAK-M9 
           S-BORC-BAKIYE-M9 S-ALACAK-BAKIYE-M9. MOVE 3 TO LIN.
           MOVE SAYFA-9 TO SAYFA-NO-B10. DISPLAY (1 1) BAS-7.
           DISPLAY (2 1) BAS-12. DISPLAY (3 1) BAS-8.
           DISPLAY (4 1) CIZGI. MOVE "E" TO CEVAP.
       MIZAN-ISLEM. ADD 1 TO LIN. ADD 1 TO KONTROL.
           ADD 1 TO SIRA-9. IF BORC-TUTARI > ALACAK-TUTARI
           SUBTRACT ALACAK-TUTARI FROM BORC-TUTARI GIVING
           BORC-BAKIYE-M9 MOVE 0 TO ALACAK-BAKIYE-M9
           ELSE SUBTRACT BORC-TUTARI FROM ALACAK-TUTARI GIVING
           ALACAK-BAKIYE-M9 MOVE 0 TO BORC-BAKIYE-M9.
           MOVE SIRA-9 TO SIRA-B12. MOVE MUSTERI-KODU TO KOD-B12.
           MOVE MUSTERI-UNVANI TO UNVAN-B12.
           MOVE BORC-TUTARI TO BORC-B12.
           MOVE ALACAK-TUTARI TO ALACAK-B12.
           MOVE BORC-BAKIYE-M9 TO B-BAKIYE-B12.
           MOVE ALACAK-BAKIYE-M9 TO A-BAKIYE-B12.
           ADD BORC-TUTARI TO S-BORC-M9.
           ADD ALACAK-TUTARI TO S-ALACAK-M9.
           ADD BORC-BAKIYE-M9 TO S-BORC-BAKIYE-M9.
           ADD ALACAK-BAKIYE-M9 TO S-ALACAK-BAKIYE-M9.
           DISPLAY (LIN + 1 1) BAS-9. IF KONTROL > 14 PERFORM
           MIZAN-SAYFA-SONU DISPLAY (24 1) "**DEVAM MI ?: **"
           ACCEPT (24 15) CEVAP WITH PROMPT IF CEVAP = "H" 
           MOVE "E" TO DD ELSE PERFORM MIZAN-BASLIK.
           READ MIZAN NEXT AT END MOVE "E" TO DD.
           IF MUSTERI-KODU > SON-MUSTERI-KODU MOVE "E" TO DD.
       MIZAN-SAYFA-SONU. ADD S-BORC-M9 TO G-BORC-M9.
           ADD S-ALACAK-M9 TO G-ALACAK-M9.
           ADD S-BORC-BAKIYE-M9 TO G-BORC-BAKIYE-M9.
           ADD S-ALACAK-BAKIYE-M9 TO G-ALACAK-BAKIYE-M9.
           MOVE S-BORC-M9 TO S-BORC-B13.
           MOVE S-ALACAK-M9 TO S-ALACAK-B13.
           MOVE S-BORC-BAKIYE-M9 TO S-B-BAKIYE-B13.
           MOVE S-ALACAK-BAKIYE-M9 TO S-A-BAKIYE-B13.
           MOVE G-BORC-M9 TO G-BORC-B14.
           MOVE G-ALACAK-M9 TO G-ALACAK-B14.
           MOVE G-BORC-BAKIYE-M9 TO G-B-BAKIYE-B14.
           MOVE G-ALACAK-BAKIYE-M9 TO G-A-BAKIYE-B14.
           DISPLAY (LIN + 2 1) CIZGI. DISPLAY (LIN + 3 1)
           BAS-10. DISPLAY (LIN + 4 1) BAS-11.
       MIZAN-SON. IF CEVAP = "E" PERFORM MIZAN-SAYFA-SONU.
           DISPLAY (24 1) ERASE DISPLAY (24 1)
           "** ANA MENU ICIN <ENT> BAS:  **". 
           ACCEPT CEVAP. CLOSE MIZAN.
       SONN SECTION.
       H10. EXIT PROGRAM.
                       