       IDENTIFICATION  DIVISION.
       PROGRAM-ID. CSEN1.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT KAYIT ASSIGN TO DISK ORGANIZATION INDEXED
           ACCESS MODE RANDOM RECORD KEY KOD.
       DATA DIVISION.
       FILE SECTION.
       COPY B:CEKSEN.KYD.
       WORKING-STORAGE SECTION.
       77 KONU PIC X(30) VALUE SPACES.
       77 ISLEM PIC X(20) VALUE SPACES.
       77 N PIC 99 VALUE 0.
       77 CEVAP PIC X.
       77 DD PIC X VALUE SPACES.
       77 TUTAR1 PIC 9(8).
       77 IZ1 PIC X(40).
       01 H-TARIH1.
           05 YIL1 PIC 99.
           05 AY1 PIC 99.
           05 GUN1 PIC 99.
       SCREEN SECTION.
       01 EKRAN-1.
           05 BLANK SCREEN.
           05 LINE 1 COLUMN 10 VALUE "BEBIM A.S.".
           05 LINE 1 COLUMN 50 VALUE "CEK-SENET PRG".
           05 LINE 2 COLUMN 10 PIC X(30) FROM KONU.
           05 LINE 2 COLUMN 50 PIC X(20) FROM ISLEM.
           05 LINE 24 COLUMN 1 VALUE "UYARI:".
       01 EKRAN-2.
           05 LINE 4 COLUMN 10 PIC X(70) FROM ALL "*".
           05 LINE 6 COLUMN 10 VALUE "(a): VERI GIRISI".
           05 LINE 7 COLUMN 10 PIC X(70) FROM ALL "*".
           05 LINE 8 COLUMN 13 VALUE 
            "(11)..BORC SENETLERI  (13)..BORC CEKLERI".
           05 LINE 8 COLUMN 60 VALUE "(15)..BORC NAKIT".
           05 LINE 9 COLUMN 13 VALUE
            "(12)..ALACAK SENETLERI  (14)..ALACAK CEKLERI".
           05 LINE 9 COLUMN 60 VALUE "(16)..ALACAK NAKIT".
           05 LINE 11 COLUMN 10 VALUE
            "(b): VADE SONU DURUMLARIN ISLENMESI".
           05 LINE 12 COLUMN 10 PIC X(70) FROM ALL "-".
           05 LINE 13 COLUMN 13 VALUE 
            "(21)..BORC SENETLERI  (23)..BORC CEKLERI".
           05 LINE 13 COLUMN 60 VALUE "(25)..BORC NAKIT".
           05 LINE 14 COLUMN 13 VALUE 
            "(22)..ALACAK SENETLERI  (24)..ALACAK CEKLERI".
           05 LINE 14 COLUMN 60 VALUE "(26)..ALACAK NAKIT".
           05 LINE 16 COLUMN 10 VALUE
            "(c): ISTENILEN BIR KAYDIN SILINMESI".
           05 LINE 17 COLUMN 10 PIC X(70) FROM ALL "-".
           05 LINE 18 COLUMN 13 VALUE 
            "(31)..BORC SENETLERI  (33)..BORC CEKLERI".
           05 LINE 18 COLUMN 60 VALUE "(35..BORC NAKIT".
           05 LINE 19 COLUMN 13 VALUE 
            "(32)..ALACAK SENETLERI  (34)..ALACAK CEKLERI".
           05 LINE 19 COLUMN 60 VALUE "(36)..ALACAK NAKIT".
           05 LINE 20 COLUMN 10 PIC X(70) FROM ALL "-".
           05 LINE 22 COLUMN 10 VALUE 
            "****** SECIMINIZ *****".
           05 LINE 22 COLUMN 26 PIC 99 USING N.
       01 EKRAN-3.
           05 LINE 4 COLUMN 7 PIC X(67) FROM ALL "-".
           05 LINE 5 COLUMN 7 VALUE "I ODEME TARIHI:".
           05 LINE 5 COLUMN 22 PIC 99 USING K-GUN.
           05 LINE 5 COLUMN 25 PIC 99 USING K-AY.
           05 LINE 5 COLUMN 30 PIC 99 USING K-YIL.
           05 LINE 5 COLUMN 73 VALUE "I".
           05 LINE 6 COLUMN 7 PIC X(67) FROM ALL "-".
           05 LINE 7 COLUMN 7 VALUE "I IZAHAT     :".
           05 LINE 7 COLUMN 23 PIC X(40) USING IZAHAT.
           05 LINE 7 COLUMN 73 VALUE "I".
           05 LINE 8 COLUMN 7 PIC X(67) FROM ALL "-".
           05 LINE 9 COLUMN 7 VALUE "I TUTAR     :".
           05 LINE 9 COLUMN 23 PIC 9(8) USING K-TUTAR.
           05 LINE 9 COLUMN 73 VALUE "I".
           05 LINE 10 COLUMN 7 PIC X(67) FROM ALL "-".
           05 LINE 11 COLUMN 7 VALUE "I ALIS TARIHI :".
           05 LINE 11 COLUMN 22 PIC 99 USING H-GUN.
           05 LINE 11 COLUMN 25 PIC 99 USING H-AY.
           05 LINE 11 COLUMN 30 PIC 99 USING H-YIL.
           05 LINE 11 COLUMN 73 VALUE "I".
           05 LINE 12 COLUMN 7 PIC X(67) FROM ALL "-".
       01 EKRAN-4.
           05 LINE 14 COLUMN 15 PIC X(45) FROM ALL "=". 
           05 LINE 15 COLUMN 15 VALUE 
            "SENET: ODENDI (1) / PROTESTO  (2) / CIRO (3)".
           05 LINE 16 COLUMN 15 VALUE 
            "CEK  : ODENDI (4) / KARSILIKSIZ (5) / CIRO (6)".
           05 LINE 17 COLUMN 15 VALUE
            "NAKIT: ODENDI (7) / ODENMEDI (8)".
           05 LINE 19 COLUMN 15 PIC X(45) FROM ALL "=".
           05 LINE 21 COLUMN 20 VALUE
            "**** HANGISI? ****".
           05 LINE 21 COLUMN 33 PIC 9 USING K-KNT.
       PROCEDURE DIVISION.
       BB0. MOVE "SECENEK GIRISI" TO KONU. MOVE "ANA MENU" TO ISLEM.
           DISPLAY EKRAN-1 EKRAN-2. 
		   DISPLAY (24 8) " < 0 > GIRERSENIZ PROGRAMDAN CIKARSINIZ".
       BB1. ACCEPT EKRAN-2. IF N = 99 OPEN OUTPUT KAYIT CLOSE KAYIT
           ELSE IF N = 0  GO SON
           ELSE IF N = 11 OR N = 12 OR N = 13 OR N = 14 OR N = 15
           OR N = 16 MOVE "VERI GIRISI" TO ISLEM PERFORM VERI-GIRISI
           ELSE IF N = 21 OR N = 22 OR N = 23 OR N = 24 OR N = 25
           OR N = 26 MOVE "VADE SONU DURUMLARI" TO ISLEM
           PERFORM ODEME-ISLENMESI
           ELSE IF N = 31 OR N = 32 OR N = 33 OR N = 34 OR N = 35
           OR N = 36 MOVE "SILME" TO ISLEM PERFORM SILME
           ELSE DISPLAY (23 8) N DISPLAY (23 11)
           "SECENEGINIZ YANLIS LUTFEN DOGRUSUNU GIRINIZ"  
		   GO BB1. 
		   PERFORM BB0. DISPLAY (23 8) N DISPLAY (23 11)
           "NOLU ISLEM TAMAMLANMISTIR". GO BB1.
       VERI-GIRISI SECTION.
       CS. OPEN I-O KAYIT
           IF N = 11 
           MOVE "BORC SENETLERI" TO KONU MOVE "BS" TO K-KISIM
           ELSE IF N = 12
           MOVE "ALACAK SENETLERI" TO KONU MOVE "AS" TO K-KISIM
           ELSE IF N = 13
           MOVE "BORC CEKLERI" TO KONU MOVE "BC" TO K-KISIM
           ELSE IF N = 14 
           MOVE "ALACAK CEKLERI" TO KONU MOVE "AC" TO K-KISIM
           ELSE IF N = 15 
           MOVE "BORC NAKIT" TO KONU MOVE "BN" TO K-KISIM
           ELSE IF N = 16
           MOVE "ALACAK NAKIT" TO KONU MOVE "AN" TO K-KISIM.
       CC0. MOVE ALL ZEROS TO K-TUTAR K-GUN K-AY K-YIL H-GUN H-AY H-YIL. 
           MOVE SPACES TO IZAHAT. DISPLAY EKRAN-1 EKRAN-3.
           IF N = 11 OR N = 12 OR N = 13 OR N = 16 
           DISPLAY (11 9) "VERIS TARIHI". DISPLAY (23 8) 
            "< ^B > BASARSANIZ BIR ALAN GERI DONERSINIZ".
           DISPLAY (24 8)
           "< ESC > TUSUNA BASARSINIZ ANA MENUYE DONERSINIZ".
           ACCEPT EKRAN-3 ON ESCAPE GO C-SON.
           MOVE 0 TO K-NO. MOVE K-TUTAR TO TUTAR1.
           MOVE IZAHAT TO IZ1. MOVE H-TARIH TO H-TARIH1.
       CC1. READ KAYIT RECORD INVALID KEY GO CC2.
           ADD 1 TO K-NO GO CC1.
       CC2. MOVE 0 TO K-KNT. MOVE TUTAR1 TO K-TUTAR.
           MOVE IZ1 TO IZAHAT. MOVE H-TARIH1 TO H-TARIH.
           WRITE BILGI INVALID KEY DISPLAY (24 7) ERASE
           DISPLAY (24 8) "DISKET BOZUK VEYA DOLU <ENT> BAS"
           ACCEPT CEVAP GO C-SON. GO CC0.
       C-SON. CLOSE KAYIT.
       ODEME-ISLENMESI SECTION.
       DS. IF N = 21 
           MOVE "BORC SENETLERI" TO KONU MOVE "BS" TO K-KISIM
           ELSE IF N = 22
           MOVE "ALACAK SENETLERI" TO KONU MOVE "AS" TO K-KISIM
           ELSE IF N = 23
           MOVE "BORC CEKLERI" TO KONU MOVE "BC" TO K-KISIM
           ELSE IF N = 24 
           MOVE "ALACAK CEKLERI" TO KONU MOVE "AC" TO K-KISIM
           ELSE IF N = 25 
           MOVE "BORC NAKIT" TO KONU MOVE "BN" TO K-KISIM
           ELSE IF N = 26
           MOVE "ALACAK NAKIT" TO KONU MOVE "AN" TO K-KISIM.
       DD0. MOVE 0 TO K-NO.
	       DISPLAY EKRAN-1. 
		   IF N = 21 OR N =23 OR N = 26 
           DISPLAY (11 9) "VERIS TARIHI"
           DISPLAY (24 8) "ISLEM YAPILACAK KAYDIN TARIHINI GIRINIZ".
       DD1. ACCEPT (5 22) K-GUN. ACCEPT (5 25) K-AY. 
	       ACCEPT (5 30) K-YIL.
           DISPLAY (5 40) "TARIH DOGRUMU  (E/H):".
           ACCEPT (5 62) CEVAP.
           IF CEVAP = "H" DISPLAY (5 40)
            "                       " GO DD1.
		   OPEN I-O KAYIT.
       DD2. READ KAYIT RECORD INVALID KEY GO DD3.
           DISPLAY EKRAN-1 EKRAN-3.
           IF N = 21 OR N = 23 OR N = 26 
           DISPLAY (11 9) "VERIS TARIHI"
           DISPLAY (24 1) ERASE (24 8) "ISTEDIGINIZ KAYIT BU MU (E/H):".
           ACCEPT (24 38) CEVAP.
		   IF CEVAP = "H" ADD 1 TO K-NO GO DD2.
           DISPLAY EKRAN-4.
       DD2-1. ACCEPT EKRAN-4.
           IF K-KISIM = "BS" AND K-KISIM = "AS" AND K-KNT > 1 OR
           K-KNT >3 GO DD4
           ELSE IF K-KISIM = "BC" AND K-KISIM = "AC" AND K-KNT > 4 OR
           K-KNT > 6 GO DD4
           ELSE IF K-KISIM = "BN" AND K-KISIM = "AN" AND K-KNT > 7 OR
           K-KNT > 8 GO DD4. REWRITE BILGI INVALID KEY 
           DISPLAY (24 8) "DISKET BOZUK ENT BASINIZ" ACCEPT CEVAP
           GO D-SON. DISPLAY (24 8) "ISLENECEK BASKA KAYIT VAR MI"
           ACCEPT CEVAP . IF CEVAP = "E" GO DD0 ELSE GO D-SON.
       DD3. DISPLAY (24 7) ERASE. DISPLAY (24 8)
           "BU TARIHLI KAYIT YOK YENI TARIH GIRILECEKMI (E/H):".
           ACCEPT (24 63) CEVAP. IF CEVAP = "E" GO DD0
           ELSE GO D-SON.
       DD4. DISPLAY (24 8) ERASE. DISPLAY (24 8)
           "ODEME DURUMU YANLIS GIRILDI ENT BASINIZ" ACCEPT CEVAP
           GO DD2-1.
       D-SON. CLOSE KAYIT.
       SILME SECTION.
	   ES. OPEN I-O KAYIT.
           IF N = 31
           MOVE "BORC SENETLERI" TO KONU MOVE "BS" TO K-KISIM
           ELSE IF N = 32
           MOVE "ALACAK SENETLERI" TO KONU MOVE "AS" TO K-KISIM
           ELSE IF N = 33
           MOVE "BORC CEKLERI" TO KONU MOVE "BC" TO K-KISIM
           ELSE IF N = 34 
           MOVE "ALACAK CEKLERI" TO KONU MOVE "AC" TO K-KISIM
           ELSE IF N = 35 
           MOVE "BORC NAKIT" TO KONU MOVE "BN" TO K-KISIM
           ELSE IF N = 36
           MOVE "ALACAK NAKIT" TO KONU MOVE "AN" TO K-KISIM.
       EE0. DISPLAY EKRAN-1. MOVE 0 TO K-NO. MOVE "H" TO DD.
           DISPLAY (24 8) "SILINECEK KAYDIN TARIHINI GIRINIZ".
           DISPLAY (5 9) "ODEME TARIHI:  /  /  ".
	   EE1. ACCEPT (5 22) K-GUN. ACCEPT (5 25) K-AY.
           ACCEPT (5 28) K-YIL.
           DISPLAY (5 40) "TARIH DOGRUMU ? (E/H):". ACCEPT (5 60) CEVAP.
           IF CEVAP = "H" GO EE1.
       EE2. READ KAYIT RECORD INVALID KEY GO EE3.
           DISPLAY EKRAN-1 EKRAN-3.
           IF N = 31 OR N = 33 OR N = 36 DISPLAY (11 9) "VERIS TARIHI".
           DISPLAY (24 8) "SILMEK ISTEDIGINIZ KAYIT BUMU".
           ACCEPT (24 50) CEVAP. IF CEVAP = "H" ADD 1 TO K-NO GO EE2.
       EE21. SUBTRACT 1 FROM K-NO. MOVE "E" TO DD. 
	       IF DD = "E" DELETE KAYIT INVALID KEY
           DISPLAY (24 8) "SILEMIYORUM DISKET BOZUK ENT BAS"
           ACCEPT CEVAP GO E-SON.
           IF DD = "H" SUBTRACT 1 FROM K-NO.
           REWRITE BILGI. ADD 1 TO K-NO GO EE21.
           DISPLAY (24 8) "SILINECEK BASKA KAYIT VARMI (E/H):".
           ACCEPT CEVAP. IF CEVAP = "E" GO EE0 ELSE GO E-SON.
       EE3. DISPLAY (24 8)
           "BU TARIHLI KAYIT YOK YENI TARIH GIRILECEK MI (E/H):".
           ACCEPT CEVAP. IF CEVAP = "E" GO EE0.
       E-SON. CLOSE KAYIT.
	   SON SECTION.
       FF. EXIT PROGRAM.
    