       IDENTIFICATION DIVISION.
       PROGRAM-ID. FATURA.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FATURA ASSIGN TO DISK ORGANIZATION INDEXED
           ACCESS MODE IS DYNAMIC RECORD KEY FATURA-KEY.
           SELECT FNO ASSIGN TO DISK ORGANIZATION INDEXED
           ACCESS MODE RANDOM RECORD KEY FNO-KEY.
           SELECT YAZICI ASSIGN TO PRINTER.
       DATA DIVISION.
       FILE SECTION.
       FD FATURA LABEL RECORDS STANDARD VALUE OF FILE-ID "B:STOK1.DOS".
       01 FATURA-KAYDI.  05 FATURA-KEY PIC X(7).
           05 MALIN-ISMI PIC X(20).    05 MIN-MIKTAR PIC 9(4).
           05 MEVCUT     PIC 9(4).     05 MAX-MIKTAR PIC 9(4).
           05 BIRIM-MALIYET PIC 9(7).  05 SATIS-FIATI PIC 9(7).
           05 KDV-ORANI PIC 9V99.
       FD FNO LABEL RECORDS STANDARD VALUE OF FILE-ID "B:FNO.KYD".
       01 FNO-KAYDI.
           05 FNO-KEY PIC 9.
           05 F-NUMARA PIC 9(5).
           05 F-TARIH .
              10 F-AY PIC 99.
              10 F-GUN PIC 99.
       FD YAZICI LABEL RECORDS OMITTED.
       01 CIKTI-SATIRI PIC X(80).
       WORKING-STORAGE SECTION.
       77 BN PIC XXX VALUE SPACES.
       77 MIL PIC X(6) VALUE SPACES.
       01 BIR-HARF.  03 BIRLER .  05 FILLER PIC X(50) VALUE
           "     BIR  IKI  UC   DORT BES  ALTI YEDI SEKIZDOKUZ".
           03 XBIR REDEFINES BIRLER OCCURS 10 TIMES.
              05 XX PIC X(5).
       01 ON-HARF.  03 ONLAR.
              05 FILLER PIC X(42) VALUE 
              "      ON    YIRMI OTUZ  KIRK  ELLI  ALTMIS".
              05 FILLER PIC X(18) VALUE
              "YETMISSEKSENDOKSAN".
           03 YON REDEFINES ONLAR OCCURS 10 TIMES.
              05 YY PIC X(6).
       01 YUZ-HARF.  03 YUZLER.  05 FILLER PIC X(48) VALUE 
              "        YUZ     IKIYUZ  UCYUZ   DORTYUZ BESYUZ  ".
              05 F PIC X(32) VALUE
              "ALTIYUZ YEDIYUZ SEKIZYUZDOKUZYUZ".  
           03 ZBIN REDEFINES YUZLER OCCURS 10 TIMES.
              05 ZZ PIC X(8).
       01 RAKAM.  03 MILYON.  05 M1 PIC 9.  05 M2 PIC 9.  05 M3 PIC 9.
           03 BIN.  05 B1 PIC 9.  05 B2 PIC 9.  05 B3 PIC 9.
           03 YUZ.  05 X1 PIC 9.  05 X2 PIC 9.  05 X3 PIC 9.
       77 F-GENEL PIC 9(9).
       77 K PIC 99 VALUE 0.
       77 CEVAP PIC X VALUE SPACE.
       77 BOSLUK PIC X VALUE SPACE.
       77 F-TUTARI PIC 9(8).
       77 F-TOPLAM PIC 9(9).
       77 F-KDV PIC 9(8).
       77 T-KDV PIC 9(8).
       77 DD PIC X.
       77 BRM PIC 9(4).
       77 DURUM PIC X(6).
       77 ESCKOD PIC 99.
       77 N PIC 99.
       01 TARIH-1.  05 AY-1 PIC 99.  05 GUN-1 PIC 99.
       01 AYLAR.  02 AYL.  05 FILLER PIC X(42) VALUE
           "OCAK   SUBAT  MART   NISAN  MAYIS  HAZIRAN".
           05 FILLER PIC X(42) VALUE 
           "TEMMUZ AGUSTOSEYLUL  EKIM   KASIM  ARALIK ".
           02 AY REDEFINES AYL OCCURS 12 TIMES PIC X(7).
       01 TABLO.  03 TBL OCCURS 10 TIMES INDEXED BY I.
           05 T-ISIM PIC X(20).  05 T-BIRIM PIC 9(4).
           05 T-FIAT PIC 9(5).   05 T-TUTAR PIC 9(7).
       01 BAS-1.  05 FILLER PIC XXX VALUE SPACES.
           05 FILLER PIC X(62) VALUE "# BEBIM #".
           05 FILLER PIC X(13) VALUE "FATURA".
       01 BAS-2.  05 FILLER PIC XXX VALUE SPACES.
           05 FILLER PIC X(56) VALUE
           "=BURSA EGITIM VE BILGI ISLEM MERKEZI SAN. VE TIC. A.S.=".
       01 BAS-3.  05 FILLER PIC XXX VALUE SPACES.
           05 FILLER PIC X(7) VALUE "ADRES:".
           05 ADRES1 PIC X(49).
       01 BAS-4.  05 FILLER PIC X(10) VALUE SPACES.
           05 ADRES2 PIC X(49).
       01 BAS-5.  05 FILLER PIC XXX VALUE SPACES.
           05 FILLER PIC X(77) VALUE ALL "-".
       01 BAS-6.  05 FILLER PIC XXX VALUE SPACES.
           05 FILLER PIC X(12) VALUE "MUSTERI VD:".
           05 MVD-NO PIC X(25)B.
           05 FILLER PIC X(10) VALUE "FATURA NO:".
           05 FATURA-NO PIC 9(5)BB.
           05 FILLER PIC X(7) VALUE "TARIH:".
           05 FGUN PIC Z9.
           05 FILLER PIC X VALUE "/".
           05 FAY PIC Z9.
           05 F PIC X(4) VALUE "1990".
       01 BAS-7.  05 FILLER PIC XXX VALUE SPACES.
           05 F PIC X(35) VALUE
           "VERGIDAIRESI:SETBASI:16098400198".
       01 BAS-8.  05 F PIC XXX VALUE SPACES.
           05 F PIC X(8) VALUE "SIRA".
           05 F PIC X(26) VALUE "ACIKLAMA".
           05 F PIC X(10) VALUE "BIRIM".
           05 F PIC X(16) VALUE "FIATI".
           05 F PIC X(17) VALUE "TUTARI".
       01 BAS-9.  05 F PIC X(4) VALUE SPACES.  05 SIRA PIC 99.
           05 F PIC X(5) VALUE SPACES.
           05 ACIKLAMA PIC X(20)B(6).
           05 BIRIM PIC Z(3)B(6).
           05 FIATI PIC ZZ,ZZ9.
           05 F PIC X(6) VALUE ".-".
           05 TUTARI PIC ZZ,ZZZ,ZZ9.
           05 F PIC XX VALUE ".-".
       01 BAS-10.  05 F PIC X(53) VALUE SPACES.
           05 F PIC X(8) VALUE "TOPLAM:".
           05 TOPLAM PIC ZZ,ZZZ,ZZ9.
           05 F PIC XX VALUE ".-".
       01 BAS-11.  05 F PIC X(53) VALUE SPACES.
           05 F PIC X(8) VALUE "KDV:".
           05 KDV PIC ZZ,ZZZ,ZZ9.
           05 F PIC XX VALUE ".-".
       01 BAS-12.  05 F PIC X(47) VALUE SPACES.
           05 F PIC X(14) VALUE "GENEL TOPLAMI:".
           05 GENEL-TOPLAM PIC ZZ,ZZZ,ZZ9.
           05 F PIC XX VALUE ".-".
       01 BAS-13.  05 F PIC X(61) VALUE SPACE.
           05 F PIC X(13) VALUE ALL "-".
       01 BAS-14.  05 F PIC X(61) VALUE ALL "-".
           05 F PIC X(13) VALUE ALL "=".
       01 BAS-15.  05 F PIC XXX VALUE SPACE.
           05 F PIC  X(7) VALUE "YANLIZ".
           05 KARAKTER PIC X(67).
           05 F PIC XXX VALUE "TL".
       01 BAS-16.  05 F PIC XXX VALUE SPACE.
           05 F PIC X(36) VALUE 
             "MERKEZ: BASAK CAD. 40/3 HEYKEL/BURSA".
           05 F PIC X(19) VALUE 
              "TEL:223255-215264".
       01 BAS-17.  05 F PIC X(30) VALUE SPACES.
           05 F PIC X(46) VALUE 
             "SUBE:YESILLI MYD. HILMI CAKIR HANI KAT:5".
           05 F PIC X(23) VALUE 
              "BALIKESIR TEL:16707".
       SCREEN SECTION.
       01 EKRAN1. 05 BLANK SCREEN.
           05 LINE 1 COLUMN 1  VALUE "BEBIM A.S.".
		   05 LINE 2 COLUMN 1 VALUE "ANA MENU".
           05 LINE 3 COLUMN 1 PIC X(10) FROM ALL "*".
           05 LINE 8 COLUMN 10 PIC X(40) FROM ALL "*".
           05 LINE 9 COLUMN 10 VALUE 
               "I         FATURA PROGRAMI            I".
           05 LINE 10 COLUMN 10 PIC X(40) FROM ALL "-".
           05 LINE 11 COLUMN 10 VALUE 
           "I      1:MUSTERIYE FATURA KESME    I".
           05 LINE 12 COLUMN 10 VALUE 
           "I                      I".
           05 LINE 13 COLUMN 10 VALUE 
           "I      2:ANA PROGRAMA DONUS        I".
           05 LINE 14 COLUMN 10 PIC X(40) FROM ALL "*".
           05 LINE 15 COLUMN 10 VALUE 
               "I        ***** SECIMINIZ? *****        I".
           05 LINE 16 COLUMN 10 PIC X(40) FROM ALL "*".
           05 LINE 15 COLUMN 33 PIC 99 USING K.
       01 EKRAN2.  05 LINE 20 COLUMN 10 PIC Z9 USING K.
           05 LINE 20 COLUMN 13 VALUE  ". NOLU ISLEM TAMAMLANMISTIR".
       01 EKRAN3. 05 LINE 20 COLUMN 10 PIC Z9 USING K.
           05 LINE 20 COLUMN 13 VALUE 
           ". NOLU SECENEK YANLIS LUTFEN DOGRUSUNU GIRINIZ".
       01 EKRAN4.  05 BLANK SCREEN.
           05 LINE 1 COLUMN 3 VALUE "BEBIM A.S.         ADRES:".
           05 LINE 2 COLUMN 3 VALUE "[FATURA]".
	       05 LINE 3 COLUMN 3 VALUE "MUSTERI VRD:".
           05 LINE 3 COLUMN 58 VALUE "F-TARIH:  /  1990".
           05 LINE 4 COLUMN 3 VALUE "STOKNO ACIKLAMA".
           05 LINE 4 COLUMN 41 VALUE
           "BIRIM     FIAT    TUTAR    DURUM ".
           05 LINE 5 COLUMN 3 PIC X(77) FROM ALL "-".
           05 LINE 16 COLUMN 63 PIC X(13) FROM ALL "-".
           05 LINE 17 COLUMN 55 VALUE "TOPLAM:".
           05 LINE 18 COLUMN 58 VALUE "KDV:".
           05 LINE 19 COLUMN 63 PIC X(13) FROM ALL "=".
           05 LINE 20 COLUMN 9 VALUE "GENEL TOPLAM:".
           05 LINE 21 COLUMN 3 PIC X(77) FROM ALL "=".
           05 LINE 22 COLUMN 3 VALUE "YANLIZ:".
           05 LINE 22 COLUMN 78 VALUE "TL".
           05 LINE 23 COLUMN 3 PIC X(77) FROM ALL "=".
       PROCEDURE DIVISION.
       BASLA. DISPLAY EKRAN1.
       10. ACCEPT EKRAN1.
           IF K = 88 PERFORM FATURANO
           ELSE IF K = 1 PERFORM FATURA-KESME
           ELSE IF K = 2 GO FAT-SON
           ELSE DISPLAY EKRAN3 GO 10.
           DISPLAY EKRAN1 EKRAN2 GO 10.
       FATURANO SECTION.
       AA0. OPEN OUTPUT FNO. MOVE 1 TO FNO-KEY.
           DISPLAY (1 1) ERASE. MOVE ALL ZEROS TO F-NUMARA F-GUN F-AY.
           DISPLAY (10 1) "FATURA NUMARASI:".
           DISPLAY (12 1) "FATURA GUNU    :".
           DISPLAY (13 1) "FATURA AYI     :".
       AA1. ACCEPT (10 18) F-NUMARA WITH PROMPT UPDATE.
           ACCEPT (12 18) F-GUN WITH PROMPT UPDATE.
           ACCEPT (13 18) F-AY WITH PROMPT UPDATE.
           DISPLAY (17 5) "DOGRU MU(E/H):".
           ACCEPT (17 21) CEVAP WITH PROMPT.
           IF CEVAP = "H" GO AA1.
           WRITE FNO-KAYDI INVALID KEY DISPLAY (24 1)
           "** YAZAMIYORUM ** DISKET DOLU VEYA BOZUK {ENT} BAS:"
           ACCEPT (24 55) CEVAP. CLOSE FNO.
       FATURA-KESME SECTION.
       BB0. OPEN I-O FATURA FNO OUTPUT YAZICI.
           MOVE 1 TO FNO-KEY. READ FNO RECORD INVALID KEY
           DISPLAY (24 1) "** OKUYAMIYORUM ** DISKET BOZUK [ENT] BAS"
           ACCEPT (24 55) CEVAP GO FATURA-SON. SET I TO 1.
           PERFORM SIFIRLAMA 10 TIMES. SET I TO 1. 
       BB1. MOVE SPACES TO ADRES1 ADRES2 MVD-NO KARAKTER. MOVE ALL
           "." TO FATURA-KEY. MOVE 0 TO GUN-1 AY-1 F-TOPLAM F-KDV
           F-GENEL RAKAM T-KDV. MOVE 1 TO LIN N. DISPLAY EKRAN4.
       BB3. DISPLAY (24 1) "ADRES GIRMEZSENIZ ANA MENUYE DONERSINIZ".
           ACCEPT (1 28) ADRES1 WITH PROMPT UPDATE.
           IF ADRES1 = SPACES GO FATURA-SON. ADD 1 TO F-NUMARA.
           DISPLAY (24 1) ERASE. DISPLAY (24 1)
           "[ESC] TUSUNA BASARSANIZ BIR ALAN GERI GIDERSINIZ".
       BB4. ACCEPT (2 25) ADRES2 WITH PROMPT UPDATE.
           ACCEPT ESCKOD FROM ESCAPE KEY. IF ESCKOD = 1 GO BB3.
       BB5. ACCEPT (3 15) MVD-NO WITH PROMPT UPDATE.
           ACCEPT ESCKOD  FROM ESCAPE KEY. IF ESCKOD =1 GO BB4.
           DISPLAY (3 51) F-NUMARA.
       BB6. ACCEPT (3 66) GUN-1 WITH PROMPT UPDATE.
           ACCEPT ESCKOD FROM ESCAPE KEY. IF ESCKOD = 1 GO BB5.
           ACCEPT (3 69) AY-1 WITH PROMPT UPDATE.
           ACCEPT ESCKOD FROM ESCAPE KEY . IF ESCKOD = 1 GO BB6.
           IF F-TARIH > TARIH-1 DISPLAY (24 50)
           "TARIH YANLIS [ENT] BAS:"
           ACCEPT (24 75) CEVAP DISPLAY (3 67) "               "
           GO BB6. DISPLAY (3 66) GUN-1. DISPLAY (3 69) AY (AY-1).
           DISPLAY (3 76) "990".
       BB7. ACCEPT (LIN + 5 3) FATURA-KEY WITH PROMPT UPDATE.
           ACCEPT ESCKOD FROM ESCAPE KEY. IF ESCKOD = 1
           DISPLAY (3 67) "        " GO BB6.
           READ FATURA RECORD INVALID KEY 
           DISPLAY (24 1) ERASE DISPLAY (24 1)
           "BU STOK NOLU KAYIT DOSYADA BULUNAMADI [ENT] BAS:"
           ACCEPT (24 50) CEVAP DISPLAY (24 1) ERASE DISPLAY (24 1)
           "[ESC] TUSUNA BASILINCA BIR ALAN GERI GIDERSINIZ" GO BB7.
           DISPLAY  (LIN + 5 17) MALIN-ISMI.
       BB8. ACCEPT (LIN + 5 42) BRM WITH PROMPT UPDATE.
           ACCEPT ESCKOD FROM ESCAPE KEY. IF ESCKOD = 1 GO BB7.
           IF BRM > MEVCUT DISPLAY (24 1) ERASE (24 1)
           "STOKTA" (24 8) MEVCUT (24 14) "BIRIM MAL VAR ENT BAS"
           ACCEPT CEVAP GO BB8.
           DISPLAY (LIN + 5 52) SATIS-FIATI.
           MULTIPLY BRM BY SATIS-FIATI GIVING F-TUTARI.
           MULTIPLY F-TUTARI BY KDV-ORANI GIVING T-KDV.
           DISPLAY (LIN + 5 62) F-TUTARI.
           SUBTRACT BRM FROM MEVCUT. IF MEVCUT < MIN-MIKTAR
           MOVE "AZ" TO DURUM ELSE IF MEVCUT >MAX-MIKTAR
           MOVE "COK" TO DURUM ELSE MOVE "NORMAL" TO DURUM.
           DISPLAY (LIN + 5 74) DURUM. ACCEPT ESCKOD FROM ESCAPE KEY.
           IF ESCKOD = 1 ADD BRM TO MEVCUT GO BB8.
           REWRITE FATURA-KAYDI INVALID KEY
           DISPLAY (24 1) ERASE DISPLAY (24 1) 
           "YAZAMIYORUM *** DISKET BOZUK *** [ENT] BAS"
           ACCEPT (24 45) CEVAP GO FATURA-SON.
           ADD F-TUTARI TO F-TOPLAM. ADD T-KDV TO F-KDV.
           MOVE MALIN-ISMI TO T-ISIM (I). MOVE BRM TO T-BIRIM (I).
           MOVE SATIS-FIATI TO T-FIAT (I).
           MOVE F-TUTARI TO T-TUTAR (I). IF N = 10 GO BB10.
           DISPLAY (24 1) ERASE. DISPLAY (24 1)
           "ALINAN BASKA MAL VAR MI [E/H]:". ACCEPT CEVAP.
           IF CEVAP = "E" SET I UP BY 1 ADD 1 TO LIN
           ADD 1 TO N GO BB7.
       BB10. DISPLAY (17 63) F-TOPLAM.
           ADD F-TOPLAM F-KDV GIVING F-GENEL. MOVE F-GENEL TO RAKAM.
           DISPLAY (1863) F-KDV. DISPLAY (20 63) F-GENEL.
           MOVE SPACES TO MIL BN KARAKTER.
           IF B1 > 0 OR B2 > 0 OR B3 > 0 MOVE "BIN" TO BN.
           IF M1 > 0 OR M2 > 0 OR M3 > 0 MOVE "MILYON" TO MIL.
           IF B1 = 0 AND B2 = 0 AND B3 = 1 MOVE 0 TO B3.
           STRING ZZ (M1 + 1) DELIMITED BY SPACES 
                   YY (M2 + 1) DELIMITED BY SPACES
                   XX (M3 + 1) DELIMITED BY SPACES
                   MIL DELIMITED BY SPACES
				   ZZ (B1 + 1) DELIMITED BY SPACES
                   YY (B2 + 1) DELIMITED BY SPACES
                   XX (B3 + 1) DELIMITED BY SPACES
                   BN DELIMITED BY SPACES
                   ZZ (X1 + 1) DELIMITED BY SPACES
                   YY (X2 + 1) DELIMITED BY SPACES
                   XX (X3 + 1) DELIMITED BY SPACES INTO KARAKTER.
           DISPLAY (22 11) KARAKTER. DISPLAY (24 1) ERASE.
           DISPLAY (24 1)
           "BU FATURANINI PRINTER CIKTISINI ISTIYORMUSUNUZ :".
           ACCEPT (24 54) CEVAP WITH PROMPT.
           SUBTRACT 1 FROM F-NUMARA. IF CEVAP = "H" GO BB1.
           MOVE TARIH-1 TO F-TARIH. MOVE GUN-1 TO FGUN.
           MOVE AY-1 TO FAY. MOVE F-NUMARA TO FATURA-NO.
           WRITE CIKTI-SATIRI FROM BAS-5 AFTER 3.
           WRITE CIKTI-SATIRI FROM BAS-1.
           WRITE CIKTI-SATIRI FROM BAS-2.
           WRITE CIKTI-SATIRI FROM BAS-3.   
           WRITE CIKTI-SATIRI FROM BAS-4.
           WRITE CIKTI-SATIRI FROM BAS-7.
           WRITE CIKTI-SATIRI FROM BAS-5.
           WRITE CIKTI-SATIRI FROM BAS-6.
           WRITE CIKTI-SATIRI FROM BAS-5.
           WRITE CIKTI-SATIRI FROM BAS-8.
           WRITE CIKTI-SATIRI FROM BAS-5.
           SET I TO 1. MOVE 1 TO SIRA.
       BB9. MOVE T-ISIM (I) TO ACIKLAMA. MOVE T-BIRIM (I) TO BIRIM.
           MOVE T-FIAT (I) TO FIATI. MOVE T-TUTAR (I) TO TUTARI.
           WRITE CIKTI-SATIRI FROM BAS-9 AFTER 1. SET I UP BY 1.
           ADD 1 TO SIRA. IF SIRA NOT > N GO BB9.
           SUBTRACT N FROM 10 GIVING N.
           WRITE CIKTI-SATIRI FROM BOSLUK AFTER N.
           WRITE CIKTI-SATIRI FROM BAS-13 AFTER 1.
           MOVE F-TOPLAM TO TOPLAM. MOVE  F-KDV TO KDV.
           MOVE F-GENEL TO GENEL-TOPLAM.
           WRITE CIKTI-SATIRI FROM BAS-10.
           WRITE CIKTI-SATIRI FROM BAS-11.
           WRITE CIKTI-SATIRI FROM BAS-14.
           WRITE CIKTI-SATIRI FROM BAS-14.
           WRITE CIKTI-SATIRI FROM BAS-5.
           WRITE CIKTI-SATIRI FROM BAS-15.
           WRITE CIKTI-SATIRI FROM BAS-5.
           WRITE CIKTI-SATIRI FROM BAS-16.
           WRITE CIKTI-SATIRI FROM BAS-17.
           WRITE CIKTI-SATIRI FROM BAS-5.
           WRITE CIKTI-SATIRI FROM BOSLUK AFTER 1. GO BB1.
       SIFIRLAMA. MOVE 0 TO T-BIRIM (I) T-FIAT (I) T-TUTAR (I).
           MOVE SPACES TO T-ISIM (I). SET I UP BY 1.
       FATURA-SON. REWRITE FNO-KAYDI INVALID KEY DISPLAY (24 1) ERASE
           DISPLAY (24 1) "YAZAMIYORUM DISKET BOZUK [ENT] BAS"
           ACCEPT (24 45) CEVAP. CLOSE FATURA FNO YAZICI.
       FAT-SON SECTION.
       C10. EXIT PROGRAM.     
                      
   		   
            
           
            
           
      
       
      
 
       