       IDENTIFICATION DIVISION.
	   PROGRAM-ID. TELEFON.
	   ENVIRONMENT DIVISION.
	   INPUT-OUTPUT SECTION.
	   FILE-CONTROL.
	           SELECT DOSYA ASSIGN TO DISK.
       DATA DIVISION.
	   FILE SECTION.
	   FD DOSYA LABEL RECORD STANDARD VALUE OF FILE-ID "TELE.DAT".
	   01 KAYIT.
           02 TEL-NO PIC 9(7).
           02 ADI-SOYADI PIC X(25).
       SCREEN SECTION.
	   01 SABIT-EKRAN.
           02 LINE 1 COLUMN 1 BLANK SCREEN.
           02 LINE 5 COLUMN 1 REVERSE-VIDEO VALUE
		      "TELEFON NOYU GIRINIZ.:".
           02 LINE 7 COLUMN 1 REVERSE-VIDEO VALUE
		     "ADI SOYADI GIRINIZ...:".		   
       01 DEGISIK-EKRAN. 
           02 LINE 5 COLUMN 25 PIC 9(7)	TO TEL-NO.
           02 LINE 7 COLUMN 25 PIC X(25) TO ADI-SOYADI.
       PROCEDURE DIVISION.
	   BASLA.
           OPEN OUTPUT DOSYA.
           DISPLAY SABIT-EKRAN.
       GIRIS.
           ACCEPT DEGISIK-EKRAN.
           IF TEL-NO=0 GO TO SON.
           WRITE KAYIT.
           GO TO GIRIS.
       SON. CLOSE DOSYA. STOP RUN.
       	   	   		   		   		   