       IDENTIFICATION DIVISION.
       PROGRAM-ID. SEMA1.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MIZAN ASSIGN TO DISK ORGANIZATION INDEXED ACCESS
	       DYNAMIC RECORD KEY MUSTERI-KODU.
           SELECT CARI ASSIGN TO DISK ORGANIZATION INDEXED ACCESS
           DYNAMIC RECORD KEY CARI-ANAHTARI.
       DATA DIVISION.
       FILE SECTION.
       COPY B:FD.BLM.
       WORKING-STORAGE SECTION.
       77 SIFRE PIC X(10) VALUE SPACES.
       77 K PIC 99 VALUE ZEROS.
       SCREEN SECTION.
       01 EKRAN-1.
           05 BLANK SCREEN.
           05 LINE 5 COLUMN 15 PIC X(31)   FROM ALL "*".
           05 LINE 6 COLUMN 15 VALUE 
           "BEBIM PROGRAMLAMA MERKEZI".
           05 LINE 8 COLUMN 21 VALUE "CARI HESAP PROGRAMI".
           05 LINE 10 COLUMN 22 VALUE "SIFREYI GIRINIZ".
           05 LINE 11 COLUMN 22 VALUE "**          **".
           05 LINE 12 COLUMN 15 PIC X(31) FROM ALL "*".
           05 LINE 11 COLUMN 24 PIC X(10) USING SIFRE.
       01 EKRAN-2.
           05 BLANK SCREEN.
           05 LINE 1 COLUMN 1 VALUE "BEBIM A.S.".
           05 LINE 5 COLUMN 15 VALUE "CARI HESAP PROGRAMI".
           05 LINE 6 COLUMN 15 PIC X(37) FROM ALL "=".
           05 LINE 7 COLUMN 15 VALUE "[1]:CARI MIZAN PROGRAMI".
           05 LINE 8 COLUMN 15 VALUE "[2]:CARI HESAP PROGRAMI".
           05 LINE 10 COLUMN 15 VALUE 
           "[3]:CARI/MIZAN DOKUMU ** EKRANDAN **".
           05 LINE 11 COLUMN 15 VALUE 
           "[4]:CARI/MIZAN DOKUMU ** YAZICIDAN **".
           05 LINE 12 COLUMN 15 VALUE 
           "[5]:PROGRAMDAN CIKIS".
           05 LINE 13 COLUMN 15 PIC X(37) FROM ALL "=".
           05 LINE 17 COLUMN 15 VALUE "*** SECIMINIZ:  ***".
           05 LINE 17 COLUMN 30 PIC Z9 USING K.
       PROCEDURE DIVISION.
       BASLA. DISPLAY EKRAN-1. ACCEPT EKRAN-1.
           IF SIFRE NOT = "BEBIM A.S." DISPLAY (1 1) ERASE STOP RUN.
           DISPLAY EKRAN-2.
       A10. ACCEPT EKRAN-2.
           IF K = 99 OPEN OUTPUT MIZAN CLOSE MIZAN
           ELSE IF K = 88 OPEN OUTPUT CARI CLOSE CARI
           ELSE IF K = 1 CALL "BM1"
           ELSE IF K = 2 CALL "BM2"
           ELSE IF K = 3 CALL "BM3"
           ELSE IF K = 4 CALL "BM4"
           ELSE IF K = 5 DISPLAY (1 1) ERASE STOP RUN
           ELSE DISPLAY (20 5) K DISPLAY (20 8)
           "NOLU SECENEK YANLIS LUTFEN DOGRUSUNU GIRINIZ" GO A10.
           DISPLAY EKRAN-2. DISPLAY (20 5) K. DISPLAY (20 8)
           "NOLU ISLEM TAMAMLANMISTIR". GO A10.
       END-OF-JOB.     
