       IDENTIFICATION  DIVISION.
       PROGRAM-ID. YAR1.
	   AUTHOR. NIHAL SAMARAZ.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OSS1 ASSIGN TO DISK ORGANIZATION INDEXED
           ACCESS DYNAMIC RECORD KEY OGR.
           SELECT YAZICI ASSIGN TO PRINTER.
       DATA DIVISION.
       FILE SECTION.
       FD OSS1 LABEL RECORD STANDARD VALUE OF FILE-ID "OSS1.DOS".
       01 OGR-KAYDI.
           02 OGR.
              03 OGR-NO PIC 9(6).
              03 SINIFI PIC X(10).
           02 ADI-SOYADI PIC X(20).  
           02 BABA-ADI PIC X(10).
           02 ANNE-ADI PIC X(10).
           02 DOGUM-TARIHI PIC X(10).
           02 DOGUM-YERI PIC X(12).
           02 CINSIYETI PIC X(5).
           02 UYRUGU PIC X(8).
           02 KAN-GRUBU PIC X(12).
           02 OGRENCI-ADRESI PIC X(20).
           02 DERSHANE-UNVANI PIC X(12).
           02 DERSHANE-ADRESI PIC X(20).
       WORKING-STORAGE SECTION.
       77 CEVAP PIC X VALUE SPACES.
       77 SEC PIC 99 VALUE 0.
       77 SNO PIC 9(4) VALUE 0.
       77 BOLUM PIC X(10) VALUE SPACES.
       77 SIFRE PIC X(10) VALUE SPACES.
       77 SIRA PIC 9(4) VALUE 0. 
       77 CIZGI PIC X(80) VALUE ALL "Û".
       01 BAS1.
           02 F PIC X(25) VALUE SPACES.
           02 SINIF PIC X(10).
           02 F PIC XXX VALUE SPACES.
           02 F PIC X(25) VALUE "BOLUMU DOKUMLERI".
           02 F PIC X(12) VALUE "SAYFA NO:".
           02 SSNO PIC 9(4).
       01 BAS2.
           02 F PIC X(25) VALUE SPACES.
           02 F PIC X(29) VALUE ALL "Û".
       01 BAS3.
           02 F PIC XXX VALUE SPACES.
           02 F PIC X(7) VALUE "OGR NO".
           02 F PIC X(21) VALUE "ADI SOYADI".
           02 F PIC X(11) VALUE "BABA ADI".
           02 F PIC X(13) VALUE "DOGUM TARIHI".
           02 F PIC X(13) VALUE "DOGUM YERI".
           02 F PIC X(10) VALUE "CINSIYETI".
       01 DETAY.
           02 F PIC XXX VALUE SPACES.
           02 O-NO PIC 9(6)B.
           02 AD-SOYAD PIC X(20)B.
           02 B-ADI PIC X(10)B.
           02 D-TARIHI PIC X(10)BBB.
           02 D-YERI PIC X(12)B.
           02 CINS PIC X(5).
       SCREEN SECTION.   
       01 EKRAN-1.
           02 BLANK SCREEN.
           02 LINE 8 COLUMN 10 PIC X(40) FROM ALL "Û".
           02 LINE 9 COLUMN 10 VALUE
            "Û SAMARAZ OSS HAZIRLIK EGITIM MERKEZI Û".
           02 LINE 10 COLUMN 10 VALUE
            "Û        DENEME SINAVI PROGRAMI       Û".
           02 LINE 11 COLUMN 10 VALUE
            "Û            SIFREYI GIRINIZ          Û".
           02 LINE 12 COLUMN 10 VALUE
		    "Û       ééé            ééé            Û".
           02 LINE 13 COLUMN 10 PIC X(40) FROM ALL "Û".
           02 LINE 12 COLUMN 24 PIC X(10) USING SIFRE.
       01 EKRAN-2.
           02 BLANK SCREEN.
           02 LINE 1 COLUMN 1 VALUE "SAMARAZ A.S.".
           02 LINE 2 COLUMN 1 BLINK VALUE "A N A   M E N U".
           02 LINE 3 COLUMN 1 PIC X(16) FROM ALL "@".
           02 LINE 5 COLUMN 10 PIC X(40) FROM ALL "@".
           02 LINE 6 COLUMN 10 VALUE 
            "Û [1]: OGRENCI BILGILERI GIRISI    Û".
           02 LINE 7 COLUMN 10 VALUE
            "Û [2]: BILGILERDE DEGISIKLIK       Û".
           02 LINE 8 COLUMN 10 VALUE 
            "Û [3]: HERHANGI BIR KAYDIN IPTALI  Û".
           02 LINE 9 COLUMN 10 VALUE 
            "Û [4]: EKRAN DOKUMU                Û".
           02 LINE 10 COLUMN 10 VALUE 
            "Û [5]: YAZICI DOKUMU               Û".
           02 LINE 11 COLUMN 10 VALUE 
            "Û [6]: ANA PROGRAMA DONUS          Û".
           02 LINE 12 COLUMN 10 PIC X(40) FROM ALL "@".
           02 LINE 13 COLUMN 10 VALUE 
            "Û  S E C I M I N I Z  [    ]    Û".  
           02 LINE 13 COLUMN 36 PIC 99 USING SEC.
       01 EKRAN-3.
           02 BLANK SCREEN.
           02 LINE 1 COLUMN 1 BLINK VALUE "DENEME".
           02 LINE 5 COLUMN 10 PIC X(55) FROM ALL "Û".
           02 LINE 6 COLUMN 10 VALUE
            "Û OGRENCININ NUMARASI.....:".
           02 LINE 6 COLUMN 38 PIC 9(6) USING OGR-NO.
       01 EKRAN-4.
           02 LINE 7 COLUMN 10 VALUE 
            "Û OGRENCININ SINIFI.......:".
           02 LINE 8 COLUMN 10 VALUE 
            "Û ADI SOYADI..............:".
           02 LINE 9 COLUMN 10 VALUE 
            "Û BABA ADI................:".
           02 LINE 10 COLUMN 10 VALUE 
            "Û ANNE ADI................:".
           02 LINE 11 COLUMN 10 VALUE
            "Û DOGUM TARIHI............:".
           02 LINE 12 COLUMN 10 VALUE 
            "Û DOGUM YERI..............:".
           02 LINE 13 COLUMN 10 VALUE 
            "Û CINSIYETI...............:".
           02 LINE 14 COLUMN 10 VALUE
            "Û UYRUGU..................:".
           02 LINE 15 COLUMN 10 VALUE 
            "Û KAN GURUBU..............:".
           02 LINE 16 COLUMN 10 VALUE
            "Û OGRENCI ADRESI..........:".
           02 LINE 17 COLUMN 10 VALUE
            "Û DERSHANE UNVANI.........:".
           02 LINE 18 COLUMN 10 VALUE 
            "Û DERSHANE ADRESI.........:".
           02 LINE 19 COLUMN 10 PIC X(55) FROM ALL "Û".
           02 LINE 7 COLUMN 38 PIC X(10) USING SINIFI.
           02 LINE 8 COLUMN 38 PIC X(20) USING ADI-SOYADI.
           02 LINE 9 COLUMN 38 PIC X(10) USING BABA-ADI.
           02 LINE 10 COLUMN 38 PIC X(10) USING ANNE-ADI.
           02 LINE 11 COLUMN 38 PIC X(10) USING DOGUM-TARIHI.
           02 LINE 12 COLUMN 38 PIC X(12) USING DOGUM-YERI.
           02 LINE 13 COLUMN 38 PIC X(5) USING CINSIYETI.
           02 LINE 14 COLUMN 38 PIC X(8) USING UYRUGU.
           02 LINE 15 COLUMN 38 PIC X(12) USING KAN-GRUBU.
           02 LINE 16 COLUMN 38 PIC X(20) USING OGRENCI-ADRESI.
           02 LINE 17 COLUMN 38 PIC X(12) USING DERSHANE-UNVANI.
           02 LINE 18 COLUMN 38 PIC X(20) USING DERSHANE-ADRESI.
       01 EKRAN-5.
           02 BLANK SCREEN.
           02 LINE 10 COLUMN 10 PIC X(40) FROM ALL "Û".
           02 LINE 12 COLUMN 10 VALUE 
            "Û BOLUMUNU GIRINIZ........:".
           02 LINE 14 COLUMN 10 VALUE 
            "Û MATEMATIK/EDEBIYAT/FEN".
           02 LINE 16 COLUMN 10 PIC X(40) FROM ALL "Û".
           02 LINE 12 COLUMN 43 PIC X(10) USING BOLUM.
       PROCEDURE DIVISION.
       BASLA. DISPLAY EKRAN-1. ACCEPT EKRAN-1 ON ESCAPE GO NIHAL.
           IF SIFRE NOT = "JOKOM A.S." DISPLAY (1 1) ERASE STOP RUN.
       NIHAL. DISPLAY EKRAN-2.
       NNN. ACCEPT EKRAN-2. 
           IF SEC = 99 OPEN OUTPUT OSS1 CLOSE OSS1  
           ELSE IF SEC = 01 PERFORM GIRIS
           ELSE IF SEC = 02 PERFORM DEGISIKLIK
           ELSE IF SEC = 03 PERFORM SILME
           ELSE IF SEC = 04 PERFORM EKRAN
           ELSE IF SEC = 05 PERFORM YAZICI
           ELSE IF SEC = 06 GO SON
           ELSE DISPLAY (22 10) SEC (22 14)
           ". NO`LU SECENEK YANLIS LUTFEN DOGRUSUNU GIRINIZ" GO NNN.
           DISPLAY EKRAN-2. DISPLAY (22 10) SEC (22 14) 
           ". NO`LU ISLEM TAMAMLANMISTIR". GO NNN.
       GIRIS SECTION.
       GGGG. OPEN I-O OSS1.
       G1. MOVE 0 TO OGR-NO. 
           MOVE ALL "." TO ADI-SOYADI BABA-ADI ANNE-ADI DOGUM-TARIHI.
           MOVE ALL "." TO DOGUM-YERI CINSIYETI UYRUGU KAN-GRUBU. 
           MOVE ALL "." TO DOGUM-TARIHI OGRENCI-ADRESI DERSHANE-UNVANI.
           MOVE ALL "." TO DERSHANE-ADRESI SINIFI.           
	       DISPLAY EKRAN-3. 
           DISPLAY (4 10) "VERI GIRISI". 
           DISPLAY (24 1) "ESC TUSU ILE ANA MENUYE DONULUR".
           ACCEPT EKRAN-3 ON ESCAPE GO G-SON.
       AS. READ OSS1 NEXT AT END GO G2.
           DISPLAY (23 1) "BU KAYIT ONCEDEN GIRILMIS".
           DISPLAY (24 1) "BASKA KAYIT ICIN ENT BAS".
           ACCEPT (24 50) CEVAP DISPLAY (23 1) ERASE GO G1.
		   GO AS. 
       G2. DISPLAY EKRAN-4.
           DISPLAY (24 1) "CTRL-B ILE BIR ALAN GERI GIDERSINIZ".
           ACCEPT EKRAN-4 ON ESCAPE GO G-SON.
           DISPLAY (23 1) ERASE.
           DISPLAY (23 1) "VERILER DOGRUMU (E/H):".
           ACCEPT (23 34) CEVAP. 
           IF CEVAP = "H" GO G2.
           WRITE OGR-KAYDI INVALID KEY DISPLAY (23 1) ERASE
            DISPLAY (23 1) "DISKET DOLU VEYA BOZUK ENT BAS" 
            ACCEPT CEVAP GO G-SON. GO G1.   
       G-SON. CLOSE OSS1. 
       DEGISIKLIK SECTION.
       DDDD1. OPEN I-O OSS1.
       DC1. MOVE 0 TO OGR-NO. DISPLAY EKRAN-3.
           DISPLAY (4 10) "BILGILERDE DEGISIKLIK".
           DISPLAY (23 1)
           "DEGISIKLIK YAPACAGINIZ KAYDIN FIS'NOSUNU GIRINIZ".
           DISPLAY (24 1) "ESC TUSU ILE ANA MENUYE DONERSINIZ".
           ACCEPT EKRAN-3 ON ESCAPE GO D-SON.
           READ OSS1 INVALID KEY DISPLAY (23 1) ERASE DISPLAY (23 1)
           "BU OGRENCI KAYDI YOK {ENT BAS}:" ACCEPT CEVAP GO DC1.
           DISPLAY EKRAN-4. 
           DISPLAY (24 1) "CTRL-B ILE BIR ALAN GERI GIDILIR". 		   
           ACCEPT EKRAN-4 ON ESCAPE GO D-SON.
           DISPLAY (23 1) ERASE. 
           DISPLAY (23 1) 
           "YENI KAYDI DOSYAYA YAZMAK ISTIYORMUSUNUZ (E/H):".
           ACCEPT (23 40) CEVAP. IF CEVAP = "H" GO DC1.
           REWRITE OGR-KAYDI INVALID KEY DISPLAY (23 1) ERASE DISPLAY 
           (23 1) 
           "KAYDI DOSYAYA YAZAMIYORUM DISKET DOLU/BOZUK {ENT BAS:}" 
           ACCEPT CEVAP GO D-SON.
           GO DC1.
       D-SON. CLOSE OSS1.
       SILME SECTION.
       CCCC. OPEN I-O OSS1.
       C1. MOVE 0 TO OGR-NO. DISPLAY EKRAN-3.
           DISPLAY (4 10) "ISTENILEN BIR KAYDIN SILINMESI".
           DISPLAY (23 1) ERASE.
           DISPLAY (23 1) "SILINECEK KAYDIN FIS'NOSUNU GIRINIZ".
           DISPLAY (24 1) "ESC TUSU ILE ANA MENUYE DONERSINIZ".
           ACCEPT EKRAN-3 ON ESCAPE GO C-SON.
           READ OSS1 INVALID KEY DISPLAY (23 1) ERASE DISPLAY (23 1)
           "BU NOLU KAYIT DOSYADA YOK {ENT BAS:}" ACCEPT CEVAP GO C1.
           DISPLAY EKRAN-4.
           DISPLAY (23 1) ERASE.  DISPLAY (23 1)
           "BU KAYDI SILMEK ISTIYORMUSUNUZ (E/H):". 
           ACCEPT (23 40) CEVAP. 
           IF CEVAP = "H" GO C1.
           DELETE OSS1 RECORD INVALID KEY 
           DISPLAY (23 1) ERASE DISPLAY (23 1) 
           "KAYDI SILEMIYORUM DISKET BOZUK {ANA MENU ICIN ENT BAS}:" 
           ACCEPT CEVAP GO C-SON. 
           GO C1. 
       C-SON. CLOSE OSS1.
       EKRAN SECTION.
       MMM. OPEN I-O OSS1. 
       MMM1. MOVE 0 TO OGR-NO SNO.
       MMM2. MOVE ALL "." TO BOLUM. DISPLAY EKRAN-5.
	       DISPLAY (8 10) "EKRAN DOKUMU". 
           DISPLAY (24 10) "ESC TUSU ILE ANA MENUYE DONERSINIZ".
           ACCEPT EKRAN-5 ON ESCAPE GO MMM-SON. 
           DISPLAY (22 10) "VERILER DOGRU MU ? [E/H]:". 
           ACCEPT (22 35) CEVAP IF CEVAP = "H" GO MMM1. 
           MOVE BOLUM TO SINIFI.  
	       START OSS1 KEY NOT LESS THAN OGR INVALID KEY 
           DISPLAY (23 10) ERASE DISPLAY (23 10) 
           "DOSYAYA START YAPILAMIYOR" ACCEPT CEVAP GO MMM-SON. 
       MMM3. MOVE 0 TO SIRA. GO MM2.
       MMM4. IF SIRA = 0 PERFORM MMM-BASLIK. ADD 1 TO SIRA. 
           ADD 1 TO LIN.
           MOVE OGR-NO TO O-NO.
           MOVE ADI-SOYADI TO AD-SOYAD. 
           MOVE BABA-ADI TO B-ADI. 
           MOVE DOGUM-TARIHI TO D-TARIHI. 
           MOVE DOGUM-YERI TO D-YERI.
		   MOVE CINSIYETI TO CINS.
           DISPLAY (LIN + 4 1) DETAY. 
       MM2. READ OSS1 NEXT AT END PERFORM MMM-SONUC GO MMM-SON.
           IF BOLUM = SINIFI 
           GO MMM5 ELSE GO MM2.
       MMM5. IF LIN > 15 PERFORM MMM-SONUC DISPLAY (24 10) 
            "DOKUME DEVAM ETMEK ISTIYORMUSUNUZ {E/H}:" 
            ACCEPT (24 40) CEVAP IF CEVAP = "H" GO MMM-SON ELSE 
           PERFORM MMM-BASLIK.
           GO MMM4.
       MMM-BASLIK. ADD 1 TO SNO. MOVE SNO TO SSNO. MOVE 0 TO LIN. 
           MOVE SINIFI TO SINIF. 
           DISPLAY (1 1) ERASE. 
           DISPLAY (1 1) BAS1.
           DISPLAY (2 1) BAS2.
           DISPLAY (3 1) BAS3.
           DISPLAY (4 1) CIZGI.
       MMM-SONUC.
           DISPLAY (LIN + 6 1) CIZGI.
       MMM-SON. DISPLAY (23 1) ERASE. DISPLAY (24 10) 
            "ANA MENU ICIN [ENT BAS]:". ACCEPT CEVAP. 
		   CLOSE OSS1.      
       SON SECTION.
       WWW. DISPLAY (1 1) ERASE. STOP RUN.
