       IDENTIFICATION DIVISION.
       PROGRAM-ID. YAR2.
       AUTHOR. NIHAL SAMARAZ.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OSS ASSIGN TO DISK ORGANIZATION INDEXED
           ACCESS DYNAMIC RECORD KEY PUAN-NO.
           SELECT KATSAYI ASSIGN TO DISK ORGANIZATION INDEXED
           ACCESS DYNAMIC RECORD KEY KAT.
       DATA DIVISION.
       FILE SECTION.
       FD OSS LABEL RECORDS STANDARD VALUE OF FILE-ID "B:OSS.DOS".
       01 OSS-KAYDI.
           05 PUAN-NO.
            10 OSS-PUANI PIC 9(5).
            10 NUMARASI PIC 9(6).
            10 OGR-NO PIC 9(6).
           05 AD-SOYAD PIC X(20).
           05 SINIF.
            10 SINIF-ISMI PIC X(10).
            10 SINIF-KODU PIC 9(4).
           05 SAYISAL-HP PIC 9(2)V99.
           05 SOZEL-HP PIC 9(2)V99.
           05 SAYISAL-DOGRU PIC 9(4).
           05 SAYISAL-YANLIS PIC 9(4).
           05 SOZEL-DOGRU PIC 9(4).
           05 SOZEL-YANLIS PIC 9(4).
       FD KATSAYI LABEL RECORDS STANDARD VALUE OF FILE-ID "B:KTS.KYD".
       01 KATSAYI-BILGISI.
           10 KAT PIC 9(5).
           10 SAYISAL-KATSAYI PIC X(7).
           10 SOZEL-KATSAYI PIC X(7).
           10 TBK PIC X(7).
       WORKING-STORAGE SECTION.
       77 CEVAP PIC X VALUE SPACES.
       77 SEC PIC 99 VALUE ZEROS.
       77 SYP PIC 9(3)V99.
       77 SZP PIC 9(3)V99.
       77 DERSHANE PIC X(12) VALUE ALL ".".
       77 DD PIC X VALUE SPACE.
       77 SINIF-KONUM PIC 99.
       77 GENEL-KONUM PIC 9(4).
       77 BOLUM PIC X(10).
       77 SINIF-ADI PIC X(10).
       77 HAS PIC 99.
       77 S-NO PIC 9(4) VALUE 0.
       77 SIRA PIC 9(4) VALUE 0.
       77 B-OGR-NO PIC 9(6).
       77 S-OGR-NO PIC 9(6).
       77 I PIC 99.
       01 BASLIK-1.
           05 FILLER PIC X(2) VALUE SPACES.
           05 FILLER PIC X(52) VALUE 
            "SAMARAZ DERSHANESI O.S.S. DENEME SINAVI SONUCLARI".
           05 FILLER PIC X(10) VALUE "SAYFA NO".
           05 SAYFA-NO PIC 99.
       01 BASLIK-2.
           05 FILLER PIC X(3) VALUE SPACES.
           05 FILLER PIC X(74) VALUE ALL "Û".
       01 BASLIK-3.
           05 FILLER PIC X(3) VALUE SPACES.
           05 FILLER PIC X(8) VALUE "GENEL".
           05 FILLER PIC X(21) VALUE "OGRENCININ".
           05 FILLER PIC X(10) VALUE "SINIF".
           05 FILLER PIC X(9) VALUE "OGRENCI".
           05 FILLER PIC X(9) VALUE "SOZEL".
           05 FILLER PIC X(10) VALUE "SAYISAL".
           05 FILLER PIC X(7) VALUE "OSS".
       01 BASLIK-4.
           05 FILLER PIC X(2) VALUE SPACES.
           05 FILLER PIC X(8) VALUE "KONUM".
           05 FILLER PIC X(21) VALUE "ADI SOYADI".
           05 FILLER PIC X(10) VALUE "BOLUM".
           05 FILLER PIC X(9) VALUE "NO".
           05 FILLER PIC X(9) VALUE "D/Y".
           05 FILLER PIC X(9) VALUE "D/Y".
           05 FILLER PIC X(7) VALUE "PUANI".
       01 BASLIK-5.
           05 FILLER PIC X(5) VALUE SPACES.
           05 SIRA-1 PIC ZZZ9B.
           05 ISIM-1 PIC X(20).
           05 SINIF-ADI-1 PIC X(10).
           05 OGR-NO-1 PIC 9(5).
           05 SINIF-SIRA-1 PIC Z9B(4).
           05 SZD-1 PIC Z9B.
           05 SZY-1 PIC Z9BB.
           05 SYD-1 PIC  Z9B.
           05 SYY-1 PIC Z9BB.
           05 PUAN-1 PIC 9(5).
       01 BASLIK-6.
           05 FILLER PIC X(18) VALUE SPACES.
           05 DERSHANE-ADI-2 PIC X(12).
           05 FILLER PIC X(10) VALUE "DERSHANESI".
           05 SINIF-ISMI-2 PIC X(10)B.
           05 FILLER PIC X(6) VALUE "SINIFI".
       01 BASLIK-7.
           05 FILLER PIC X(18) VALUE SPACES.
           05 FILLER PIC X(43) VALUE 
            "O.S.S. DENEME SINAV SONUCLARI LISTESI".
       01 BASLIK-8.
           05 FILLER PIC X(18) VALUE SPACES.
           05 FILLER PIC X(43) VALUE ALL "é".
       01 BASLIK-9.
           05 FILLER PIC X(3) VALUE SPACES.
           05 FILLER PIC X(6) VALUE "SINIFI".
           05 FILLER PIC X(23) VALUE "OGRENCININ".
           05 FILLER PIC X(7) VALUE "OGRENCI".
           05 FILLER PIC X(5) VALUE "GENEL".
           05 FILLER PIC X(5) VALUE "SOZEL".
           05 FILLER PIC X(7) VALUE "SAYISAL".
           05 FILLER PIC X(6) VALUE "O.S.S.".
       01 BASLIK-10.
           05 FILLER PIC X(5) VALUE SPACES.
           05 FILLER PIC X(5) VALUE "BOLUM".
           05 FILLER PIC X(10) VALUE "ADI SOYADI".
           05 FILLER PIC X(2) VALUE "NO".
           05 FILLER PIC X(5) VALUE "KONUM".
           05 FILLER PIC X(3) VALUE "D Y".
           05 FILLER PIC X(3) VALUE "D Y".
           05 FILLER PIC X(5) VALUE "PUANI".
       01 BASLIK-11.
           05 FILLER PIC X(5) VALUE SPACES.
           05 SINIF-2 PIC Z9(5).
           05 ISIM-2 PIC X(20).
           05 OGR-NO-2 PIC 9(5).
           05 SIRA-2 PIC ZZZ9BBB.
           05 SZD-2 PIC 9(4).
           05 SZY-2 PIC 9(4).
           05 SYD-2 PIC 9(4).
           05 SYY-2 PIC 9(4).
		   05 PUAN-2 PIC 9(5).
	   01 DETAY.
           05 FILLER PIC XXX VALUE SPACES.
           05 OGR-NO-1 PIC 9(6)B.
           05 ISIM-1 PIC X(20)B.
           05 SINIF-1 PIC X(10)B.
           05 SZD-1 PIC 9(4)B.
           05 SZY-1 PIC 9(4)B.
           05 SYD-1 PIC 9(4)B.
           05 SYY-1 PIC 9(4)B.
           05 PUANI-1 PIC 9(5)B.
           05 DURUM PIC X(10)B.
       01 TBL.
           05 SAYAR OCCURS 20 TIMES PIC 99.
	   SCREEN SECTION.
       01 EKRAN-1.
           05 BLANK SCREEN.
           05 LINE 6 COLUMN 15 PIC X(55) FROM ALL "Û".
           05 LINE 8 COLUMN 15 VALUE 
            "Û SAMARAZ O.S.S. HAZIRLIK EGITIM MERKEZI Û".
           05 LINE 10 COLUMN 15 VALUE
            "Û O.S.S. PROGRAMI                        Û".
           05 LINE 11 COLUMN 15 VALUE 
            "Û DERSHANE ISMINI GIRINIZ                Û".
           05 LINE 13 COLUMN 21 PIC X(12) USING DERSHANE.
           05 LINE 13 COLUMN 15 VALUE
            "Û ¥¥¥              ¥¥¥                   Û".
           05 LINE 16 COLUMN 15 PIC X(55) FROM ALL "Û".
       01 EKRAN-2.
           05 BLANK SCREEN.
           05 LINE 1 COLUMN 1 BLINK VALUE "SAMARAZ A.S.".
           05 LINE 2 COLUMN 1 REVERSE-VIDEO VALUE
            "A N A  M E N U ".
           05 LINE 3 COLUMN 1 PIC X(15) FROM ALL "Û".
           05 LINE 6 COLUMN 10 REVERSE-VIDEO VALUE 
            "Û [O.S.S.] OGRENCI SECME PROGRAMI              Û".
           05 LINE 7 COLUMN 10 PIC X(59) FROM ALL "Û".
           05 LINE 9 COLUMN 10 REVERSE-VIDEO VALUE
            "Û [1]: OGRENCI SINAV BILGILERI GIRISI          Û".
           05 LINE 10 COLUMN 10 REVERSE-VIDEO VALUE
            "Û [2]: ISTENILEN HERHANGI BIR KAYDIN SILINMESI Û".
           05 LINE 11 COLUMN 10 REVERSE-VIDEO VALUE 
            "Û [3]: SINIF LISTESI DOKUMU ## EKRANDAN ##     Û".
           05 LINE 12 COLUMN 10 REVERSE-VIDEO VALUE 
            "Û [4]: GENEL LISTE DOKUMU #### EKRANDAN ##     Û".
           05 LINE 14 COLUMN 10 REVERSE-VIDEO VALUE 
            "Û [5]: ANA PROGRAMA DONUS                      Û".
           05 LINE 16 COLUMN 10 PIC X(59) FROM ALL "Û".
           05 LINE 18 COLUMN 15 REVERSE-VIDEO VALUE
             "## SECIMINIZ ##:".
           05 LINE 18 COLUMN 33 PIC 99 USING SEC.
       01 EKRAN-3. 
	       05 LINE 19 COLUMN 10 PIC X(39) FROM ALL "Û".
           05 LINE 20 COLUMN 10 PIC 99 USING SEC.
           05 LINE 20 COLUMN 12 VALUE 
            "Û . NO`LU ISLEM TAMAMLANMISTIR".
	       05 LINE 21 COLUMN 10 PIC X(39) FROM ALL "Û".		
       01 EKRAN-4.
           05 LINE 22 COLUMN 10 PIC X(62) FROM ALL "Û".
           05 LINE 23 COLUMN 10 PIC 99 USING SEC.
           05 LINE 23 COLUMN 12 BLINK VALUE 
            "Û . NO`LU SECENEK YANLIS LUTFEN DOGRUSUNU GIRINIZ Û".
           05 LINE 24 COLUMN 10 PIC X(62) FROM ALL "Û".
       01 EKRAN-5.
           05 BLANK SCREEN.
           05 LINE 1 COLUMN 1 HIGHLIGHT VALUE 
		    "Û O.S.S. DENEME SINAVI Û".
           05 LINE 2 COLUMN 1 PIC X(24) FROM ALL "Õ".
           05 LINE 5 COLUMN 10 PIC X(40) FROM ALL "Û".
           05 LINE 7 COLUMN 10 VALUE 
		    "Û OGRENCI NUMARASI.........:".
           05 LINE 8 COLUMN 10 VALUE 
            "Û ADI SOYADI...............:".
           05 LINE 9 COLUMN 10 VALUE
            "Û OGRENCININ BOLUMU........:".
           05 LINE 10 COLUMN 10 VALUE
            "Û SINIF KODU...............:".
           05 LINE 11 COLUMN 10 VALUE
            "Û SAYISAL DOGRU............:".
           05 LINE 12 COLUMN 10 VALUE 
            "Û SAYISAL YANLIS...........:".
           05 LINE 13 COLUMN 10 VALUE
            "Û SOZEL DOGRU..............:".
           05 LINE 14 COLUMN 10 VALUE
            "Û SOZEL YANLIS............:".
           05 LINE 17 COLUMN 10 PIC X(40) FROM ALL "Û".
           05 LINE 7 COLUMN 38 PIC 9(6) USING OGR-NO.
           05 LINE 8 COLUMN 38 PIC X(20) USING AD-SOYAD.
           05 LINE 9 COLUMN 38 PIC X(10) USING SINIF-ISMI.
           05 LINE 10 COLUMN 38 PIC 9(4) USING SINIF-KODU.
           05 LINE 11 COLUMN 38 PIC 9(4) USING SAYISAL-DOGRU.
           05 LINE 12 COLUMN 38 PIC 9(4) USING SAYISAL-YANLIS.
           05 LINE 13 COLUMN 38 PIC 9(4) USING SOZEL-DOGRU.
           05 LINE 14 COLUMN 38 PIC 9(4) USING SOZEL-YANLIS.
       01 EKRAN-6.
           05 BLANK SCREEN.
           05 LINE 1 COLUMN 1 BLINK VALUE "SAMARAZ A.S.".
           05 LINE 2 COLUMN 1 REVERSE-VIDEO VALUE "DENEME SINAVI".             
           05 LINE 3 COLUMN 1 PIC X(13) FROM ALL "@".
           05 LINE 10 COLUMN 10 PIC X(45) FROM ALL "Û".
           05 LINE 12 COLUMN 10 VALUE
            "Û OGRENCI NUMARASI..........:".
           05 LINE 12 COLUMN 40 PIC 9(6) USING OGR-NO.
           05 LINE 14 COLUMN 10 PIC X(45) FROM ALL "Û".
       PROCEDURE DIVISION.
       BASLA. DISPLAY EKRAN-1. ACCEPT EKRAN-1.
           IF DERSHANE NOT = "SAMARAZ A.S." GO OSS-SON.
           DISPLAY EKRAN-2.
       FF0. ACCEPT EKRAN-2.
           IF SEC = 99 OPEN OUTPUT OSS CLOSE OSS
		   ELSE IF SEC = 88 PERFORM KATSAYI-GIRISI
           ELSE IF SEC = 1 PERFORM VERI-GIRIS
           ELSE IF SEC = 2 PERFORM SILME
           ELSE IF SEC = 3 PERFORM SINAV-EKRAN
           ELSE IF SEC = 4 PERFORM GENEL-EKRAN
           ELSE IF SEC = 5 GO OSS-SON
           ELSE DISPLAY EKRAN-4 GO FF0.
           DISPLAY EKRAN-2 EKRAN-3. GO FF0.
       KATSAYI-GIRISI SECTION.
       FF1. OPEN OUTPUT KATSAYI.
           DISPLAY (1 1) ERASE. DISPLAY (5 5) "SAYISAL KATSAYI...:".
           DISPLAY (7 5) "SOZEL KATSAYI....:".
           DISPLAY (9 5) "TABAN KATSAYI....:".
       FF2. ACCEPT (5 24) SAYISAL-KATSAYI WITH PROMPT UPDATE.
           ACCEPT (7 24) SOZEL-KATSAYI WITH PROMPT UPDATE.
           ACCEPT (9 24) TBK WITH PROMPT UPDATE.
           DISPLAY (15 10) "VERILER DOGRU MU [E/H] :".
           ACCEPT (15 34) CEVAP WITH PROMPT AUTO-SKIP.
           IF CEVAP = "H" GO FF2.
           WRITE KATSAYI-BILGISI CLOSE KATSAYI.
       VERI-GIRIS SECTION.
       FFF. OPEN I-O KATSAYI OSS. 
       FFF1. DISPLAY (1 1) ERASE.
           MOVE ALL "." TO AD-SOYAD SINIF-ISMI.
       FFF2. MOVE 0 TO SAYISAL-DOGRU SAYISAL-YANLIS OGR-NO. 
           MOVE 0 TO SOZEL-DOGRU SOZEL-YANLIS SINIF-KODU.
           DISPLAY EKRAN-6. DISPLAY (4 10) 
            "OGRENCI SINAV BILGILERI GIRISI". 
           DISPLAY (24 10) "[ESC] ILE ANA MENUYE DONERSINIZ".
           ACCEPT EKRAN-6 ON ESCAPE GO VERI-GIRIS-SON.
           READ OSS INVALID KEY GO FFF3.
           DISPLAY (23 10) "BU KAYIT ONCEDEN GIRILMIS".
           DISPLAY (24 10) "BASKA BIR KAYIT ICIN [ENT] BASINIZ".
           ACCEPT CEVAP DISPLAY (23 10) ERASE GO FFF1.
       FFF3. DISPLAY EKRAN-5.
           DISPLAY (23 10) 
            "CTRL-B ILE BIR ALAN GERI GIDERSINIZ".
           ACCEPT EKRAN-5 ON ESCAPE GO VERI-GIRIS-SON.
           DISPLAY (22 1) ERASE (22 5)
            "VERILER DOGRU MU ? [E/H]:" ACCEPT (22 30) CEVAP.
		   IF CEVAP = "H" GO FFF3.
           WRITE OSS-KAYDI INVALID KEY DISPLAY (23 10) ERASE (23 10)
            "DISKET DOLU VEYA BOZUK [ENT] BASINIZ" 
           ACCEPT CEVAP GO VERI-GIRIS-SON. GO FFF1.
	   VERI-GIRIS-SON. CLOSE OSS.   
       SILME SECTION.
       FF9. OPEN I-O OSS.
       FF10. MOVE ALL "." TO AD-SOYAD SINIF-ISMI.
           MOVE ALL ZEROS TO PUAN-NO SINIF-KODU SAYISAL-DOGRU 
           SAYISAL-YANLIS SOZEL-DOGRU SOZEL-YANLIS NUMARASI.
           DISPLAY EKRAN-5. DISPLAY (4 10)
            "ISTENILEN BIR KAYDIN SILINMESI".
           DISPLAY EKRAN-6.
           ACCEPT (24 43) CEVAP WITH PROMPT UPDATE.
           READ OSS INVALID KEY DISPLAY (24 1)
           "BU KAYIT DOSYADA MEVCUT DEGIL [ENT] BASINIZ".
           ACCEPT (24 42) CEVAP GO FF10.
           DISPLAY EKRAN-5. DISPLAY (24 1)
           "BU KAYDI SILMEK ISTEDIGINIZDEN EMINMISINIZ [E/H]:".
           ACCEPT (24 52) CEVAP WITH PROMPT.
           IF CEVAP = "H" GO FF10.
           DELETE OSS INVALID KEY DISPLAY (22 1)
            "Û Û SILEMIYORUM Û DISKET BOZUK Û [ENT] BASINIZ Û Û:"
           ACCEPT (22 42) CEVAP GO SILME-SON.
           GO FF10.
       SILME-SON. CLOSE OSS.
       SINAV-EKRAN SECTION.
       SSS. MOVE 0 TO LIN.
       SSS1. DISPLAY (1 1) ERASE.
           MOVE ALL "." TO B-OGR-NO S-OGR-NO.
           DISPLAY (2 1) "SAMARAZ A.S.".
           DISPLAY (8 10) " @@ SINAV SONUC @@ EKRANDAN @@".
           DISPLAY (10 10) "@@@@@@@@@@@@@@@@@@@@@@@@@@@@@".
           DISPLAY (12 10) "@ BASLANGIC OGR NO :".
           DISPLAY (14 10) "@ SON OGR          :".
           DISPLAY (16 10) "@@@@@@@@@@@@@@@@@@@@@@@@@@@@@".
           DISPLAY (22 10) 
            "BAS OGR-NO = 000000 VE SON OGR-NO = 999999".
           DISPLAY (23 10) "GIRERSENIZ HEPSINI DOKERSINIZ".
       SSS2. ACCEPT (12 30) B-OGR-NO WITH PROMPT UPDATE.
           ACCEPT (14 30) S-OGR-NO WITH PROMPT UPDATE.
		   DISPLAY (24 10) "VERILER DOGRU MU ? [E/H]:".
		   ACCEPT (24 36) CEVAP WITH PROMPT.
		   IF CEVAP = "H" DISPLAY (24 1) ERASE GO SSS2.
           OPEN INPUT OSS.
           MOVE ZEROS TO S-NO SIRA .
           START OSS KEY NOT LESS PUAN-NO INVALID KEY DISPLAY (24 10)
           "DOSYADA START YAPILAMIYOR [ENT] BASINIZ".
           ACCEPT (24 65) CEVAP. GO SINAV-EKRAN-SON.
           READ OSS NEXT AT END GO SINAV-EKRAN-SON.
           IF OGR-NO > S-OGR-NO GO SINAV-EKRAN-SON.
           PERFORM EKRAN-BASLIKLAR.
       SSS3. ADD 1 TO SIRA. ADD 1 TO LIN.
           COMPUTE SAYISAL-HP = SAYISAL-DOGRU - (SAYISAL-YANLIS / 4).
           COMPUTE SOZEL-HP = SOZEL-DOGRU - (SOZEL-YANLIS / 4).
           COMPUTE SYP = (SAYISAL-HP * .97276).
           COMPUTE SZP = (SOZEL-HP * .89281).
           COMPUTE OSS-PUANI = SYP + SZP.
           IF OSS-PUANI < TBK MOVE TBK TO OSS-PUANI.
           SUBTRACT OSS-PUANI FROM 300 GIVING OSS-PUANI.
           IF OSS-PUANI < 104.99
           MOVE "KAZANAMADI" TO DURUM
           ELSE IF OSS-PUANI > 105.00
           MOVE "KAZANDI" TO DURUM.
           DISPLAY (LIN + 4 1) DETAY.
           READ OSS NEXT AT END PERFORM EKRAN-SONUC.
           GO SINAV-EKRAN-SON.       
           IF OGR-NO > S-OGR-NO PERFORM EKRAN-SONUC.
           GO SINAV-EKRAN-SON.
           IF LIN < 15 GO SSS3.
           PERFORM EKRAN-SONUC. DISPLAY (24 10)
            "EKRAN DOKUMUNE DEVAM ETMEK ISTIYORMUSUNUZ [E/]:".
           ACCEPT (24 57) CEVAP WITH PROMPT UPDATE.
           IF CEVAP = "H" GO OSS-SON ELSE PERFORM EKRAN-BASLIKLAR.
           GO SSS3.
       EKRAN-BASLIKLAR.
           DISPLAY (1 1) ERASE. DISPLAY (1 1) BASLIK-8.
           DISPLAY (2 1) BASLIK-6. DISPLAY (3 1) BASLIK-7.
           DISPLAY (4 1) BASLIK-8. DISPLAY (5 1) BASLIK-9.
           DISPLAY (6 1) BASLIK-10. DISPLAY (7 1) BASLIK-2.
           MOVE 7 TO LIN.
       EKRAN-SONUC.
           IF SINIF-ISMI NOT = SINIF-ADI GO FF6.
           ADD 1 TO SINIF-KONUM.
           MOVE AD-SOYAD TO ISIM-2.
           MOVE NUMARASI TO OGR-NO-2.
           MOVE GENEL-KONUM TO SIRA-2.
           MOVE SOZEL-DOGRU TO SZD-2.
           MOVE SOZEL-YANLIS TO SZY-2.
           MOVE SAYISAL-DOGRU TO SYD-2.
           MOVE SAYISAL-YANLIS TO SYY-2.
           SUBTRACT OSS-PUANI FROM 300 GIVING PUAN-2.
           DISPLAY (LIN + 1 1) BASLIK-11. ADD 1 TO LIN.
           IF LIN < 22 GO FF6.
           DISPLAY (23 1) BASLIK-2. DISPLAY (24 1)
            "BIR SONRAKI SAYFANIN DOKUMUNU ISTIYORMUSUNUZ [E/H]:". 
           ACCEPT (24 52) CEVAP WITH PROMPT UPDATE.
           IF CEVAP = "H" MOVE "E" TO DD GO SINAV-EKRAN-SON.
           PERFORM EKRAN-BASLIKLAR.
       FF6. READ OSS NEXT AT END MOVE "E" TO DD.
           ADD 1 TO GENEL-KONUM.
       SINAV-EKRAN-SON.
           DISPLAY (24 10) "ANA MENUYE DONMEK ICIN [ENT] BASINIZ:".
           ACCEPT (24 48) CEVAP WITH PROMPT. CLOSE OSS.
       F-SON. CLOSE OSS.
           IF CEVAP = "E" DISPLAY (LIN + 2 1) BASLIK-2.
           DISPLAY (24 1) "ANA MENUYE DONMEK ICIN [ENT] BASINIZ"
           ACCEPT (24 36) CEVAP.
           DISPLAY (24 1) "ANA MENUYE DONMEK ICIN [ENT] BASINIZ".
           ACCEPT (24 36) CEVAP.
       OSS-SON.
       FF12. EXIT PROGRAM.
