      * BU PROGRAM ZEYTIN ALIM ISLEMLERINDEN SADECE GIRISINI YAPAN VE
      * GIRILEN TARIH,DONEM VE KALITEYE GORE GUNLUK ALIMLARIN TOPLAMINI
      * DOKEN BIR PROGRAMDIR.     
       IDENTIFICATION  DIVISION.
       PROGRAM-ID. P1.
	   AUTHOR. MEHMET HARAS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BRD ASSIGN TO DISK ORGANIZATION INDEXED
           ACCESS DYNAMIC RECORD KEY KOD.
           SELECT YAZICI ASSIGN TO PRINTER.
       DATA DIVISION.
       FILE SECTION.
       FD BRD LABEL RECORD STANDARD VALUE OF FILE-ID "BRD.DAT".
       01 BRD-KAYDI.
           02 KOD.
              03 FISNO PIC 9(6).
              03 KALITE PIC X(6).
              03 DONEM PIC X(5).  
              03 TARIH PIC X(10).
           02 UYENO PIC 9(4).
           02 AD-SOYAD PIC X(20).
           02 TANE PIC 9(4).
           02 BAREM-FIATI PIC 9(6).
           02 MIKTARI PIC 9(4).
           02 STNO PIC 9(3).
       FD YAZICI LABEL RECORD OMITTED.
       01 SATIR PIC X(80).
       WORKING-STORAGE SECTION.
       77 BOSLUK PIC X(80) VALUE SPACES.
       77 SSNO PIC 9(6) VALUE 0.
       77 CEVAP PIC X VALUE SPACES.
       77 C PIC 99 VALUE 0.
       77 S PIC 99 VALUE 0.
       77 D1 PIC X(5) VALUE SPACES.
       77 K1 PIC X(6) VALUE SPACES.
       77 NZ PIC 99 VALUE 0.
       77 T1 PIC X(10) VALUE SPACES.  
       77 SIFRE PIC X(10) VALUE SPACES.
       77 TUTAR PIC 9(8) VALUE 0.
       77 SIRA PIC 99 VALUE 0.
       77 GGY1 PIC 9(8) VALUE 0.
       77 GGY2 PIC 9(11) VALUE 0.
       77 GGNY1 PIC 9(8) VALUE 0.
       77 GGNY2 PIC 9(11) VALUE 0.
       77 BBEY1 PIC 9(8) VALUE 0.
       77 BBEY2 PIC 9(11) VALUE 0.
       77 TPTUT PIC 9(11) VALUE 0.
       77 TPMIK PIC 9(8) VALUE 0.
       77 CIZGI PIC X(80) VALUE ALL "~".
       01 BAS1.
           02 F PIC X(22) VALUE "775 SAYILI".
           02 F PIC X(25) VALUE "ORTAKLARIN TESLIM ETTIGI".
           02 DONEM-1 PIC X(5).
           02 F PIC XX VALUE SPACES.
           02 F PIC X(23) VALUE "YILI KAPLIK ZEYTINE AIT".
       01 BAS3.
           02 F PIC X(30) VALUE "EDINCIK ZEYTIN T. SATIS".
           02 F PIC X(34) VALUE "GUNLUK TESLIM BORDRASI".
           02 F PIC XXX VALUE "NO:".
           02 SNO PIC ZZZZZ9.
       01 BAS4.
           02 F PIC X(10) VALUE SPACES.
           02 F PIC X(20) VALUE "KOOPERATIFI".
           02 F PIC X(7) VALUE "TARIH :".
           02 TARIH-1 PIC X(10)BB.                      
           02 F PIC X(9) VALUE "KALITESI:".
           02 KALITE-1 PIC X(6).
       01 BAS5.
           02 F PIC XX VALUE SPACES.
           02 F PIC X(12) VALUE "TARIH".
           02 F PIC X(7) VALUE "NOSU".
           02 F PIC X(5) VALUE "UYE".
           02 F PIC X(21) VALUE "ADI SOYADI".
           02 F PIC X(6) VALUE "DANE".
           02 F PIC X(6) VALUE "BAREM".
           02 F PIC X(8) VALUE "MIKTARI".
           02 F PIC X(8) VALUE "TUTARI".
       01 BAS6.
           02 F PIC X(21) VALUE SPACES.
           02 F PIC X(26) VALUE "NO".
           02 F PIC X(6) VALUE "ADEDI".
           02 F PIC X(5) VALUE "FIATI".
       01 DETAY.
           02 F PIC XX VALUE SPACES.
           02 TTARIH-1 PIC X(10)BB.
           02 FNO PIC ZZZZZ9B.
           02 UNO PIC 9(4)B.
           02 AD-S PIC X(20)B.
           02 DANE PIC ZZZ9B.
           02 BAREM PIC ZZ,ZZ9BB.
           02 MIK PIC Z,ZZ9BBB.
           02 TUT PIC ZZ,ZZZ,ZZ9.
           02 F PIC XX VALUE ".-".
       01 BAS7.
           02 F PIC X(39) VALUE SPACES.
           02 F PIC X(13) VALUE "GUNLUK YEKUN:".
           02 GY1 PIC ZZ,ZZZ,ZZ9BB.
           02 GY2 PIC ZZ,ZZZ,ZZZ,ZZ9.
           02 F PIC XX VALUE ".-".
       01 BAS8.
           02 F PIC X(34) VALUE SPACES.
           02 F PIC X(18) VALUE "BIR EVVELKI YEKUN:".
           02 BEY1 PIC ZZ,ZZZ,ZZ9BB.
           02 BEY2 PIC ZZ,ZZZ,ZZZ,ZZ9.
           02 F PIC XX VALUE ".-".
       01 BAS9.
           02 F PIC X(40) VALUE SPACES.
           02 F PIC X(12) VALUE "GENEL YEKUN:".
           02 GNY1 PIC ZZ,ZZZ,ZZ9BB.
           02 GNY2 PIC ZZ,ZZZ,ZZZ,ZZ9.
           02 F PIC XX VALUE ".-".
       SCREEN SECTION.   
       01 EK1.
           02 BLANK SCREEN.
           02 LINE 1 COLUMN 1 VALUE "MARMARA BIRLIK".
           02 LINE 2 COLUMN 1 VALUE "ANA MENU".
           02 LINE 3 COLUMN 1 PIC X(10) FROM ALL "~".
           02 LINE 5 COLUMN 10 PIC X(40) FROM ALL "~".
           02 LINE 6 COLUMN 10 VALUE "11:VERI GIRISI".
           02 LINE 7 COLUMN 10 VALUE "22:DEGISIKLIK".
           02 LINE 8 COLUMN 10 VALUE "33:SILME".
           02 LINE 9 COLUMN 10 VALUE "44:EKRAN DOKUMU".
           02 LINE 10 COLUMN 10 VALUE "55:YAZICI DOKUMU".
           02 LINE 11 COLUMN 10 VALUE "66:CIKIS".
           02 LINE 12 COLUMN 10 PIC X(40) FROM ALL "~".
           02 LINE 14 COLUMN 10 VALUE 
               "*** S E C I M I N I Z  [    ] ***".  
           02 LINE 14 COLUMN 35 PIC 99 USING S.
       01 EK2.
           02 BLANK SCREEN.
           02 LINE 3 COLUMN 10 VALUE "FIS NO :".
           02 LINE 3 COLUMN 30 PIC 9(6) USING FISNO.
       01 EK3.
           02 LINE 1 COLUMN 1 VALUE "MARMARA BIRLIK".
           02 LINE 4 COLUMN 10 PIC X(40) FROM ALL "~".
           02 LINE 5 COLUMN 10 VALUE "KALITESI      :".
           02 LINE 6 COLUMN 10 VALUE "DONEM         :".
           02 LINE 7 COLUMN 10 VALUE "TARIH         :".
           02 LINE 8 COLUMN 10 VALUE "UYE NO        :".
           02 LINE 9 COLUMN 10 VALUE "ADI SOYADI    :". 
           02 LINE 10 COLUMN 10 VALUE "TANE ADEDI    :".
           02 LINE 11 COLUMN 10 VALUE "BAREM FIATI   :".
           02 LINE 12 COLUMN 10 VALUE "MIKTARI (Kg)  :".
           02 LINE 13 COLUMN 10 VALUE "STARNA NO     :".
           02 LINE 14 COLUMN 10 PIC X(40) FROM ALL "~".
           02 LINE 5 COLUMN 30 PIC X(6) USING KALITE.
           02 LINE 6 COLUMN 30 PIC X(5) USING DONEM.
		   02 LINE 7 COLUMN 30 PIC X(10) USING TARIH.
           02 LINE 8 COLUMN 30 PIC 9(4) USING UYENO.
           02 LINE 9 COLUMN 30 PIC X(20) USING AD-SOYAD.
           02 LINE 10 COLUMN 30 PIC 9(4) USING TANE.
           02 LINE 11 COLUMN 30 PIC 9(6) USING BAREM-FIATI.
           02 LINE 12 COLUMN 30 PIC 9(4) USING MIKTARI.
           02 LINE 13 COLUMN 30 PIC 9(3) USING STNO.
       01 EK4.
           02 LINE 16 COLUMN 10 VALUE "TUTARI       =".
           02 LINE 16 COLUMN 30 PIC 9(8) USING TUTAR.
           02 LINE 18 COLUMN 10 PIC X(40) FROM ALL "~".
       01 EK5.                
           02 BLANK SCREEN.
           02 LINE 1 COLUMN 1 VALUE "MARMARA BIRLIK".
           02 LINE 5 COLUMN 10 PIC X(40) FROM ALL "~".
           02 LINE 6 COLUMN 10 VALUE "KALITE   :".
           02 LINE 7 COLUMN 10 VALUE "DONEM    :".
           02 LINE 8 COLUMN 10 VALUE "TARIH    :".
           02 LINE 6 COLUMN 30 PIC X(6) USING K1.
           02 LINE 7 COLUMN 30 PIC X(5) USING D1.
		   02 LINE 8 COLUMN 30 PIC X(10) USING T1.
       01 SFR. 02 LINE 12 COLUMN 27 PIC X(10) SECURE USING SIFRE.  
       PROCEDURE DIVISION.
       MMMM. DISPLAY (1 1) ERASE.
           DISPLAY (11 10) "*****************************************".
           DISPLAY (12 10) "*** S I F R E :**************************". 
           DISPLAY (13 10) "*****************************************".
           ACCEPT SFR ON ESCAPE GO SEV.
           IF SIFRE NOT = "EDINCIK" DISPLAY (1 1) ERASE STOP RUN.
       SEV. DISPLAY EK1.
       NNNN. ACCEPT EK1. 
           IF S = 99  OPEN OUTPUT BRD CLOSE BRD  
           ELSE IF S = 66 PERFORM SON
           ELSE IF S = 55 PERFORM YAZICI-DOKUM
           ELSE IF S = 44 PERFORM EKRAN
           ELSE IF S = 33 PERFORM SILME
           ELSE IF S = 22 PERFORM DEGISIKLIK
           ELSE IF S = 11 PERFORM GIRIS
           ELSE DISPLAY (23 7) S (23 10)
           "NOLU SECENEK YANLIS LUTFEN DOGRUSUNU GIRINIZ" GO NNNN.
           DISPLAY EK1. DISPLAY (23 7) S (23 10) 
           "NOLU ISLEM TAMAMLANMISTIR". GO NNNN.
       GIRIS SECTION.
       GGGG. OPEN I-O BRD.
       G1. MOVE 0 TO FISNO. DISPLAY EK2. 
           DISPLAY (24 1) "ESC TUSU ILE ANA MENUYE DONULUR".
           DISPLAY (2 10) "VERI GIRISI". 
           ACCEPT EK2 ON ESCAPE GO G-SON.
           READ BRD INVALID KEY GO G2.
           DISPLAY (23 1) "BU KAYIT ONCEDEN GIRILMIS".
           DISPLAY (24 1) "BASKA KAYIT ICIN ENT BAS".
           ACCEPT (24 50) CEVAP DISPLAY (23 1) ERASE GO G1.
       G2. MOVE ALL ZEROS TO TANE BAREM-FIATI MIKTARI UYENO TUTAR STNO. 
           MOVE ALL "." TO AD-SOYAD TARIH DONEM KALITE.
           DISPLAY EK3.
           DISPLAY (24 1) "CTRL-B ILE BIRALAN GERI GIDERSINIZ".
           ACCEPT EK3.
           COMPUTE TUTAR = BAREM-FIATI * MIKTARI.
           DISPLAY EK4. DISPLAY (23 1) ERASE.
           DISPLAY (23 1) "VERILER DOGRUMU (E/H):".
           ACCEPT (23 34) CEVAP. 
           IF CEVAP = "H" GO G2.
           WRITE BRD-KAYDI INVALID KEY DISPLAY (23 1) ERASE (23 1)
            "DISKET DOLU VEYA BOZUK ENT BAS" ACCEPT CEVAP GO G-SON.
           GO G1.   
       G-SON. CLOSE BRD.
       DEGISIKLIK SECTION.
       DDDD1. OPEN I-O BRD.
       DC1. MOVE 0 TO FISNO. DISPLAY EK2.
           DISPLAY (2 10) "BILGILERDE DEGISIKLIK".
           DISPLAY (23 1)
           "DEGISIKLIK YAPACAGINIZ KAYDIN FIS'NOSUNU GIRINIZ".
           DISPLAY (24 1) "ESC TUSU ILE ANA MENUYE DONERSINIZ".
           ACCEPT EK2 ON ESCAPE GO D-SON.
           READ BRD INVALID KEY DISPLAY (23 1) ERASE DISPLAY (23 1)
           "BU FIS'NOLU KAYIT YOK {ENT BAS}:" ACCEPT CEVAP GO DC1.
           DISPLAY EK3. 
           DISPLAY (24 1) "CTRL-B ILE BIR ALAN GERI GIDILIR". 		   
           ACCEPT EK3.
           COMPUTE TUTAR = BAREM-FIATI * MIKTARI.
           DISPLAY (23 1) ERASE. 
           DISPLAY EK4.  
           DISPLAY (23 1) 
           "YENI KAYDI DOSYAYA YAZMAK ISTIYORMUSUNUZ (E/H):".
           ACCEPT (23 40) CEVAP. IF CEVAP = "H" GO DC1.
           REWRITE BRD-KAYDI INVALID KEY DISPLAY (23 1) ERASE DISPLAY 
           (23 1) 
           "KAYDI DOSYAYA YAZAMIYORUM DISKET DOLU/BOZUK {ENT BAS:}" 
           ACCEPT CEVAP GO D-SON.
           GO DC1.
       D-SON. CLOSE BRD.
       SILME SECTION.
       CCCC. OPEN I-O BRD.
       C1. MOVE 0 TO FISNO. DISPLAY EK2.
           DISPLAY (2 10) "ISTENILEN BIR KAYDIN SILINMESI".
           DISPLAY (23 1) ERASE.
           DISPLAY (23 1) "SILINECEK KAYDIN FIS'NOSUNU GIRINIZ".
           DISPLAY (24 1) "ESC TUSU ILE ANA MENUYE DONERSINIZ".
           ACCEPT EK2 ON ESCAPE GO C-SON.
           READ BRD INVALID KEY DISPLAY (23 1) ERASE DISPLAY (23 1)
           "BU NOLU KAYIT DOSYADA YOK {ENT BAS:}" ACCEPT CEVAP GO C1.
           DISPLAY EK3.
           COMPUTE TUTAR = BAREM-FIATI * MIKTARI. 
           DISPLAY EK4. DISPLAY (23 1) ERASE.  DISPLAY (23 1)
           "BU KAYDI SILMEK ISTIYORMUSUNUZ (E/H):". 
           ACCEPT (23 40) CEVAP. 
           IF CEVAP = "H" GO C1.
           DELETE BRD RECORD INVALID KEY 
           DISPLAY (23 1) ERASE DISPLAY (23 1) 
           "KAYDI SILEMIYORUM DISKET BOZUK {ANA MENU ICIN ENT BAS}:" 
           ACCEPT CEVAP GO C-SON. 
           GO C1. 
       C-SON. CLOSE BRD.
       EKRAN SECTION.
       EEEE. OPEN I-O BRD. 
       GFHFG. MOVE 0 TO SSNO FISNO.
       E1. MOVE ALL "." TO T1 K1 D1. DISPLAY EK5. 
	       DISPLAY (4 10) "EKRAN DOKUMU". 
           DISPLAY (23 1) "CTRL-B ILE BIR ALAN GERI GIDILIR". 
           DISPLAY (24 1) "ESC TUSU ILE ANA MENUYE DONERSINIZ".
           ACCEPT EK5 ON ESCAPE GO E-SON. 
           DISPLAY (22 10) "DOGRUMU {E/H}:". 
           ACCEPT (22 30) CEVAP IF CEVAP = "H" GO E1 
		   IF CEVAP = "E" GO GRF. MOVE ALL "."  TO AD-SOYAD. 
           MOVE 0 TO BEY1 BBEY1 BEY2 BBEY2 GNY1 GGNY1.
           MOVE 0 TO GNY2 GGNY2 TUTAR BAREM-FIATI MIKTARI.
       GRF. MOVE K1 TO KALITE. MOVE D1 TO DONEM. MOVE T1 TO TARIH. 
	       START BRD KEY NOT LESS THAN KOD INVALID KEY 
            DISPLAY (23 1) ERASE DISPLAY (23 1) 
            "DOSYAYA START YAPILAMIYOR}" ACCEPT CEVAP GO E-SON. 
           MOVE 0 TO C.
       E3. PERFORM E-BASLIK. IF C = 0 GO EE1.
       E4. ADD 1 TO LIN. ADD 1 TO NZ.
           COMPUTE TUTAR = BAREM-FIATI * MIKTARI.
           MOVE FISNO TO FNO. 
           MOVE UYENO TO UNO.
           MOVE AD-SOYAD TO AD-S. 
           MOVE TANE TO DANE. 
           MOVE TUTAR TO TUT.
           MOVE BAREM-FIATI TO BAREM. 
           MOVE MIKTARI TO MIK.
           DISPLAY (LIN + 6 1) DETAY. 
           ADD TUTAR TO TPTUT. 
           ADD MIKTARI TO TPMIK.
       EE1. READ BRD NEXT AT END PERFORM E-SONUC GO E-SON.
           IF K1 = KALITE AND 
            D1 = DONEM AND 
            T1 = TARIH GO E5 ELSE GO EE1.
       E5. IF LIN > 13 PERFORM E-SONUC DISPLAY (24 1) 
            "DEVAM ETMEK ISTIYORMUSUNUZ {E/H}:" 
            ACCEPT (24 35) CEVAP IF CEVAP = "H" GO E-SON ELSE GO E3.
           GO E4.
       E-BASLIK. ADD 1 TO SSNO. MOVE SSNO TO SNO.
		   MOVE DONEM TO DONEM-1.
		   MOVE TARIH TO TARIH-1.
           MOVE TARIH TO TTARIH-1.
           MOVE KALITE TO KALITE-1.
           DISPLAY (1 1) ERASE. 
           DISPLAY (1 1) BAS1.
           DISPLAY (2 1) BAS3.
           DISPLAY (3 1) BAS4.
           DISPLAY (4 1) BAS5.
           DISPLAY (5 1) BAS6.  
           DISPLAY (6 1) CIZGI.
           MOVE 0 TO LIN TPTUT TPMIK GY1 GY2 GGY1 GGY2.
       E-SONUC.
           ADD TPMIK TO GGY1. 
           ADD TPTUT TO GGY2.
           MOVE GGY1 TO GY1.
           MOVE GGY2 TO GY2.  
           ADD TPMIK TO BBEY1.
           ADD TPTUT TO BBEY2. 
           MOVE BBEY1 TO BEY1.
           MOVE BBEY2 TO BEY2.
           IF C = 0 MOVE GGY1 TO GNY1 MOVE GGY2 TO GNY2
           ELSE IF C > 0 ADD GGY1 BBEY1 GIVING GNY1 
           ADD GGY2 BBEY2 GIVING GNY2. 
           DISPLAY (LIN + 7 1) CIZGI.
           DISPLAY (LIN + 8 1) BAS7.
           DISPLAY (LIN + 9 1) BAS8. 
           DISPLAY (LIN + 10 1) BAS9. ADD 1 TO C.
       E-SON. DISPLAY (23 1) ERASE. DISPLAY (24 1) 
            "ANA MENU ICIN {ENT BAS}:". ACCEPT CEVAP. 
		   CLOSE BRD.      
       YAZICI-DOKUM SECTION.
       YYY11. OPEN I-O BRD. OPEN OUTPUT YAZICI.
       ASHFDG. MOVE 0 TO SSNO FISNO SIRA.
       Y1. MOVE ALL "." TO T1 K1 D1. DISPLAY EK5. 
	       DISPLAY (4 10) "YAZICI DOKUMU". 
           DISPLAY (23 1) "CTRL-B ILE BIR ALAN GERI GIDILIR". 
           DISPLAY (24 1) "ESC TUSU ILE ANA MENUYE DONERSINIZ".
           ACCEPT EK5 ON ESCAPE GO Y-SON. 
           DISPLAY (22 10) "DOGRUMU {E/H}:". 
           ACCEPT (22 30) CEVAP IF CEVAP = "H" GO Y1 
		   IF CEVAP = "E" GO GDF. MOVE ALL "."  TO AD-SOYAD. 
           MOVE 0 TO BEY1 BBEY1 BEY2 BBEY2 GNY1 GGNY1.
           MOVE 0 TO GNY2 GGNY2 TUTAR BAREM-FIATI MIKTARI.
       GDF. MOVE K1 TO KALITE. MOVE D1 TO DONEM. MOVE T1 TO TARIH. 
	       START BRD KEY NOT LESS THAN KOD INVALID KEY 
            DISPLAY (23 1) ERASE DISPLAY (23 1) 
            "DOSYAYA START YAPILAMIYOR" ACCEPT CEVAP GO Y-SON. 
           MOVE 0 TO C.
       Y3. PERFORM Y-BASLIK. IF C = 0 GO YY1.
       Y4. ADD 1 TO SIRA. 
           COMPUTE TUTAR = BAREM-FIATI * MIKTARI.
           MOVE FISNO TO FNO. 
           MOVE UYENO TO UNO.
           MOVE AD-SOYAD TO AD-S. 
           MOVE TANE TO DANE. 
           MOVE TUTAR TO TUT.
           MOVE BAREM-FIATI TO BAREM. 
           MOVE MIKTARI TO MIK.
           WRITE SATIR FROM DETAY. 
           ADD TUTAR TO TPTUT. 
           ADD MIKTARI TO TPMIK.
       YY1. READ BRD NEXT AT END PERFORM Y-SONUC GO Y-SON.
           IF K1 = KALITE AND 
            D1 = DONEM AND 
            T1 = TARIH GO Y5 ELSE GO YY1.
       Y5. IF SIRA > 40 PERFORM Y-SONUC DISPLAY (24 1) 
            "DEVAM ETMEK ISTIYORMUSUNUZ {E/H}:" 
            ACCEPT (24 35) CEVAP IF CEVAP = "H" GO Y-SON 
			ELSE GO Y3.
           GO Y4.
       Y-BASLIK. ADD 1 TO SSNO. MOVE SSNO TO SNO.
		   MOVE DONEM TO DONEM-1.
		   MOVE TARIH TO TARIH-1.
           MOVE TARIH TO TTARIH-1.
           MOVE KALITE TO KALITE-1.
           WRITE SATIR FROM BAS1 AFTER 5.
           WRITE SATIR FROM BAS3.
           WRITE SATIR FROM BAS4.
           WRITE SATIR FROM BAS5.
           WRITE SATIR FROM BAS6.  
           WRITE SATIR FROM CIZGI.
           MOVE 0 TO SIRA TPTUT TPMIK GY1 GY2 GGY1 GGY2.
       Y-SONUC.
           ADD TPMIK TO GGY1. 
           ADD TPTUT TO GGY2.
           MOVE GGY1 TO GY1.
           MOVE GGY2 TO GY2.  
           ADD TPMIK TO BBEY1.
           ADD TPTUT TO BBEY2. 
           MOVE BBEY1 TO BEY1.
           MOVE BBEY2 TO BEY2.
           IF C = 0 MOVE GGY1 TO GNY1 MOVE GGY2 TO GNY2
           ELSE IF C > 0 ADD GGY1 BBEY1 GIVING GNY1 
           ADD GGY2 BBEY2 GIVING GNY2. 
           WRITE SATIR FROM CIZGI.
           WRITE SATIR FROM BAS7.
           WRITE SATIR FROM BAS8. 
           WRITE SATIR FROM BAS9. 
           WRITE SATIR FROM BOSLUK AFTER 2.
		   ADD 1 TO C.
       Y-SON. DISPLAY (23 1) ERASE. DISPLAY (24 1) 
            "ANA MENU ICIN {ENT BAS}:". ACCEPT CEVAP.
		   CLOSE BRD YAZICI.      
       SON SECTION.
       WWW. DISPLAY (1 1) ERASE. STOP RUN.
