       IDENTIFICATION  DIVISION.
       PROGRAM-ID.  SENET.
       AUTHOR. MEHMET HARAS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SENET ASSIGN TO DISK ORGANIZATION INDEXED
           ACCESS DYNAMIC RECORD KEY S-NO.
           SELECT YAZICI ASSIGN TO PRINTER.
       DATA DIVISION.
       FILE SECTION.
       FD SENET LABEL RECORD STANDARD VALUE OF FILE-ID "SENET.DOS".
       01 S-KAYDI.
              03 S-NO PIC 9(4).
              03 B-ISMI PIC X(19).
              03 K-ISMI PIC X(19).
              03 V-TARIH.
                 04 V-GUN PIC 9(2).
                 04 V-AY PIC 9(2).
                 04 V-YIL PIC 9(4).
              03 ADRES1 PIC X(21).
              03 V-YER PIC X(8).
              03 AKIBET PIC X.
              03 TUTAR PIC 9(11).			  
       FD YAZICI LABEL RECORD OMITTED.
       01 YAZ PIC X(132).
       WORKING-STORAGE SECTION.
       77 N PIC X VALUE SPACE.
       77 CR PIC X(8) VALUE SPACES.
       77 SSNO PIC 9(4) VALUE 0.
       77 SIRAN PIC 9(3) VALUE 0.
       77 B-IS PIC X(19) VALUE SPACES.
       77 S-GUN PIC 9(2) VALUE 0.
       77 S-AY PIC 9(2) VALUE 0.
       77 S-YIL PIC 9(4) VALUE 0.
       77 MS-GUN PIC 9(2) VALUE 0.
       77 KL-GUN PIC 9(2) VALUE 0.
       77 S-TOP PIC 9(13) VALUE 0.
       77 G-TOP PIC 9(13) VALUE 0.
       77 C PIC X VALUE SPACE.
       77 S PIC 9 VALUE 0.
       77 LSC PIC 9(2) VALUE 0.
       77 ILK-SNO PIC 9(4) VALUE 0.
       77 SON-SNO PIC 9(4) VALUE 0.
       77 BOSLUK PIC X(80) VALUE SPACES.
       77 YASR PIC 9(4) VALUE 0.
       01 BAS1.
          02 F PIC X(80) VALUE 
             "Y š K S E L   T A R I M   A L E T L E R ˜".
       01 BS1.
          02 F PIC X(23) VALUE " SAN. ve T˜C. LTD. žT˜.".
       01 BASIS.
           02 F PIC X(13) VALUE "BOR€LU ˜SM˜=".
           02 BORCLU PIC X(19).
           02 F PIC X(5) VALUE SPACES.
           02 F PIC X(7) VALUE "ADRES:".
           02 ADRES99 PIC X(21).
       01 BASIS1.
           02 F PIC X(39) VALUE "SR  S-NO KEFIL ISMI          V-TARIHI".
           02 F PIC X(40) VALUE 
              " CIRO     D       TUTARI".
       01 BASIS2.
           02 SIRA PIC ZZ9.
		   02 F PIC X VALUE SPACE.
           02 SS-NO PIC ZZZ9.
           02 F PIC X VALUE SPACE.
           02 KEFIL PIC X(19).
           02 F PIC X VALUE SPACE.
           02 SS-GUN PIC 9(2).
           02 F PIC X VALUE "/".
           02 SS-AY PIC 9(2).
           02 F PIC X VALUE "/".
           02 SS-YIL PIC 9(4).
           02 F PIC X VALUE SPACE.
           02 VV-YER PIC X(8).
           02 F PIC X VALUE SPACE.
           02 AAK PIC X.
           02 F PIC X VALUE SPACE.
           02 TUT PIC ZZ,ZZZ,ZZZ,ZZ9.
       01 BASTAR.
           02 F PIC X(23) VALUE SPACES.
           02 F PIC X(15) VALUE "VADE TARIHI:".
           02 SS-GUN1 PIC 9(2).
           02 F PIC X VALUE "/".
           02 SS-AY1 PIC 9(2).
           02 F PIC X VALUE "/".
           02 SS-YIL1 PIC 9(4).
           02 F PIC X(9) VALUE SPACES.
           02 F PIC X(9) VALUE "SON GšN:".
           02 SNGUN PIC 9(2).
       01 BASTAR1.
           02 F PIC X(29) VALUE 
                "SR  S-NO BOR€LU ISMI         ".
           02 F PIC X(41) VALUE 
                "ADRES                 CIRO     D TUTARI".
       01 BASTAR2.
           02 SIRA1 PIC ZZ9.
		   02 F PIC X VALUE SPACE.
           02 SS-NO1 PIC ZZZ9.
           02 F PIC X VALUE SPACE.
           02 BORCLU1 PIC X(19).
           02 F PIC X VALUE SPACE.		   
           02 ADRESI1 PIC X(21).
           02 F PIC X VALUE SPACE.
           02 VV-YER1 PIC X(8).
           02 F PIC X VALUE SPACE.
           02 AAK1 PIC X.
           02 F PIC X VALUE SPACE.
           02 TUT1 PIC ZZ,ZZZ,ZZZ,ZZ9.
       01 BASCIRO.
           02 F PIC X(33) VALUE SPACES.
           02 F PIC X(9) VALUE "CIRONTO=".
           02 VV-YER2 PIC X(8).
       01 BASCIRO1.
           02 F PIC X(39) VALUE 
              "SR  S-NO BOR€LU ISMI        V-TARIHI".
           02 F PIC X(40) VALUE "ADRES                 D      TUTARI".
       01 BASCIRO2.
           02 SIRA2 PIC ZZ9.
		   02 F PIC X VALUE SPACE.
           02 SS-NO2 PIC ZZZ9.
           02 F PIC X VALUE SPACE.
           02 BORCLU2 PIC X(19).
           02 SS-GUN2 PIC 9(2).
           02 F PIC X VALUE "/".
           02 SS-AY2 PIC 9(2).
           02 F PIC X VALUE "/".
           02 SS-YIL2 PIC 9(4).
           02 F PIC X VALUE SPACE.
           02 ADRESI2 PIC X(21).
           02 F PIC X VALUE SPACE.
           02 AAK2 PIC X.
           02 F PIC X VALUE SPACE.
           02 TUT2 PIC ZZ,ZZZ,ZZZ,ZZ9.
       01 BASAK.
           02 F PIC X(33) VALUE SPACES.
           02 F PIC X(9) VALUE "AKIBETI=".
           02 AAK3 PIC X.
       01 BAS2.
          02 F PIC X(29) VALUE 
		     "SR  S-NO BOR€LU ˜SM˜".
          02 F PIC X(43) VALUE 
             "V-TARIHI  ADRES                CIRO".
          02 F PIC X(8) VALUE "  TUTARI".
       01 BAS3.
          02 SIRA3 PIC ZZ9.
          02 F PIC X VALUE SPACE.		  
          02 SS-NO3 PIC ZZZ9.
          02 F PIC X VALUE SPACES.
          02 BORCLU3 PIC X(19).
          02 SS-GUN3 PIC 9(2).
          02 F PIC X VALUE "/".		   
          02 SS-AY3 PIC 9(2).
          02 F PIC X VALUE "/".
          02 SS-YIL3 PIC 9(4).
          02 F PIC X VALUE SPACE.
          02 ADRESI3 PIC X(21).
          02 VV-YER3 PIC X(8).
          02 F PIC X VALUE SPACE.
          02 TUT3 PIC ZZZZZZZZZZ9.
       01 BAS4.
          02 F PIC X(80) VALUE ALL "=".
       01 BAS6.
           02 F PIC X(39) VALUE
              "SR S-NO BO€LU ˜SM˜         V-TARIH   ".
           02 F PIC X(39) VALUE 
              "ADRES               CIRO    D TUTARI".
       01 BAS7.
           02 SIRA4 PIC ZZ9.
           02 SS-NO4 PIC ZZZ9.
           02 F PIC X VALUE SPACE.
           02 BORCLU4 PIC X(19).
           02 SS-GUN4 PIC 9(2).
           02 F PIC X VALUE "/".
           02 SS-AY4 PIC 9(2).
           02 F PIC X VALUE "/".
           02 SS-YIL4 PIC 9(4).
           02 F PIC X VALUE SPACE.
           02 ADRESI4 PIC X(21).
           02 VV-YER4 PIC X(8).
           02 AAK4 PIC X.
           02 F PIC X VALUE SPACE.
           02 TUT4 PIC ZZZZZZZZZZ9.
       01 SAYFA-SONUT.
           02 F PIC X(35) VALUE SPACES.
           02 F PIC X(15) VALUE "SAYFA TOPLAMI=".
           02 SS-TOP PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
       01 SAYFA-SONUB.
           02 F PIC X(35) VALUE SPACES.
           02 F PIC X(15) VALUE "GENEL TOPLAM=".
           02 GG-TOP PIC Z,ZZZ,ZZZ,ZZZ,ZZ9.
       SCREEN SECTION.
       01 E1.
           02 BLANK SCREEN.
           02 LINE 1 COLUMN 1 REVERSE-VIDEO VALUE 
              "Y š K S E L   T A R I M   A L E T L E R ˜   ".
           02 LINE 1 COLUMN 45 REVERSE-VIDEO VALUE 
              "SAN. ve T˜C. LTD. žT˜.".
           02 LINE 2 COLUMN 1 REVERSE-VIDEO VALUE 
              "ATATšRK CAD. 200 TEL. 11905 - 15844  BANDIRMA".
           02 LINE 5 COLUMN 25 VALUE "SENET PROGRAMI MENUSU".
           02 LINE 7 COLUMN 5 VALUE "1:SENET GIRISI".
           02 LINE 8 COLUMN 5 VALUE "2:AKIBET GIRISI".
           02 LINE 9 COLUMN 5 VALUE "3:DE¦˜S˜KL˜K".		   
           02 LINE 10 COLUMN 5 VALUE "4:IPTAL".
           02 LINE 11 COLUMN 5 VALUE "5:LISTE".
           02 LINE 12 COLUMN 5 VALUE "6:€IKIž".
           02 LINE 15 COLUMN 5 REVERSE-VIDEO VALUE "SEC˜M˜N˜Z:==>".
           02 LINE 15 COLUMN 21 AUTO PIC 9 USING S.
       01 E2.
           02 LINE 1 COLUMN 1 REVERSE-VIDEO VALUE
              "Y š K S E L   T A R I M   A L E T L E R ˜   ".
           02 LINE 1 COLUMN 45 REVERSE-VIDEO VALUE  
		      "SAN. VE T˜C. LTD. žT˜.".
           02 LINE 6 COLUMN 5 VALUE "BOR€LU ˜SM˜:".
           02 LINE 7 COLUMN 5 VALUE "KEF˜L ˜SM˜ :".
           02 LINE 8 COLUMN 5 VALUE "VADE TAR˜H˜:".
           02 LINE 9 COLUMN 5 VALUE "C˜RONTOSU  :".
           02 LINE 9 COLUMN 35 VALUE "AK/SEKER/GARANTI/KASA/SAT".
           02 LINE 10 COLUMN 5 VALUE "ADRES1     :".
           02 LINE 13 COLUMN 5 VALUE "TUTARI    :".
           02 LINE 6 COLUMN 23 PIC X(19) USING B-ISMI.
           02 LINE 7 COLUMN 23 PIC X(19) USING K-ISMI.
           02 LINE 8 COLUMN 23 AUTO PIC 9(2) USING V-GUN.
           02 LINE 8 COLUMN 25 VALUE " / ".
           02 LINE 8 COLUMN 28 AUTO PIC 9(2) USING V-AY.
           02 LINE 8 COLUMN 30 VALUE " / ".
           02 LINE 8 COLUMN 33 AUTO PIC 9(4) USING V-YIL.
           02 LINE 9 COLUMN 23 PIC X(8) USING V-YER.
           02 LINE 10 COLUMN 23 PIC X(21) USING ADRES1.
           02 LINE 13 COLUMN 23 PIC 9(11) USING TUTAR.
       01 EE2.  02 BLANK SCREEN. 
           02 LINE 5 COLUMN 5 VALUE "SENET NOYU G˜R˜N˜Z:".
           02 LINE 5 COLUMN 25 PIC 9(4) USING S-NO.    			  
       01 E3.
             02 BLANK SCREEN.
             02 LINE 5 COLUMN 25 REVERSE-VIDEO VALUE 
                "L ˜ S T E    D ™ K š M š".
             02 LINE 7 COLUMN 7 VALUE 
			    "  ˜SME G™RE D™KšM  1: EKRAN ; 11: YAZICI".
             02 LINE 8 COLUMN 7 VALUE 
			    "  TAR˜HE G™RE D™KšM  2: EKRAN ; 22: YAZICI".
             02 LINE 9 COLUMN 7 VALUE
                "  CIRONTOYA G™RE D™KšM  3: EKRAN ; 33: YAZICI".
             02 LINE 10 COLUMN 7 VALUE 
                "  SENET NUMARASINA G™RE D™KšM  4: EKRAN ; 44: YAZICI".
             02 LINE 11 COLUMN 7 VALUE
                "  AKIBETINE GORE DOKUM (P/O/I)  5: EKRAN ; 55: YAZICI".
             02 LINE 12 COLUMN 7 VALUE "9:€IKIž".
             02 LINE 13 COLUMN 5 REVERSE-VIDEO VALUE "SEC˜M˜N˜Z:==>".
             02 LINE 13 COLUMN 21 PIC 9(2) USING LSC.
       01 E4.
             02 BLANK SCREEN.
             02 LINE 7 COLUMN 7 VALUE "BOR€LU ˜SM˜N˜ G˜R˜N˜Z:".
			 02 LINE 7 COLUMN 33 PIC X(19) USING B-IS.
       01 E5.
             02 BLANK SCREEN.
             02 LINE 7 COLUMN 7 VALUE "VADE TAR˜H˜N˜ G˜R˜N˜Z:".
             02 LINE 9 COLUMN 7 VALUE 
                "SON GšN(AYA A˜T GšNLER ARASINDAK˜ BšTšN SENETLER˜N 
                "D™KšMš ALINIR".
             02 LINE 13 COLUMN 7 VALUE "SON GšNš G˜R˜N˜Z:".
             02 LINE 7 COLUMN 31 AUTO PIC 9(2) USING S-GUN.
             02 LINE 7 COLUMN 33 VALUE " / ".			 
             02 LINE 7 COLUMN 35 AUTO PIC 9(2) USING S-AY.
             02 LINE 7 COLUMN 37 VALUE "/ ".
             02 LINE 7 COLUMN 39 AUTO PIC 9(4) USING S-YIL.
             02 LINE 13 COLUMN 33 PIC 9(2) USING MS-GUN.
       01 E6. 
             02 BLANK SCREEN.
             02 LINE 5 COLUMN 7 VALUE "AK/SEKER/GARANTI/KASA/SAT".
             02 LINE 7 COLUMN 7 VALUE "CIRONTOYU G˜R˜N˜Z:".
             02 LINE 7 COLUMN 27 PIC X(8) USING CR.
       01 E7.
             02 LINE 11 COLUMN 5 VALUE "AK˜BET˜:(P/O/I):".
             02 LINE 11 COLUMN 23 PIC X USING AKIBET.
       01 E8.
	         02 BLANK SCREEN.
			 02 LINE 11 COLUMN 5 VALUE "AKIBETI:(P/O/I):".
             02 LINE 11 COLUMN 23 PIC X USING N.
       01 DS1.  02 BLANK SCREEN.
           02 LINE 11 COLUMN 15 VALUE
              "BU B™LšMDE DOSYA YEN˜DEN YARATILIR".
           02 LINE 13 COLUMN 15 VALUE 
              "KAYITLARIN S˜L˜NMEMES˜ ˜€˜N ESC'ye BAS".
           02 LINE 15 COLUMN 15 PIC X USING C.
       01 EEA.   02 BLANK SCREEN.
           02 LINE 11 COLUMN 11 VALUE "ILK SENET NO'YU G˜R˜N˜Z:".
           02 LINE 13 COLUMN 11 VALUE "SON SENET NO'YU G˜R˜N˜Z:".
           02 LINE 11 COLUMN 39 PIC 9(4) USING ILK-SNO.
           02 LINE 13 COLUMN 39 PIC 9(4) USING SON-SNO.
       01 YAZIPQ. 
           02 LINE 24 COLUMN 1 BLANK SCREEN.
           02 LINE 24 COLUMN 5 REVERSE-VIDEO VALUE 
              "YAZICIYI A€IP {ENTER} / MENU ˜€˜N {ESC}".
           02 LINE 24 COLUMN 57 PIC X USING C.
       PROCEDURE DIVISION.
       MH. DISPLAY (1 1) ERASE. 
           DISPLAY (11 11) "YšKSEL TARIM ALETLER˜".
           DISPLAY (12 11) "SAN. VE T˜C. LTD. žT˜.".
           DISPLAY (13 11) "---S E N E T   P R O G R A M I---".
           DISPLAY (15 35) "---Hazrlayan: MEHMET HARAS ---".
           DISPLAY (21 9) "DEVAM ˜€˜N ENT BASINIZ:".
           ACCEPT (21 33) C.
       SSS1.  DISPLAY E1. 
       SSSS2.   ACCEPT E1.
	       IF S = 0 PERFORM DOSYA
             ELSE IF S = 1 PERFORM GIRIS
             ELSE IF S = 2 PERFORM DURUM
             ELSE IF S = 3 PERFORM DEGIS
             ELSE IF S = 4 PERFORM SILME
             ELSE IF S = 5 PERFORM LISTE
             ELSE IF S = 6 GO SSSON
             ELSE DISPLAY (21 7) S DISPLAY (21 9) 
             ".NOLU ˜žLEM YANLIž LšTFEN DO¦RU G˜R˜N˜Z" GO SSSS2. 
           GO SSS1.
       DOSYA SECTION.
       D1. DISPLAY DS1. ACCEPT DS1 ON ESCAPE GO SON. GO SON.
           DISPLAY (1 1) ERASE. DISPLAY (15 11) 
		   "KAYITLARIN TšMšNš S˜L˜P ".
           DISPLAY (17 11) 
           "TEKRAR DOSYA YARATMAK ˜ST˜YORMUSUNUZ (E/H):".  
           ACCEPT (17 55) C. IF C = "H" GO SON. 
       DDHGDSEA1. OPEN OUTPUT SENET  CLOSE SENET.
       SON. EXIT.
       GIRIS SECTION.
       GIR1. OPEN I-O SENET. 
       GIR2. MOVE 0 TO S-NO V-GUN V-AY V-YIL TUTAR.
           MOVE SPACES TO B-ISMI K-ISMI ADRES1 V-YER AKIBET.
           DISPLAY EE2. DISPLAY E2. DISPLAY (19 7) "ESC ˜LE €IKILIR".
           DISPLAY (3 5) "YEN˜ B˜LG˜ G˜R˜ž˜".
       GIR3. ACCEPT EE2 ON ESCAPE GO G-SON.
           READ SENET INVALID KEY GO GIR5. DISPLAY (21 21)
           "DOSYADA BU SENET NUMARALI KAYIT VAR ENT BAS"
           ACCEPT C  GO GIR2. 
       GIR5. ACCEPT E2 ON ESCAPE GO G-SON. 
           DISPLAY (23 21) "G˜R˜žLER DO¦RUMU (E/H):". ACCEPT (23 47) C.
           IF C = "H" GO GIR3. 
           WRITE S-KAYDI INVALID KEY DISPLAY (24 1) ERASE (24 1) 
           "DISKET DOLU YADA BOZUK ENT BAS:"  ACCEPT C  GO G-SON. 
           GO GIR2.
       G-SON. CLOSE SENET.
       DURUM SECTION.
       DR1. OPEN I-O SENET.
       DR2. MOVE 0 TO S-NO.  DISPLAY EE2. 
	       DISPLAY (23 1) "ESC ˜LE €IKILIR". 
		   DISPLAY (3 5) "AKIBET G˜R˜ž˜".
		   ACCEPT EE2 ON ESCAPE GO D-SON.
       DR3. READ SENET INVALID KEY DISPLAY (23 1) 
            "BU SENET KAYDI YAPILMAMIS ENT BAS " ACCEPT C GO DR2. 
           DISPLAY E2. 
       DR5. DISPLAY E7. ACCEPT E7 ON ESCAPE GO D-SON.
           DISPLAY (24 1) "G˜R˜žLER DO¦RUMU (E/H):". 
           ACCEPT (24 25) C. IF C = "H" GO DR5.
           REWRITE S-KAYDI INVALID KEY DISPLAY (24 1) ERASE (24 1)
           "DISKET DOLU YADA BOZUK ENT BAS:" ACCEPT C  GO D-SON.
           GO DR2. 
       D-SON. CLOSE SENET.
       DEGIS SECTION.
       DG1. OPEN I-O SENET.
       DG2. MOVE 0 TO S-NO.  DISPLAY EE2. 
	       DISPLAY (23 1) "ESC ˜LE €IKILIR".
           DISPLAY (3 5) "B˜LG˜ DEG˜ž˜KL˜¦˜".
		   ACCEPT EE2 ON ESCAPE GO DG-SON.
       DG3. READ SENET INVALID KEY DISPLAY (23 1) 
            "BU SENET KAYDI YAPILMAMIS ENT BAS " ACCEPT C GO DG2.
           DISPLAY E2.
       DG5. ACCEPT E2 ON ESCAPE GO DG-SON.
           DISPLAY (24 1) "G˜R˜žLER DO¦RUMU (E/H):". 
           ACCEPT (24 25) C. IF C = "H" GO DG5.
           REWRITE S-KAYDI INVALID KEY DISPLAY (24 1) ERASE (24 1)
           "DISKET DOLU YADA BOZUK ENT BAS:" ACCEPT C  GO DG-SON.
           GO DG2. 
       DG-SON. CLOSE SENET.
       SILME SECTION.
       SL1. OPEN I-O SENET.
       SL2. MOVE 1 TO S-NO.  DISPLAY EE2. 
           DISPLAY (23 7) "ESC ˜LE €IKILIR".
           DISPLAY (3 5) "KAYIT S˜L˜NMES˜".
           ACCEPT EE2 ON ESCAPE GO SL-SON.
       SL3. READ SENET INVALID KEY DISPLAY (23 1) ERASE (23 1)
            "BU SENET KAYDI IžLENMEM˜ž ENT BAS" ACCEPT C GO SL2.
           DISPLAY E2. DISPLAY E7. 
           DISPLAY (23 1) ERASE  (24 1)
           "BU KAYDI S˜LMEK ˜ST˜YOR MUSUNUZ? (E/H):". 
           ACCEPT (24 45) C. IF C = "H" GO SL2.
           DELETE SENET RECORD INVALID KEY DISPLAY (24 1) ERASE (24 1)
           "S˜LEM˜YORUM D˜SKET BOZUK ENT BAS" ACCEPT C GO SL-SON. 
           GO SL2.
       SL-SON. CLOSE SENET.
       LISTE SECTION.
       LS1. OPEN INPUT SENET. OPEN OUTPUT YAZICI.
       LS2. MOVE 0 TO S-NO V-TARIH TUTAR SIRAN.
           MOVE SPACES TO V-YER B-ISMI K-ISMI.
           MOVE SPACES TO ADRES1 AKIBET.
       LS3. MOVE 0 TO LSC LIN S-TOP G-TOP. DISPLAY E3. 
       LS4. ACCEPT E3.
           IF LSC = 1 GO LS5 
           ELSE IF LSC = 11 GO LISBASY1
           ELSE IF LSC = 2 GO LS6
           ELSE IF LSC = 22 GO LTARBASY1 
           ELSE IF LSC = 3 GO LS7 
           ELSE IF LSC = 33 GO LCRBASY1 
           ELSE IF LSC = 4 GO LS8
           ELSE IF LSC = 44 GO LSENETNOY1 
           ELSE IF LSC = 5 GO LS9 
           ELSE IF LSC = 55 GO LAKY1
           ELSE IF LSC = 9 GO L-SON ELSE 
           DISPLAY (19 7) LSC 
           DISPLAY (19 9) "  .NOLU SE€ENEK YANLIž ENT"
           ACCEPT C GO LS4.
       LS5. MOVE SPACES TO B-IS. DISPLAY E4.
           DISPLAY (21 7) "ESC ˜LE €IKILIR". MOVE 0 TO SIRAN S-NO.
           ACCEPT E4 ON ESCAPE GO LS3.
       LISQRW. START SENET KEY NOT LESS THAN S-NO INVALID KEY 
           DISPLAY (24 1) "DOSYAYA START YAPILAMIYOR"
           DISPLAY (24 33) "ENT BAS" ACCEPT C GO LS2. 
           DISPLAY (24 1) ERASE. DISPLAY (24 25) "LšTFEN BEKLEY˜N˜Z".
		   READ SENET NEXT AT END GO LS2. GO LISQ.
       LISBAS. MOVE B-IS TO BORCLU. MOVE ADRES1 TO ADRES99.
           DISPLAY (1 1) ERASE. DISPLAY (1 1) BAS1. 
           DISPLAY (2 1) BS1. DISPLAY (3 1) BASIS. 
           DISPLAY (4 1) BASIS1. DISPLAY (5 1) BAS4. 
       LIS1. READ SENET NEXT RECORD AT END GO LISSON. 
       LISQ. IF B-IS NOT = B-ISMI GO LIS1.
           ADD 1 TO LIN. ADD 1 TO SIRAN. MOVE SIRAN TO SIRA.
           MOVE S-NO TO SS-NO. MOVE K-ISMI TO KEFIL.
           MOVE V-GUN TO SS-GUN. MOVE V-AY TO SS-AY. 
           MOVE V-YIL TO SS-YIL. MOVE V-YER TO VV-YER. 
           MOVE AKIBET TO AAK. MOVE TUTAR TO TUT. ADD TUTAR TO S-TOP.
           IF LIN = 1 PERFORM LISBAS.
           DISPLAY (LIN + 6 1) BASIS2. 
           IF LIN = 13 DISPLAY (LIN + 7 1) BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           DISPLAY (LIN + 8 1) SAYFA-SONUT
           DISPLAY (LIN + 9 1) SAYFA-SONUB  DISPLAY (LIN + 8 1) BOSLUK
           DISPLAY (24 1) "DIGER SAYFA DOKUMUNU ISTIYORMUSUNUZ (E/H):"
           ACCEPT (24 45) C IF C = "H" GO LS2 ELSE MOVE 0 TO LIN S-TOP.
           GO LIS1.
       LISSON. IF LIN > 0 DISPLAY (LIN + 7 1) BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           DISPLAY (LIN + 8 1) SAYFA-SONUT 
           DISPLAY (LIN + 9 1) SAYFA-SONUB  DISPLAY (LIN + 10 1) BOSLUK.
           DISPLAY (24 1) ERASE.
           DISPLAY (24 1) "ANA MENU ˜€˜N ENT BAS". ACCEPT C.
       LISSSQQN. GO LS3.
       LISBASY1. PERFORM LS5.
           DISPLAY (24 1) "YAZICI DOKUMU ISTIYORMUSUNUZ (E/H):".
           ACCEPT (24 45) C. IF C = "H" GO LS2. DISPLAY YAZIPQ.
           ACCEPT YAZIPQ ON ESCAPE GO LS2. 
       ZAMAN1. PERFORM LS2.
           MOVE 0 TO SIRAN. MOVE 0 TO S-NO YASR.
           START SENET KEY NOT LESS THAN S-NO INVALID KEY 
           DISPLAY (24 1) ERASE (24 1) "DOSYAYA START YAPILAMIYOR ENT"
           ACCEPT C GO LS2. DISPLAY (24 1) ERASE.
           DISPLAY (24 25) "LšTFEN BEKLEY˜N˜Z".
           READ SENET NEXT AT END GO LS2. GO LIS2Y.
       LISBASY.  WRITE YAZ FROM BAS1 AFTER 8. MOVE ADRES1 TO ADRES99.
           WRITE YAZ FROM BS1. MOVE B-IS TO BORCLU.
           WRITE YAZ FROM BASIS. WRITE YAZ FROM BASIS1. 
           WRITE YAZ FROM BAS4.
       LIS1Y. READ SENET NEXT AT END GO LISSONY. 
       LIS2Y. IF B-IS NOT = B-ISMI GO LIS1Y. ADD 1 TO YASR.
           ADD 1 TO SIRAN. MOVE SIRAN TO SIRA. 
           MOVE S-NO TO SS-NO. MOVE K-ISMI TO KEFIL.
           MOVE V-GUN TO SS-GUN. MOVE V-AY TO SS-AY. 
           MOVE V-YIL TO SS-YIL. MOVE V-YER TO VV-YER. 
           MOVE AKIBET TO AAK. MOVE TUTAR TO TUT. ADD TUTAR TO S-TOP.
           IF YASR = 1 PERFORM LISBASY.
           WRITE YAZ FROM BASIS2. 
           IF YASR = 45 WRITE YAZ FROM BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           WRITE YAZ FROM SAYFA-SONUT
           WRITE YAZ FROM SAYFA-SONUB WRITE YAZ FROM BOSLUK
           DISPLAY (24 1) ERASE
           DISPLAY (24 1) "DIGER SAYFA DOKUMUNU ISTIYORMUSUNUZ (E/H):"
           ACCEPT (24 45) C IF C = "H" GO LS2 ELSE MOVE 0 TO YASR S-TOP.
           GO LIS1Y.
       LISSONY. IF YASR > 0 WRITE YAZ FROM BAS4  MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           WRITE YAZ FROM SAYFA-SONUT  WRITE YAZ FROM SAYFA-SONUB
           WRITE YAZ FROM BOSLUK. DISPLAY (24 1) ERASE (24 1) "ENT BAS".
           ACCEPT C.
       LISYYQQW. GO LS3.
       LS6. MOVE 0 TO S-GUN S-AY S-YIL V-TARIH SIRAN S-NO MS-GUN. 
           DISPLAY E5. 
           DISPLAY (21 7) "ESC ˜LE €IKILIR".
           ACCEPT E5 ON ESCAPE GO LS3.
       HJHLG. START SENET KEY NOT LESS S-NO INVALID KEY 
           DISPLAY (24 1) "DOSYAYA START YAPILAMIYOR"
           DISPLAY (24 33) "ENT BAS" ACCEPT C GO LS2.
           DISPLAY (24 1) ERASE. DISPLAY (24 25) "LšTFEN BEKLEY˜N˜Z".
           READ SENET NEXT AT END GO LS2. GO LTAR2.
       LTARBAS. MOVE S-GUN TO SS-GUN1. 
           MOVE S-AY TO SS-AY1. MOVE S-YIL TO SS-YIL1. 
           DISPLAY (1 1) ERASE. DISPLAY (1 1) BAS1. DISPLAY (2 1) BS1.
           DISPLAY (3 1) BASTAR. DISPLAY (4 1) BASTAR1. 
           DISPLAY (5 1) BAS4.
       LTAR1. READ SENET NEXT AT END GO LTARSON. 
       LTAR2. IF MS-GUN = 00 GO LTARQCV. 
           IF MS-GUN < V-GUN OR S-GUN > V-GUN GO LTAR1. 
           MOVE MS-GUN TO SNGUN. GO LTROM.
       LTARQCV. IF S-GUN NOT = V-GUN GO LTAR1. 
       LTROM. IF S-AY NOT = V-AY GO LTAR1. 
           IF S-YIL NOT = V-YIL GO LTAR1. 
           ADD 1 TO LIN. ADD 1 TO SIRAN.
           MOVE SIRAN TO SIRA1. MOVE S-NO TO SS-NO1. 
           MOVE B-ISMI TO BORCLU1.
           MOVE ADRES1 TO ADRESI1. MOVE V-YER TO VV-YER1. 
           MOVE AKIBET TO AAK1. MOVE TUTAR TO TUT1. ADD TUTAR TO S-TOP.
           IF LIN = 1 PERFORM LTARBAS.
           DISPLAY (LIN + 6 1) BASTAR2.
           IF LIN = 13 DISPLAY (LIN + 7 1) BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           DISPLAY (LIN + 8 1) SAYFA-SONUT 
           DISPLAY (LIN + 9 1) SAYFA-SONUB DISPLAY (LIN + 10 1) BOSLUK
           DISPLAY (24 1) "DIGER SAYFA DOKUMUNU ISTIYORMUSUNUZ (E/H):"
           ACCEPT (24 45) C IF C = "H" GO LS2 ELSE MOVE 0 TO LIN S-TOP.
           GO LTAR1.
       LTARSON. IF LIN > 0 DISPLAY (LIN + 7 1) BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           DISPLAY (LIN + 8 1) SAYFA-SONUT 
           DISPLAY (LIN + 9 1) SAYFA-SONUB DISPLAY (LIN + 10 1) BOSLUK. 
           DISPLAY (24 1) ERASE.
           DISPLAY (24 1) "ANA MENU ˜€˜N ENT BAS". ACCEPT C.
       LTARKKL. GO LS3.
       LTARBASY1. PERFORM LS6.
           DISPLAY (24 1) "YAZICI DOKUMU ISTIYORMUSUNUZ (E/H):".
           ACCEPT (24 45) C. IF C = "H" GO LS2. DISPLAY YAZIPQ.
           ACCEPT YAZIPQ ON ESCAPE GO LS2. GO ZAMAN2.            
       ZAMAN2. PERFORM LS2.
           MOVE 0 TO SIRAN S-NO YASR.
           START SENET KEY NOT LESS THAN S-NO INVALID KEY
           DISPLAY (24 1) "DOSYAYA START YAPILAMIYOR ENT" 
           ACCEPT C GO LS2. DISPLAY (24 1) ERASE.
           DISPLAY (24 25) "LšTFEN BEKLEY˜N˜Z".
           READ SENET NEXT AT END GO LS2. GO LTAR2Y.
       LTARBASY. MOVE S-GUN TO SS-GUN1. 
           MOVE S-AY TO SS-AY1. MOVE S-YIL TO SS-YIL1. 
           WRITE YAZ FROM BAS1 AFTER 8.
           WRITE YAZ FROM BS1. WRITE YAZ FROM BASTAR. 
           WRITE YAZ FROM BASTAR1. WRITE YAZ FROM BAS4.
       LTAR1Y. READ SENET NEXT AT END GO LTARSONY. 
       LTAR2Y. IF MS-GUN = 00 GO LTARQCVY. 
           IF MS-GUN < V-GUN OR S-GUN > V-GUN GO LTAR1Y.
           MOVE MS-GUN TO SNGUN. GO LTROMY.
       LTARQCVY. IF S-GUN NOT = V-GUN GO LTAR1Y.
       LTROMY. IF S-AY NOT = V-AY GO LTAR1Y. 
           IF S-YIL NOT = V-YIL GO LTAR1Y.
           ADD 1 TO YASR. ADD 1 TO SIRAN.
           MOVE SIRAN TO SIRA1. MOVE S-NO TO SS-NO1. 
           MOVE B-ISMI TO BORCLU1.
           MOVE ADRES1 TO ADRESI1. MOVE V-YER TO VV-YER1. 
           MOVE AKIBET TO AAK1. MOVE TUTAR TO TUT1. ADD TUTAR TO S-TOP.
           IF YASR = 1 PERFORM LTARBASY.
           WRITE YAZ FROM BASTAR2.
           IF YASR = 45 WRITE YAZ FROM BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           WRITE YAZ FROM SAYFA-SONUT WRITE YAZ FROM SAYFA-SONUB 
           WRITE YAZ FROM BOSLUK
           DISPLAY (24 1) ERASE
           DISPLAY (24 1) "DIGER SAYFA DOKUMUNU ISTIYORMUSUNUZ (E/H):"
           ACCEPT (24 45) C IF C = "H" GO LS2 ELSE MOVE 0 TO YASR S-TOP.
           GO LTAR1Y.
       LTARSONY. IF YASR > 0 WRITE YAZ FROM BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           WRITE YAZ FROM SAYFA-SONUT WRITE YAZ FROM SAYFA-SONUB 
           WRITE YAZ FROM BOSLUK. DISPLAY (24 1) ERASE (24 1) "ENT BAS". 
           ACCEPT C.
       LTARSSYQ. GO LS3.
       LS7. MOVE SPACES TO CR V-YER. DISPLAY E6. MOVE 0 TO SIRAN S-NO.
           DISPLAY (21 7) "ESC ˜LE €IKILIR". 
           ACCEPT E6 ON ESCAPE GO LS3.
       SKEAAS. START SENET KEY NOT LESS THAN S-NO INVALID KEY 
           DISPLAY (24 1) "DOSYAYA START YAPILAMIYOR"
           DISPLAY (24 33) "ENT BAS" ACCEPT C GO LS2.
           DISPLAY (24 1) ERASE. DISPLAY (24 25) "LšTFEN BEKLEY˜N˜Z".
		   READ SENET NEXT AT END GO LS2. GO LCRQ.
       LCRBAS. MOVE CR TO VV-YER2. DISPLAY (1 1) ERASE.
           DISPLAY (1 1) BAS1. DISPLAY (2 1) BS1. 
           DISPLAY (3 1) BASCIRO. DISPLAY (4 1) BASCIRO1. 
           DISPLAY (5 1) BAS4. 
       LCR1. READ SENET NEXT RECORD AT END GO LCRSON. 
       LCRQ. IF CR NOT = V-YER GO LCR1.
           ADD 1 TO LIN. ADD 1 TO SIRAN. MOVE SIRAN TO SIRA2.
           MOVE S-NO TO SS-NO2. MOVE V-GUN TO SS-GUN2. 
		   MOVE V-AY TO SS-AY2. MOVE V-YIL TO SS-YIL2. 
		   MOVE ADRES1 TO ADRESI2. 
           MOVE B-ISMI TO BORCLU2. MOVE AKIBET TO AAK2.
           MOVE TUTAR TO TUT2. ADD TUTAR TO S-TOP.
           IF LIN = 1 PERFORM LCRBAS.
           DISPLAY (LIN + 6 1) BASCIRO2. 
           IF LIN = 13 DISPLAY (LIN + 7 1) BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           DISPLAY (LIN + 8 1) SAYFA-SONUT 
           DISPLAY (LIN + 9 1) SAYFA-SONUB DISPLAY (LIN + 10 1) BOSLUK
           DISPLAY (24 1) "DIGER SAYFA DOKUMUNU ISTIYORMUSUNUZ (E/H):"
           ACCEPT (24 45) C IF C = "H" GO LS2 ELSE MOVE 0 TO LIN S-TOP.
           GO LCR1.
       LCRSON. IF LIN > 0 DISPLAY (LIN + 7 1) BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           DISPLAY (LIN + 8 1) SAYFA-SONUT 
           DISPLAY (LIN + 9 1) SAYFA-SONUB DISPLAY (LIN + 10 1) BOSLUK. 
           DISPLAY (24 1) ERASE.
           DISPLAY (24 1) "ANA MENU ˜€˜N ENT BAS". ACCEPT C.
       LCREESN. GO LS3.
       LCRBASY1. PERFORM LS7.
           DISPLAY (24 1) "YAZICI DOKUMU ISTIYORMUSUNUZ (E/H):".
           ACCEPT (24 45) C. IF C = "H" GO LS2. DISPLAY YAZIPQ.
           ACCEPT YAZIPQ ON ESCAPE GO LS2. GO ZAMAN3.
       ZAMAN3. PERFORM LS2.
           MOVE 0 TO SIRAN. MOVE 0 TO S-NO YASR.
           START SENET KEY NOT LESS THAN S-NO INVALID KEY 
           DISPLAY (24 1) ERASE (24 1) "DOSYAYA START YAPILAMIYOR ENT"
           ACCEPT C GO LS2. DISPLAY (24 1) ERASE.
           DISPLAY (24 25) "LšTFEN BEKLEY˜N˜Z".
           READ SENET NEXT AT END GO LS2. GO LCR2Y.
       LCRBASY.  WRITE YAZ FROM BAS1 AFTER 8.
           WRITE YAZ FROM BS1. MOVE CR TO VV-YER2.
           WRITE YAZ FROM BASCIRO. WRITE YAZ FROM BASCIRO1.
           WRITE YAZ FROM BAS4.
       LCR1Y. READ SENET NEXT AT END GO LCRSONY. 
       LCR2Y. IF CR NOT = V-YER GO LCR1Y. ADD 1 TO YASR.
           ADD 1 TO SIRAN. MOVE SIRAN TO SIRA2. MOVE B-ISMI TO BORCLU2.
           MOVE S-NO TO SS-NO2. MOVE V-GUN TO SS-GUN2. 
           MOVE V-AY TO SS-AY2. MOVE V-YIL TO SS-YIL2. 
           MOVE ADRES1 TO ADRESI2.
           MOVE AKIBET TO AAK2. MOVE TUTAR TO TUT2. ADD TUTAR TO S-TOP.
           IF YASR = 1 PERFORM LCRBASY.           
           WRITE YAZ FROM BASCIRO2. 
           IF YASR = 45 WRITE YAZ FROM BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           WRITE YAZ FROM SAYFA-SONUT WRITE YAZ FROM SAYFA-SONUB 
           WRITE YAZ FROM BOSLUK DISPLAY (24 1) ERASE 
           DISPLAY (24 1) "DIGER SAYFA DOKUMUNU ISTIYORMUSUNUZ (E/H):"
           ACCEPT (24 45) C IF C = "H" GO LS2 ELSE MOVE 0 TO YASR S-TOP.
           GO LCR1Y.
       LCRSONY. IF YASR > 0 WRITE YAZ FROM BAS4  MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           WRITE YAZ FROM SAYFA-SONUT WRITE YAZ FROM SAYFA-SONUB 
           WRITE YAZ FROM BOSLUK. DISPLAY (24 1) ERASE (24 1) "ENT BAS".
           ACCEPT C.
       LCRYYSNQ. GO LS3.
       LS8. MOVE 0 TO ILK-SNO SON-SNO S-NO SIRAN. DISPLAY EEA. 
           DISPLAY (21 7) "ESC ˜LE €IKIIR". MOVE ILK-SNO TO S-NO.
           ACCEPT EEA ON ESCAPE GO LS3.
       JLKFFDD. START SENET KEY NOT LESS THAN S-NO INVALID KEY 
           DISPLAY (24 1) ERASE (24 1) "DOSYAYA START YAPILAMIYOR ENT"
           ACCEPT C GO LS2. DISPLAY (24 1) ERASE.
           DISPLAY (24 25) "LšTFEN BEKLEY˜N˜Z".
           READ SENET NEXT AT END GO LS2. GO LSN2.
       LSNBAS. DISPLAY (1 1) ERASE. DISPLAY (1 1) BAS1.
           DISPLAY (2 1) BS1. DISPLAY (3 1) BAS6. DISPLAY (4 1) BAS4.
       LSN1. READ SENET NEXT AT END GO LSNSON. 
       LSN2. IF S-NO < ILK-SNO OR S-NO>SON-SNO GO LSN1.
           ADD 1 TO LIN. ADD 1 TO SIRAN. MOVE SIRAN TO SIRA4. 
           MOVE S-NO TO SS-NO4.
           MOVE V-GUN TO SS-GUN4. MOVE V-AY TO SS-AY4. 
           MOVE V-YIL TO SS-YIL4. MOVE ADRES1 TO ADRESI4. 
           MOVE V-YER TO VV-YER4. MOVE B-ISMI TO BORCLU4.
           MOVE TUTAR TO TUT4. MOVE AKIBET TO AAK4. ADD TUTAR TO S-TOP.
           IF LIN = 1 PERFORM LSNBAS.
           DISPLAY (LIN + 5 1) BAS7. 
           IF LIN = 13 DISPLAY (LIN + 6 1) BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           DISPLAY (LIN + 7 1) SAYFA-SONUT 
           DISPLAY (LIN + 8 1) SAYFA-SONUB DISPLAY (LIN + 9 1) BOSLUK
           DISPLAY (24 1) "DIGER SAYFA DOKUMUNU ISTIYORMUSUNUZ (E/H):"
           ACCEPT (24 45) C IF C = "H" GO LS2 ELSE MOVE 0 TO LIN  S-TOP. 
           GO LSN1.
       LSNSON. IF LIN > 0 DISPLAY (LIN + 6 1) BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP 
           DISPLAY (LIN + 7 1) SAYFA-SONUT 
           DISPLAY (LIN + 8 1) SAYFA-SONUB DISPLAY (LIN + 9 1) BOSLUK.
           DISPLAY (24 1) ERASE.
           DISPLAY (24 1) "ANA MENU ˜€˜N ENT BAS". ACCEPT C.
       LSNEEQ. GO LS3.
       LSENETNOY1. PERFORM LS8. 
           DISPLAY (24 1) "YAZICI DOKUMU ISTIYORMUSUNUZ (E/H):".
           ACCEPT (24 45) C. IF C = "H" GO LS2. DISPLAY YAZIPQ.
           ACCEPT YAZIPQ ON ESCAPE GO LS2. GO ZAMAN4.
       ZAMAN4. PERFORM LS2.
           MOVE 0 TO SIRAN. MOVE 0 TO S-NO YASR.
           START SENET KEY NOT LESS THAN S-NO INVALID KEY 
           DISPLAY (24 1) ERASE (24 1) "DOSYAYA START YAPILAMIYOR ENT"
           ACCEPT C GO LS2. DISPLAY (24 1) ERASE.
           DISPLAY (24 25) "LšTFEN BEKLEY˜N˜Z".
           READ SENET NEXT AT END GO LS2. GO LSN2Y.
       LSNBASY.  WRITE YAZ FROM BAS1 AFTER 8.
           WRITE YAZ FROM BS1. WRITE YAZ FROM BAS6. 
           WRITE YAZ FROM BAS4.
       LSN1Y. READ SENET NEXT AT END GO LSNSONY. 
       LSN2Y. IF S-NO < ILK-SNO OR S-NO>SON-SNO GO LSN1Y. 
           ADD 1 TO YASR. ADD 1 TO SIRAN. MOVE SIRAN TO SIRA4. 
           MOVE S-NO TO SS-NO4.
           MOVE V-GUN TO SS-GUN4. MOVE V-AY TO SS-AY4. 
           MOVE V-YIL TO SS-YIL4. MOVE ADRES1 TO ADRESI4. 
           MOVE V-YER TO VV-YER4. MOVE B-ISMI TO BORCLU4.
           MOVE TUTAR TO TUT4. MOVE AKIBET TO AAK4. ADD TUTAR TO S-TOP.
           IF YASR = 1 PERFORM LSNBASY.
           WRITE YAZ FROM BAS7. 
           IF YASR = 45 WRITE YAZ FROM BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           WRITE YAZ FROM SAYFA-SONUT WRITE YAZ FROM SAYFA-SONUB 
           WRITE YAZ FROM BOSLUK
           DISPLAY (24 1) ERASE
           DISPLAY (24 1) "DIGER SAYFA DOKUMUNU ISTIYORMUSUNUZ (E/H):"
           ACCEPT (24 45) C IF C = "H" GO LS2 ELSE MOVE 0 TO YASR S-TOP.
           GO LSN1Y.
       LSNSONY. IF YASR > 0 WRITE YAZ FROM BAS4  MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           WRITE YAZ FROM SAYFA-SONUT WRITE YAZ FROM SAYFA-SONUB 
           WRITE YAZ FROM BOSLUK. DISPLAY (24 1) ERASE (24 1) "ENT BAS".
           ACCEPT C.
       LSNYYYQQ. GO LS3.
       LS9. MOVE SPACE TO N. MOVE 0 TO S-NO SIRAN.
           DISPLAY E8. ACCEPT E8 ON ESCAPE GO LS3.
       PWEEFDF. START SENET KEY NOT LESS THAN S-NO INVALID KEY 
           DISPLAY (24 1) "DOSYAYA START YAPILAMIYOR"
           DISPLAY (24 33) "ENT BAS" ACCEPT C GO LS2.
           DISPLAY (24 1) ERASE. DISPLAY (24 25) "LšTFEN BEKLEY˜N˜Z".
		   READ SENET NEXT AT END GO LS2. GO LAKQ.
       LAKBAS. MOVE N TO AAK3. DISPLAY (1 1) ERASE.
           DISPLAY (1 1) BAS1. DISPLAY (2 1) BS1. 
           DISPLAY (3 1) BASAK. DISPLAY (4 1) BAS2. 
           DISPLAY (5 1) BAS4. 
       LAK1. READ SENET NEXT RECORD AT END GO LAKSON. 
       LAKQ. IF N NOT = AKIBET GO LAK1.
           ADD 1 TO LIN. ADD 1 TO SIRAN. MOVE SIRAN TO SIRA3.
           MOVE S-NO TO SS-NO3.
           MOVE V-GUN TO SS-GUN3. MOVE V-AY TO SS-AY3. 
           MOVE V-YIL TO SS-YIL3. MOVE ADRES1 TO ADRESI3. 
           MOVE V-YER TO VV-YER3. MOVE B-ISMI TO BORCLU3.
           MOVE TUTAR TO TUT3. ADD TUTAR TO S-TOP.
           IF LIN = 1 PERFORM LAKBAS. 
           DISPLAY (LIN + 6 1) BAS3. 
           IF LIN = 13 DISPLAY (LIN + 7 1) BAS4  MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           DISPLAY (LIN + 8 1) SAYFA-SONUT
           DISPLAY (LIN + 9 1) SAYFA-SONUB DISPLAY (LIN + 10 1) BOSLUK
           DISPLAY (24 1) "DIGER SAYFA DOKUMUNU ISTIYORMUSUNUZ (E/H):"
           ACCEPT (24 45) C IF C = "H" GO LS2 ELSE MOVE 0 TO LIN S-TOP.
           GO LAK1.
       LAKSON. IF LIN > 0 DISPLAY (LIN + 7 1) BAS4  MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           DISPLAY (LIN + 8 1) SAYFA-SONUT 
           DISPLAY (LIN + 9 1) SAYFA-SONUB DISPLAY (LIN + 10 1) BOSLUK.
           DISPLAY (24 1) ERASE. 
           DISPLAY (24 1) "ANA MENU ˜€˜N ENT BAS". ACCEPT C.
       LAKEEQQ1. GO LS3.
       LAKY1. PERFORM LS9.
           DISPLAY (24 1) "YAZICI DOKUMU ISTIYORMUSUNUZ (E/H):".
           ACCEPT (24 45) C. IF C = "H" GO LS2. DISPLAY YAZIPQ.
           ACCEPT YAZIPQ ON ESCAPE GO LS2. GO ZAMAN5.
       ZAMAN5. PERFORM LS2.
           MOVE 0 TO SIRAN. MOVE 0 TO S-NO.
           START SENET KEY NOT LESS THAN S-NO INVALID KEY 
           DISPLAY (24 1) ERASE (24 1) "DOSYAYA START YAPILAMIYOR ENT"
           ACCEPT C GO LS2. DISPLAY (24 1) ERASE.
           DISPLAY (24 25) "LšTFEN BEKLEY˜N˜Z".
           READ SENET NEXT AT END GO LS2. GO LAK2Y.
       LAKBASY.  WRITE YAZ FROM BAS1 AFTER 8.
           WRITE YAZ FROM BS1. MOVE N TO AAK3.
           WRITE YAZ FROM BASAK. WRITE YAZ FROM BAS2. 
           WRITE YAZ FROM BAS4.
       LAK1Y. READ SENET NEXT AT END GO LAKSONY. 
       LAK2Y. IF N NOT = AKIBET GO LAK1Y. ADD 1 TO YASR.
           ADD 1 TO SIRAN. MOVE SIRAN TO SIRA3. 
           MOVE S-NO TO SS-NO3.
           MOVE V-GUN TO SS-GUN3. MOVE V-AY TO SS-AY3. 
           MOVE V-YIL TO SS-YIL3. MOVE ADRES1 TO ADRESI3. 
           MOVE V-YER TO VV-YER3. MOVE B-ISMI TO BORCLU3.
           MOVE TUTAR TO TUT3. ADD TUTAR TO S-TOP.
           IF YASR = 1 PERFORM LAKBASY.
           WRITE YAZ FROM BAS3. 
           IF YASR = 45 WRITE YAZ FROM BAS4  MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           WRITE YAZ FROM SAYFA-SONUT
           WRITE YAZ FROM SAYFA-SONUB WRITE YAZ FROM BOSLUK
           DISPLAY (24 1) ERASE
           DISPLAY (24 1) "DIGER SAYFA DOKUMUNU ISTIYORMUSUNUZ (E/H):"
           ACCEPT (24 45) C IF C = "H" GO LS2 ELSE MOVE 0 TO YASR S-TOP.
           GO LAK1Y.
       LAKSONY. IF YASR > 0 WRITE YAZ FROM BAS4 MOVE S-TOP TO SS-TOP
           ADD S-TOP TO G-TOP MOVE G-TOP TO GG-TOP
           WRITE YAZ FROM SAYFA-SONUT WRITE YAZ FROM SAYFA-SONUB
           WRITE YAZ FROM BOSLUK. DISPLAY (24 1) ERASE (24 1) "ENT BAS".
           ACCEPT C.
       LAKYYQQ1. GO LS3.
       L-SON. CLOSE SENET YAZICI.       
       SSSON SECTION. 
       SSSS. DISPLAY (1 1) ERASE. STOP RUN.
