       IDENTIFICATION  DIVISION.
       PROGRAM-ID. KASET.
	   AUTHOR. MEHMET HARAS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT KASET ASSIGN TO DISK ORGANIZATION INDEXED
		   ACCESS DYNAMIC
		   RECORD KEY K-NO.
           SELECT YAZICI ASSIGN TO PRINTER.
       DATA DIVISION.
       FILE SECTION.
       FD KASET LABEL RECORD STANDARD VALUE OF FILE-ID "KASET.DOS".
       01 KAYIT.
           05 K-NO PIC 9(5).
           05 K-ADI PIC X(15).
           05 ALIS-T PIC X(10).
           05 IADE-T PIC X(10). 
           05 TURU PIC X(10).
           05 UCRETI PIC 9(6).
       FD YAZICI LABEL RECORD OMITTED.
       01 CIKTI-SATIRI PIC X(80).
       WORKING-STORAGE SECTION.
       77 SIFRE PIC X(10) VALUE SPACE.
       77 CEVAP PIC X VALUE SPACE.
       77 KONTROL PIC 99 VALUE 0.
       77 SEC PIC 9 VALUE 0.
       77 KIT PIC X(15) VALUE SPACE.
       77 YAZ PIC X(20) VALUE SPACE.
       77 CIZGI PIC X(80) VALUE ALL "~".
       77 N PIC 99 VALUE 0.
	   77 BOSLUK PIC X(80) VALUE SPACE.  
       77 SEN PIC 9(5) VALUE 0.
       77 GUL PIC 9(5) VALUE 0.
       77 TOPLAM PIC S9(9) VALUE 0.
	   77 SAYFA-NO PIC 99 VALUE 0.
       01 BASLIK.
           02 F PIC X(29) VALUE SPACE.
           02 F PIC X(22) VALUE "KASET BILGILERI DOKUMU".
		   02 F PIC X(80) VALUE SPACE.
       01 BASLIK-2.
           02 F PIC X(29) VALUE SPACE.
           02 F PIC X(22) VALUE ALL "~".
           02 F PIC X(15) VALUE SPACE.
           02 F PIC X(10) VALUE "SAYFA NO:".
           02 D-SAYFA PIC 99. 
           02 F PIC X(80) VALUE ALL " ".	   
	   01 BASLIK-1.
           02 F PIC X(1) VALUE SPACE.
           02 F PIC X(5) VALUE "SIRA".
           02 F PIC X(9) VALUE "KASET NO".
           02 F PIC X(17) VALUE "KASET ADI".
           02 F PIC X(12) VALUE "ALIS T".
           02 F PIC X(16) VALUE "IADE T".
           02 F PIC X(12) VALUE "TURU".
           02 F PIC X(10) VALUE "UCRETI".
       01 DETAY.
           02 F PIC X(2) VALUE SPACES.
           02 S-NO PIC 99.
           02 F PIC X(2) VALUE SPACES.
           02 KNO PIC 9(5).
           02 F PIC X(4) VALUE SPACE.
           02 KADI PIC X(15).
           02 F PIC X(2) VALUE SPACE.
           02 ALIST PIC X(10).
           02 F PIC X(2) VALUE SPACE.
           02 IADET PIC 9(10).
           02 F PIC X(6) VALUE SPACE.		   
           02 TUR PIC X(10).
           02 F PIC X VALUE SPACE.
           02 UCRET PIC ZZZ,ZZ9.
       01 DETAY-1.
           02 F PIC X(58) VALUE SPACE.	     
	       02 F PIC X(7) VALUE "TOPLAM=".
           02 D-TOPLAM PIC Z,ZZZ,ZZZ,ZZ9.
       SCREEN SECTION.
       01 EKRAN-1.
           02 BLANK SCREEN.
           02 LINE 10 COLUMN 10 PIC X(28) FROM ALL "~".
           02 LINE 11 COLUMN 10 VALUE "SIFREYI GIRINIZ:".
           02 LINE 11 COLUMN 26 PIC X(10) USING SIFRE.
           02 LINE 12 COLUMN 10 PIC X(28) FROM ALL "~".
       01 EKRAN-2.
           02 BLANK SCREEN.
           02 LINE 1 COLUMN 1 BLINK VALUE "BEBIM A.S.".
           02 LINE 2 COLUMN 1 PIC X(12) FROM ALL "~".
           02 LINE 4 COLUMN 30 BLINK VALUE "UYARI".
           02 LINE 5 COLUMN 5 PIC X(75) FROM ALL "~".
           02 LINE 6 COLUMN 5 VALUE "1 NOLU SECENEK DOSYA YARATIR VE DOS
      -    "YADAKI BILGILER SILINIR".
           02 LINE 7 COLUMN 5 VALUE "2 NOLU SECENEK BILGI GIRISI ISTER *
      -    "3 NOLU SECENEK KAYIT DEGISTIRIR ".
           02 LINE 8 COLUMN 5 VALUE "4 NOLU SECENEK ISTENEN KAYDI SILER 
      -    "*5 NOLU SECENEK EKRAN DOKUMUNU GOSTERIR".
           02 LINE 9 COLUMN 5 VALUE 
           "6 NOLU SECENEK YAZICI DOKUMUNU VERIR  *7 NOLU SECENEK PROGRA
      -    "MDAN CIKAR".  
           02 LINE 10 COLUMN 5 PIC X(70) FROM ALL "~".
           02 LINE 11 COLUMN 10 BLINK VALUE "ANA MENU".
           02 LINE 12 COLUMN 5 PIC X(42) FROM ALL "~".
           02 LINE 13 COLUMN 5 VALUE 
		   "*         [1]:DOSYA YARATMA              *".
           02 LINE 14 COLUMN 5 VALUE 
		   "*         [2]:BILGI GIRISI               *".
           02 LINE 15 COLUMN 5 VALUE 
		   "*         [3]:BILGILERDE DEGISIKLIK      *".
           02 LINE 16 COLUMN 5 VALUE 
		   "*         [4]:KAYIT SILME                *".
           02 LINE 17 COLUMN 5 VALUE 
		   "*         [5]:EKRAN DOKUMU               *".
           02 LINE 18 COLUMN 5 VALUE 
		   "*         [6]:YAZICI DOKUMU              *".
           02 LINE 19 COLUMN 5 VALUE 
		   "*         [7]:PROGRAMDAN CIKIS           *".
           02 LINE 20 COLUMN 5 PIC X(42) FROM ALL "~".
           02 LINE 21 COLUMN 5 VALUE 
		   "*         SECIMINIZ...:                  *".
           02 LINE 21 COLUMN 35 PIC 9 USING SEC.
       01 SENI.
           03 LINE 7 COLUMN 10 VALUE "KASETIN NOSU    :".
           03 LINE 7 COLUMN 25 PIC 9(5) USING GUL.        
       01 EKRAN-3.
           03 BLANK SCREEN.
           03 LINE 1 COLUMN 1 BLINK VALUE "BEBIM A.S.". 
           03 LINE 2 COLUMN 1 PIC X(10) FROM ALL "~".
           03 LINE 6 COLUMN 10 PIC X(40) FROM ALL "~".
           03 LINE 8 COLUMN 10 VALUE "KASETIN ADI.....:".
           03 LINE 9 COLUMN 10 VALUE "ALIS TARIHI.....:".
           03 LINE 10 COLUMN 10 VALUE "IADE TARIHI....:".
           03 LINE 11 COLUMN 10 VALUE "KASETIN TURU...:".
           03 LINE 12 COLUMN 10 VALUE "KASETIN UCRETI.:".
           03 LINE 13 COLUMN 10 PIC X(40) FROM ALL "~".
           03 LINE 8 COLUMN 25 PIC X(15) USING K-ADI.
           03 LINE 9 COLUMN 25 PIC X(10) USING ALIS-T.
           03 LINE 10 COLUMN 25 PIC X(10) USING IADE-T.
           03 LINE 11 COLUMN 25 PIC X(10) USING TURU.
           03 LINE 12 COLUMN 25 PIC 9(6) USING UCRETI.
       PROCEDURE DIVISION.
       BASLA. DISPLAY (1 1) ERASE.
           DISPLAY EKRAN-1.
           ACCEPT(11 26) SIFRE WITH NO-ECHO.
           IF SIFRE NOT = "BEBIM A.S."
           DISPLAY (1 1) ERASE STOP RUN.
           DISPLAY EKRAN-2.
       BB. ACCEPT EKRAN-2.
           IF SEC = 1 PERFORM YARAT
           ELSE IF SEC = 2 PERFORM GIRIS
           ELSE IF SEC = 3 PERFORM DEGISIKLIK
           ELSE IF SEC = 4 PERFORM SILME
           ELSE IF SEC = 5 PERFORM E-DOKUM
           ELSE IF SEC = 6 PERFORM Y-DOKUM
           ELSE IF SEC = 7 PERFORM SON ELSE
           DISPLAY (23 5) SEC (23 6) ". NOLU SECENEK YANLIS" GO BB.
           DISPLAY EKRAN-2. DISPLAY (23 5) SEC (23 6) 
           ". NOLU ISLEM TAMAMLANMISTIR. ". GO BB.
       YARAT SECTION.
       YY. OPEN OUTPUT KASET CLOSE KASET.
       GIRIS SECTION.
       GG1. OPEN I-O KASET.
       GG2. MOVE 0 TO GUL.
            MOVE 0 TO K-NO.
           DISPLAY (1 1) ERASE.
		   DISPLAY SENI ACCEPT (7 25) GUL. 
       GG3. READ KASET NEXT AT END GO NIL. 
           IF GUL = K-NO GO GG2 ELSE GO GG3.
       NIL. MOVE GUL TO K-NO.
	       DISPLAY EKRAN-3.
           DISPLAY (5 10) "KASET BILGILERI GIRISI" 
		   MOVE ALL "." TO K-ADI ALIS-T IADE-T TURU.
		   MOVE 0 TO UCRETI.
       BIL. ACCEPT EKRAN-3. 
           DISPLAY (23 1) ERASE (23 5)
           "VERILER DOGRUMU (E/H):". 
		   ACCEPT (23 27) CEVAP WITH PROMPT UPDATE. 
		   IF CEVAP = "H" GO BIL.
           WRITE KAYIT. 
		   DISPLAY (23 1) ERASE (23 5)
            "GIRISE DEVAM EDIYORMUSUNUZ (E/H):".
           ACCEPT (23 45) CEVAP. IF CEVAP = "E" GO GG2. 
		   CLOSE KASET.
       DEGISIKLIK SECTION.
       DD1. OPEN I-O KASET.
           DISPLAY (1 1) ERASE. MOVE 0 TO SEN.
           DISPLAY (5 5) "DEGISIKLIK YAPILACAK KAYDIN NOSU:".
           ACCEPT (5 38) SEN WITH PROMPT UPDATE.
       DD2. READ KASET NEXT AT END GO UYARI.		  
           IF SEN NOT = K-NO GO DD2.
           DISPLAY SENI. DISPLAY EKRAN-3.
           DISPLAY (4 5) " BILGILERDE DEGISIKLIK". 
             DISPLAY (23 1) ERASE (23 5)
            "DEGISTIRMEK ISTEDIGINIZ KASET BU MU:".
           ACCEPT CEVAP. IF CEVAP = "H" GO EVP.
       DD3. ACCEPT SENI. ACCEPT EKRAN-3. 
            DISPLAY (23 1) ERASE (23 5) 
            "DOGRU MU (E / H)". ACCEPT CEVAP.
           IF CEVAP = "H" GO DD3.
           REWRITE KAYIT. 
	   EVP. DISPLAY (23 5) ERASE (23 5) 
             "DEVAM MI (E/H):" ACCEPT CEVAP 
		      IF CEVAP = "E" CLOSE KASET GO DD1 ELSE GO D-SON.
       UYARI. DISPLAY (23 1) ERASE (23 5)
            "ARADIGINIZ KASET DOSYADA YOK ENT BAS:" ACCEPT CEVAP.
           GO EVP.
       D-SON. CLOSE KASET.
	   SILME SECTION.
       D-10. OPEN I-O KASET.
       D-20. MOVE 0 TO K-NO. 
           DISPLAY (1 1) ERASE.	   
           DISPLAY (5 5) "SILMEK ISTEDIGINIZ KAYDIN NOSUNU GIRINIZ:".
           DISPLAY (21 5) "KAYIT NO = 0 ANA MENUYA DONULUR".
           ACCEPT (5 47) K-NO. IF K-NO = 0 GO D-SON.
           READ KASET INVALID KEY DISPLAY (21 1) ERASE (21 5) 
              "BU KAYIT DOSYADA YOK ENT BAS" ACCEPT CEVAP GO D-20.
           DISPLAY (4 5) "HERHANGI BIR KAYDIN SILINMESI"
		   DISPLAY EKRAN-3. DISPLAY (4 5) 
             "HERHANGI BIR KAYDIN SILINMESI".
           DISPLAY (20 1) "SILMEK ISTEDIGINIZ KAYIT BUMU" 
		   ACCEPT (20 50) CEVAP. IF CEVAP = "H" GO D-99.
           DELETE KASET INVALID KEY DISPLAY (20 1) ERASE (20 1)
             "SILEMIYORUM DISKET BOZUK ENT BAS" ACCEPT CEVAP.
       D-99. DISPLAY (20 1) ERASE (20 10) "DEVAMMI (E/H):".
           ACCEPT (20 30) CEVAP. IF CEVAP = "E" GO D-20.       			 
       D-SON. CLOSE KASET.       
       E-DOKUM SECTION.
       EE1. OPEN I-O KASET.
           MOVE 0 TO TOPLAM KONTROL. 
		   MOVE 0 TO D-SAYFA.
       EE. READ KASET NEXT AT END GO YOK.
       E. ADD 1 TO D-SAYFA. 
	       DISPLAY (1 1) ERASE. DISPLAY (1 1) BASLIK. 
           DISPLAY (2 1) BASLIK-2. DISPLAY (3 1) BASLIK-1. 
		   DISPLAY (4 1) CIZGI.
           MOVE 3 TO LIN.
       EE3. MOVE K-NO TO KNO. MOVE K-ADI TO KADI.
           MOVE ALIS-T TO ALIST. MOVE IADE-T TO IADET.
           MOVE TURU TO TUR. 
		   MOVE UCRETI TO UCRET.
           ADD 1 TO KONTROL. MOVE KONTROL TO S-NO.
           COMPUTE TOPLAM = TOPLAM + UCRETI
              MOVE TOPLAM TO D-TOPLAM.
              DISPLAY (23 1) CIZGI DISPLAY (24 1) DETAY-1.
           ADD 1 TO LIN. DISPLAY (LIN + 1 1) DETAY.
       E1. READ KASET NEXT AT END GO SSN.		    
	       IF LIN > 19  
            DISPLAY (24 5) "DEVAMMI (E/H):" ACCEPT (24 25) CEVAP  
		    IF CEVAP = "E" PERFORM E ELSE GO E-SON.
           GO EE3.
	   YOK. DISPLAY (24 5) "DOSYADA HIC KAYIT YOK" ACCEPT CEVAP. 
           GO E-SON.      
       SSN. DISPLAY (24 5) 
           "DOKUM BITTI ANA MENU ICIN ENT BAS:"  ACCEPT CEVAP. 
       E-SON. CLOSE KASET.
       Y-DOKUM SECTION.
       YY1. OPEN INPUT KASET. OPEN OUTPUT YAZICI.
           DISPLAY (1 1) ERASE.
           MOVE 0 TO KONTROL. MOVE 0 TO TOPLAM D-TOPLAM.
		   MOVE 0 TO SAYFA-NO D-SAYFA.
           MOVE 0 TO N. 
       YY2. READ KASET NEXT AT END GO UYAR.
       YY. MOVE 0 TO KONTROL. ADD 1 TO D-SAYFA.
	       WRITE CIKTI-SATIRI FROM BASLIK AFTER 7.
           WRITE CIKTI-SATIRI FROM BASLIK-2.
           WRITE CIKTI-SATIRI FROM BOSLUK.
           WRITE CIKTI-SATIRI FROM BASLIK-1.
           WRITE CIKTI-SATIRI FROM CIZGI.
       YY3. ADD 1 TO KONTROL. ADD 1 TO N. MOVE N TO S-NO.
           MOVE K-NO TO KNO. MOVE K-ADI TO KADI.
           MOVE ALIS-T TO ALIST. MOVE IADE-T TO IADET.
           MOVE TURU TO TUR. MOVE UCRETI TO UCRET.
           WRITE CIKTI-SATIRI FROM DETAY.
           COMPUTE TOPLAM = TOPLAM + UCRETI
              MOVE TOPLAM TO D-TOPLAM.
           IF KONTROL > 44 WRITE CIKTI-SATIRI FROM BOSLUK
		   WRITE CIKTI-SATIRI FROM CIZGI
           WRITE CIKTI-SATIRI FROM DETAY-1
		   WRITE CIKTI-SATIRI FROM BOSLUK
           DISPLAY(22 5) "DIGER SAYFA ICIN ENT BAS"
		   ACCEPT CEVAP PERFORM YY. 
		   READ KASET NEXT AT END
		   WRITE CIKTI-SATIRI FROM BOSLUK 
		   WRITE CIKTI-SATIRI FROM CIZGI
		   WRITE CIKTI-SATIRI FROM DETAY-1 
		   WRITE CIKTI-SATIRI FROM BOSLUK  GO Y-SON.
           GO YY3.
       UYAR. DISPLAY (23 5) "DOSYADA HIC KAYIT YOK ENT BAS:"
           ACCEPT CEVAP.
       Y-SON. CLOSE KASET YAZICI.
	   SON SECTION.
	   SSS. EXIT PROGRAM.
