       IDENTIFICATION DIVISION.
       PROGRAM-ID. SIPARIS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STOK1 ASSIGN DISK ORGANIZATION INDEXED
            ACCESS DYNAMIC RECORD KEY STKNO.
           SELECT YAZICI ASSIGN PRINTER.
       DATA DIVISION.
       FILE SECTION.
       FD STOK1 LABEL RECORD STANDARD VALUE OF FILE-ID "B:STOK1.DOS".
       01 STOK-KAYDI.
           05 STKNO PIC X(7).
           05 MALIN-ISMI PIC X(20).
           05 MIN-MIKTAR PIC 9(4).
           05 MEVCUT PIC 9(4).
           05 MAX-MIKTAR PIC 9(4).
           05 BIRIM-MALIYET PIC 9(7).
           05 SATIS-FIATI PIC 9(7).
           05 KDV-ORANI PIC 9V99.
       FD YAZICI LABEL RECORD OMITTED.
       01 CIKTI-SATIRI PIC X(80).
       WORKING-STORAGE SECTION.
       77 DD PIC X VALUE SPACE.
       77 CEVAP PIC X VALUE SPACE.
       77 F-GENEL PIC 9(9) VALUE 0.
       77 G-MIK PIC 9(6) VALUE 0.
       77 S PIC 9 VALUE 0.
       77 SIP-MIKTAR PIC 9(4) VALUE 0.
       77 S-MIK PIC 9(5) VALUE 0.
       77 SIP-TUTAR PIC 9(7) VALUE 0.
       77 N PIC 99 VALUE 0.
       77 SAYFA-1 PIC 99 VALUE 0.
       77 BOSLUK PIC X VALUE SPACE.
       77 F-TUTARI PIC 9(8) VALUE 0.
       01 BAS-1. 05 F PIC X(30) VALUE SPACES.
           05 F PIC X(22) VALUE "SIPARIS LISTESI".
           05 F PIC X(10) VALUE "SAYFA NO:".
           05 SAYFA-NO PIC Z9.
       01 BAS-2. 05 F PIC X(10) VALUE SPACES.
           05 F PIC X(6) VALUE "SIRA".
           05 F PIC X(9) VALUE "STOK NO".
           05 F PIC X(22) VALUE "MALIN ISMI".
           05 F PIC X(6) VALUE "SP.MK".
           05 F PIC X(11) VALUE "SPRS.TUTARI".
       01 BAS-3. 05 F PIC X(30) VALUE SPACES.
           05 F PIC X(15) VALUE ALL "-".
       01 BAS-4. 05 F PIC X(10) VALUE SPACES.
           05 F PIC X(54) VALUE ALL "-".
       01 BAS-5. 05 F PIC X(31) VALUE SPACES.
           05 F PIC X(15) VALUE "SAYFA TOPLAMI:".
           05 S-MIKTARI PIC ZZZZ9B.
           05 S-TUTARI PIC ZZ,ZZZ,ZZ9.
           05 F PIC XX VALUE ".-".
       01 BAS-6. 05 F PIC X(31) VALUE SPACES.
           05 F PIC X(15) VALUE "GENEL TOPLAM:".
           05 G-MIKTAR PIC ZZZZ9.
           05 G-TUTAR PIC ZZZ,ZZZ,ZZ9.
           05 F PIC XX VALUE ".-".
       01 BAS-7. 05 F PIC X(10) VALUE SPACES.
           05 S-NO PIC 9(4).
           05 F PIC XX VALUE SPACES.
           05 ST-NO PIC X(7)BB.
           05 MAL-ISMI PIC X(20)BB.
           05 SIP-MIKTARI PIC ZZZ9BB.
           05 SIP-TUTARI PIC Z,ZZZ,ZZ9.
           05 F PIC XX VALUE ".-".
       SCREEN SECTION.
       01 EKRAN. 05 BLANK SCREEN.
           05 LINE 08 COLUMN 01 REVERSE-VIDEO VALUE "BEBIM A.S.".
           05 LINE 09 COLUMN 01 
		      REVERSE-VIDEO VALUE "SIPARIS PROGRAMI".
           05 LINE 10 COLUMN 01 REVERSE-VIDEO VALUE "----------------".
           05 LINE 13 COLUMN 10 PIC X(18) FROM ALL "=".
           05 LINE 14 COLUMN 10 VALUE "[1]: YAZICI DOKUMU".
           05 LINE 15 COLUMN 10 VALUE "[2]: EKRAN DOKUMU".
           05 LINE 17 COLUMN 10 VALUE "[3]: SON".
           05 LINE 18 COLUMN 10 PIC X(18) FROM ALL "=".
           05 LINE 19 COLUMN 10 VALUE "SECIMINIZ:".
           05 LINE 19 COLUMN 20 PIC 9 USING S.
       PROCEDURE DIVISION.
       BASLA. DISPLAY (1 1) ERASE. DISPLAY EKRAN.
       A12. ACCEPT EKRAN. IF S = 1 PERFORM SIPARIS-YAZICI
           ELSE IF S = 2 PERFORM SIPARIS-EKRAN
           ELSE IF S = 3 GO SON ELSE DISPLAY (20 10) S (20 12)
           " NO.LU SECENEK YANLIS" GO A12.
           DISPLAY EKRAN. DISPLAY (20 10) S (20 12)
           " NO.LU ISLEM TAMAMLANMISTIR". GO A12.
       SIPARIS-YAZICI SECTION.
       CC0. OPEN INPUT STOK1 OUTPUT YAZICI. 
       CC1. READ STOK1 NEXT AT END DISPLAY (23 1) 
           "SIPARISI VERILECEK HIC KAYIT YOK <ENT> BAS" ACCEPT CEVAP
           GO SIPARIS-SON.
           IF MEVCUT NOT < MIN-MIKTAR GO CC1. MOVE "H" TO DD.
           MOVE ALL ZEROS TO SAYFA-1 S-NO G-MIK F-GENEL.
           DISPLAY (5 10) "сс SIPARIS LISTESI DOKUMU ALINIYOR сс"
           DISPLAY (7 10) "PRINTERI AYARLAYIP <ENT> BAS:" ACCEPT CEVAP.
           MOVE "E" TO CEVAP. PERFORM CC3.
           PERFORM CC2 THRU CC20 UNTIL DD = "E". GO SIPARIS-SON.
       CC2. IF MEVCUT NOT < MIN-MIKTAR GO CC20.
           SUBTRACT MEVCUT FROM MAX-MIKTAR GIVING SIP-MIKTAR.
           MULTIPLY SIP-MIKTAR BY BIRIM-MALIYET GIVING SIP-TUTAR.
           ADD SIP-MIKTAR TO S-MIK. ADD SIP-TUTAR TO F-TUTARI.
           MOVE STKNO TO ST-NO. MOVE MALIN-ISMI TO MAL-ISMI.
           MOVE SIP-TUTAR TO SIP-TUTARI. ADD 1 TO S-NO.
           MOVE SIP-MIKTAR TO SIP-MIKTARI.
           WRITE CIKTI-SATIRI FROM BAS-7 AFTER 1. ADD 1 TO N.
           IF N < 50 GO CC20. PERFORM CC4. IF DD = "H" PERFORM CC3.
       CC20. READ STOK1 NEXT RECORD AT END MOVE "E" TO DD.
       CC3. ADD 1 TO SAYFA-1. MOVE SAYFA-1 TO SAYFA-NO.
           WRITE CIKTI-SATIRI FROM BAS-1 AFTER 5.
           WRITE CIKTI-SATIRI FROM BAS-3 AFTER 1.
           WRITE CIKTI-SATIRI FROM BAS-2 AFTER 2.
           WRITE CIKTI-SATIRI FROM BAS-4 AFTER 1.
           MOVE 0 TO N S-MIK F-TUTARI.
       CC4. ADD S-MIK TO G-MIK. ADD F-TUTARI TO F-GENEL.
           MOVE S-MIK TO S-MIKTARI. MOVE F-TUTARI TO S-TUTARI.
           MOVE G-MIK TO G-MIKTAR. MOVE F-GENEL TO G-TUTAR.
           WRITE CIKTI-SATIRI FROM BAS-4 AFTER 1.
           WRITE CIKTI-SATIRI FROM BAS-5 AFTER 1.
           WRITE CIKTI-SATIRI FROM BAS-6 AFTER 1.
           IF DD = "H" WRITE CIKTI-SATIRI FROM BOSLUK AFTER 4
           DISPLAY (23 1)
           "BIR SONRAKI SAYFANIN DOKUMUNU ISTIYOR MUSUNUZ:" 
           ACCEPT (23 44) CEVAP IF CEVAP = "H" MOVE "E" TO DD.
       SIPARIS-SON. IF CEVAP = "E" PERFORM CC4.
           WRITE CIKTI-SATIRI FROM BOSLUK AFTER 1. CLOSE STOK1 YAZICI.
       SIPARIS-EKRAN SECTION.
       EE. PERFORM EE1. PERFORM EE2 THRU EE20 UNTIL DD = "E".
           GO SPRS-SON. 
       EE1. OPEN INPUT STOK1.
            DISPLAY (1 1) ERASE. MOVE "H" TO DD.
            MOVE ALL ZEROS TO SAYFA-1 SAYFA-NO S-NO G-MIK F-GENEL.
            MOVE "H" TO CEVAP. 
	        READ STOK1 NEXT RECORD AT END MOVE "E" TO DD.
            IF DD = "H" PERFORM EE3.
       EE2. IF MEVCUT NOT < MIN-MIKTAR GO EE20.
           SUBTRACT MEVCUT FROM MAX-MIKTAR GIVING SIP-MIKTAR.
           MULTIPLY SIP-MIKTAR BY BIRIM-MALIYET GIVING SIP-TUTAR.
           ADD SIP-MIKTAR TO S-MIK. ADD SIP-TUTAR TO F-TUTARI.
           MOVE STKNO TO ST-NO. MOVE MALIN-ISMI TO MAL-ISMI.
           MOVE SIP-TUTAR TO SIP-TUTARI. ADD 1 TO S-NO.
           MOVE SIP-MIKTAR TO SIP-MIKTARI.
           DISPLAY (LIN + 5 1) BAS-7 ADD 1 TO LIN.
           IF LIN < 15 GO EE20. PERFORM EE4. IF DD = "H" PERFORM EE3.
       EE20. READ STOK1 NEXT RECORD AT END MOVE "E" TO DD.
       EE3. ADD 1 TO SAYFA-1. MOVE SAYFA-1 TO SAYFA-NO.
           DISPLAY (1 1) ERASE.
		   DISPLAY (1 1) BAS-1. DISPLAY (2 1) BAS-3.
           DISPLAY (3 1) BAS-2. DISPLAY (4 1) BAS-4. MOVE "E" TO CEVAP.
           MOVE 0 TO S-MIK F-TUTARI LIN.
       EE4. ADD S-MIK TO G-MIK. ADD F-TUTARI TO F-GENEL.
           MOVE S-MIK TO S-MIKTARI. MOVE F-TUTARI TO S-TUTARI.
           MOVE G-MIK TO G-MIKTAR. MOVE F-GENEL TO G-TUTAR.
           DISPLAY (LIN + 5 1) BAS-4. DISPLAY (LIN + 6 1) BAS-5.
           DISPLAY (LIN + 7 1) BAS-6. IF DD = "H" DISPLAY (24 1)
           "BIR SONRAKI SAYFANIN DOKUMUNU ISTIYOR MUSUNUZ" ACCEPT CEVAP
           IF CEVAP = "H" MOVE "E" TO DD.
       SPRS-SON. IF CEVAP = "E" PERFORM EE4. DISPLAY (24 1) ERASE (24 1)
           "ANA MENU ICIN <ENT> BAS:" ACCEPT CEVAP. CLOSE STOK1.
       SON SECTION.
       BITTI. EXIT PROGRAM.
