       IDENTIFICATION DIVISION.
       PROGRAM-ID. STOK.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STOK ASSIGN TO DISK ORGANIZATION INDEXED
                ACCESS DYNAMIC  RECORD KEY S-STOKNO
                FILE STATUS DURUM.
              SELECT YAZICI ASSIGN TO PRINTER.
       DATA DIVISION.
       FILE SECTION.
       FD STOK LABEL RECORD STANDARD VALUE OF FILE-ID "STOK.DAT".
       01 STOK-KAYDI.
           02 S-STOKNO PIC 9(6).
           02 S-ADI PIC X(20).
           02 S-MIKTAR PIC 9(10).
           02 S-ASGARI PIC 9(6).
           02 S-KDV PIC 9(2).
           02 S-BIRFIAT PIC 9(8).
       FD YAZICI LABEL RECORD OMITTED.
       01 YAZICI-KAYDI PIC X(80).
       WORKING-STORAGE SECTION.
       77 BOS PIC X VALUE SPACE.
       77 STOK-MIK PIC 9(10) VALUE 0.
       77 MS-MIKTAR PIC -,---,---,---.
       77 GIRCIK-KOD PIC X VALUE SPACE.
       01 ISTEK PIC 9.
           88 GIR VALUE 1.
           88 DUZELT VALUE 2.
           88 SIL VALUE 3.
           88 LISTE VALUE 4.
           88 GIR-CIK VALUE 5.
           88 CIK VALUE 6.
       01 ISTEK1 PIC 9.
           88 KOD-GOR VALUE 1.
           88 AD-GOR VALUE 2.
           88 MIK-GOR VALUE 3.
       01 SON PIC X.
           88 BITTI VALUE "E".          
       01 DURUM PIC XX.
           88 DUR5 VALUE "23".
           88 DUR7 VALUE "30".
       01 BASLIK.
           02 FILLER PIC X(25) VALUE SPACE.
           02 BASLIK-AT PIC X(30).
           02 FILLER PIC X(25) VALUE SPACE.
       01 ALT-BASLIK.
           02 FILLER PIC X(45) VALUE
              "S-KODU STOK ADI             BIRIM FIATI    ".
           02 FILLER PIC X(30) VALUE
              "MEVCUT.MIK ASGARI S. KDV.OR. ".
       01 ALT-CIZ.
           02 FILLER PIC X(45) VALUE
              "====== =======   ========== ".
           02 FILLER PIC X(30) VALUE
              "========== ========= ======= ".
       01 DETAY-SAYI2.
           02 D-S-STOKNO PIC 9(6).
           02 FILLER PIC XXX VALUE SPACE.
           02 D-SAHA-BIR PIC X(20).
           02 FILLER PIC XX VALUE SPACE.
           02 D-SAHA-IKI PIC 9(8).
           02 FILLER PIC X(3) VALUE SPACE.
           02 D-SAHA-UC PIC -,---,---,---.
           02 FILLER PIC X(2) VALUE SPACE.
           02 D-SAHA-DORT PIC ZZZZZZZ.
           02 FILLER PIC X(5) VALUE SPACE.
           02 D-SAHA-BES PIC 9(2).
       SCREEN SECTION.
       01 EKRANA-LISTE.
           02 LINE 1 COLUMN 1 BLANK SCREEN.
           02 LINE 3 COLUMN 20 REVERSE-VIDEO VALUE
              "                       ".
           02 LINE 4 COLUMN 20 REVERSE-VIDEO VALUE
              "   EKRANA  LISTELEME   ".
           02 LINE 5 COLUMN 20 REVERSE-VIDEO VALUE
              "                       ".
       01 LISTE-BASLIK.
           02 LINE 8 COLUMN 1 REVERSE-VIDEO VALUE
              "S.KODU   STOK ADI        BIRIM FIATI   ".
           02 LINE 8 COLUMN 44 REVERSE-VIDEO VALUE
              " MEVCUT.MIK    ASGARI S. KDV.OR. ".
           02 LINE 9 COLUMN 1 REVERSE-VIDEO VALUE
              "========== ====== == ======= ".
       01 GOSTER1.
           02 LINE 1 COLUMN 1 BLANK SCREEN.
           02 LINE 3 COLUMN 10 REVERSE-VIDEO VALUE
              "                              ".
           02 LINE 4 COLUMN 10 REVERSE-VIDEO VALUE
              "   STOK  PROGRAM  MENUSU      ".                            
           02 LINE 5 COLUMN 5 REVERSE-VIDEO VALUE
              "                              ".
           02 LINE 10 COLUMN 12 VALUE "1...GIRIS ".
           02 LINE 12 COLUMN 12 VALUE "2...DUZELTME ".                       
           02 LINE 14 COLUMN 12 VALUE "3...IPTAL ".
           02 LINE 16 COLUMN 12 VALUE "4...LISTE ".
           02 LINE 18 COLUMN 12 VALUE "5...GIRIS-CIKIS ".
           02 LINE 20 COLUMN 12 VALUE "6...CIKIS ".
           02 LINE 22 COLUMN 10 HIGHLIGHT VALUE
              "SECIMINIZ (1,2,3,4,5,6) ".
       01 GOSTER2.
           02 LINE 1 COLUMN 1 BLANK SCREEN.
           02 LINE 3 COLUMN 10 REVERSE-VIDEO VALUE
              "                           ".
           02 LINE 4 COLUMN 10 REVERSE-VIDEO VALUE
              "  STOK  DOKUM  MENUSU      ".                            
           02 LINE 5 COLUMN 10 REVERSE-VIDEO VALUE
              "                           ".
           02 LINE 10 COLUMN 12 VALUE
              "   1...KODA GORE DOKUM     ".                            
           02 LINE 12 COLUMN 12 VALUE
              "   2...ADA GORE DOKUM      ".
           02 LINE 14 COLUMN 12 VALUE
              "   3...MIKTARA GORE DOKUM  ".
           02 LINE 22 COLUMN 10 HIGHLIGHT VALUE
              "  SECIMINIZ (1,2,3)        ".
       01 S-STOKNO-EKR.
           02 LINE 1 COLUMN 1 BLANK SCREEN.
           02 LINE 7 COLUMN 10 BLINK VALUE
                "  STOKNO   :".
           02 ANAH-AL LINE 7 COLUMN 27 PIC 9(6)
               USING S-STOKNO.
       01 GIRIS.
           02 LINE 12 COLUMN 10 HIGHLIGHT VALUE
               " STOK ADI......:".
           02 LINE 14 COLUMN 10 HIGHLIGHT VALUE
              " STOK MIKTARI...:".
           02 LINE 16 COLUMN 10 HIGHLIGHT VALUE
              " ASGARI SEVIYE..:".
           02 LINE 18 COLUMN 10 HIGHLIGHT VALUE
              " KDV ORANI......:".
           02 LINE 20 COLUMN 10 HIGHLIGHT VALUE
              " BIRIM FIAT.....:".
           02 LINE 24 COLUMN 10 HIGHLIGHT VALUE
              "  BITTI MI(E/H)? ".
       01 GIRIS-AL.
           02 LINE 12 COLUMN 27 PIC X(20) USING S-ADI.
           02 LINE 14 COLUMN 27 PIC 9(10) USING S-MIKTAR.
           02 LINE 16 COLUMN 27 PIC 9(6) USING S-ASGARI.
           02 LINE 18 COLUMN 27 PIC 9(2) USING S-KDV.
           02 LINE 20 COLUMN 27 PIC 9(8) USING S-BIRFIAT.
       01 BITTI-SOR.
           02 LINE 24 COLUMN 35 PIC X TO SON.
       PROCEDURE DIVISION.
	   BASLA. OPEN OUTPUT YAZICI.  OPEN I-O STOK.
		   IF DUR7 OPEN OUTPUT STOK.
		         CLOSE STOK. OPEN I-O STOK.
       MENU-AL.
	       DISPLAY GOSTER1. MOVE 0 TO ISTEK. ACCEPT(22, 40) ISTEK.
		   IF GIR OR DUZELT OR SIL PERFORM GIRISLER.
		   IF LISTE PERFORM LISTELEME THRU LISTE-CIK.
   	       IF CIK CLOSE STOK YAZICI GO QW. 
		   IF GIR-CIK PERFORM GIRIS-CIKIS. GO MENU-AL.
       GIRISLER.  MOVE "H" TO SON.
		   PERFORM GOSTER-AL THRU CIK-GOR UNTIL BITTI.
       QW. EXIT PROGRAM.		  
       GOSTER-AL.  PERFORM SIFIRLA. DISPLAY S-STOKNO-EKR.
		   ACCEPT ANAH-AL. READ STOK.
		   IF GIR IF DUR5 NEXT SENTENCE ELSE
		      PERFORM HATA1 GO TO CIK-GOR.
           IF DUZELT OR SIL IF DUR5 PERFORM
		      HATA2 GO TO CIK-GOR. DISPLAY GIRIS.
		   IF DUZELT OR SIL  DISPLAY GIRIS-AL.
		   IF GIR OR DUZELT ACCEPT GIRIS-AL.
		   PERFORM YAZDIR.
		   ACCEPT BITTI-SOR.
       CIK-GOR. EXIT.
       YAZDIR. IF GIR WRITE STOK-KAYDI INVALID KEY PERFORM HATA1.
           IF DUZELT REWRITE STOK-KAYDI INVALID KEY
		         PERFORM HATA2.
           IF SIL DELETE STOK INVALID KEY PERFORM HATA2.
       HATA1.  DISPLAY(24, 20) " BU NOLU KAYIT VAR ".
		    ACCEPT(24, 55) BOS.
		    DISPLAY(24, 1) ERASE.
       HATA2. DISPLAY(24, 20) " BU NOLU KAYIT YOK ".
		    ACCEPT(24, 55) BOS. DISPLAY(24, 1) ERASE.
       LISTELEME. DISPLAY(1 1)ERASE. DISPLAY GOSTER2.
		   ACCEPT(20, 20) ISTEK1. MOVE 10 TO LIN. IF KOD-GOR
		   MOVE "   KODA GORE DOKUM    " TO  BASLIK-AT
           MOVE 0 TO S-STOKNO
		   START STOK KEY  NOT LESS S-STOKNO  INVALID PERFORM
				HATA2 GO TO LISTE-CIK.
           IF AD-GOR  MOVE " ADA GORE DOKUM " TO BASLIK-AT
		   MOVE SPACES TO S-ADI
		   START STOK KEY NOT LESS S-STOKNO INVALID KEY PERFORM
			  HATA2 GO TO LISTE-CIK.
           IF MIK-GOR  MOVE " MIKTARA GORE DOKUM " TO
		          BASLIK-AT  MOVE ZERO TO S-MIKTAR
		   START STOK KEY IS NOT LESS S-STOKNO INVALID KEY PERFORM
                HATA2 GO TO LISTE-CIK.
           READ STOK NEXT RECORD AT END MOVE "E" TO  SON.
           DISPLAY(1, 1)ERASE.
		   DISPLAY(14, 10) " YAZICI ICIN(Y) EKRAN ICIN(E) ".
		   ACCEPT(14, 50)BOS.  MOVE "H" TO SON.
		   IF BOS="Y" OR "y" PERFORM YAZICI-DOK
		   GO TO LISTE-CIK. PERFORM EKRAN-DOK  UNTIL BITTI.
       LISTE-CIK. EXIT.
       YAZICI-DOK.
	       WRITE YAZICI-KAYDI FROM BASLIK AFTER 2.
		   WRITE YAZICI-KAYDI FROM ALT-BASLIK AFTER 2.
		   WRITE YAZICI-KAYDI FROM ALT-CIZ AFTER 1.
		   PERFORM YAZICI-DEVAM UNTIL BITTI.
       YAZICI-DEVAM.
	       MOVE S-STOKNO TO D-S-STOKNO.
		   MOVE S-ADI TO D-SAHA-BIR.
		   MOVE S-BIRFIAT TO D-SAHA-IKI.
		   MOVE S-MIKTAR TO D-SAHA-UC.
		   MOVE S-ASGARI TO D-SAHA-DORT.
		   MOVE S-KDV TO D-SAHA-BES.
		   WRITE YAZICI-KAYDI FROM DETAY-SAYI2 AFTER 1.
           READ STOK NEXT RECORD AT END MOVE "E"  TO SON.
       EKRAN-DOK.
	       DISPLAY(1, 1)ERASE.  DISPLAY EKRANA-LISTE.
		   DISPLAY LISTE-BASLIK.
           PERFORM DOK-DOK UNTIL LIN=22 OR BITTI.
		   DISPLAY(24, 10) "DEVAM MI(E/H) ".
		   ACCEPT(24, 40) BOS. IF BOS="H" MOVE "E" TO SON.
		   MOVE 10 TO LIN.
       DOK-DOK.
	       DISPLAY(LIN, 1) S-STOKNO.
		   DISPLAY(LIN, 10) S-ADI.
		   DISPLAY(LIN, 32) S-BIRFIAT.
		   MOVE S-MIKTAR TO MS-MIKTAR.
		   DISPLAY(LIN, 41) MS-MIKTAR.
		   DISPLAY(LIN, 57) S-ASGARI.
		   DISPLAY(LIN, 67) S-KDV.
		   ADD 1 TO LIN.
		   READ STOK NEXT RECORD AT END MOVE "E"
		               TO SON.
       GIRIS-CIKIS.
	       MOVE ZERO TO S-STOKNO.
		   DISPLAY S-STOKNO-EKR.
		   ACCEPT ANAH-AL.
		   READ STOK.
		   DISPLAY(13, 10) "STOK DURUMU :".
		   MOVE S-MIKTAR TO MS-MIKTAR.
		   DISPLAY(13, 55)MS-MIKTAR.
		   DISPLAY(15, 10) "STOK MIKTARINI GIRINIZ :".
		   ACCEPT(15, 55) STOK-MIK.
		         DISPLAY(16, 10) "GIRIS:<G>CIKIS:<C>:".
           ACCEPT(16, 55) GIRCIK-KOD.
		   DISPLAY(18, 10) "STOK A ISLENIYOR ".
		   IF GIRCIK-KOD="G"
		        ADD STOK-MIK TO S-MIKTAR.
           IF GIRCIK-KOD="C"
		        SUBTRACT STOK-MIK FROM S-MIKTAR
				      GIVING S-MIKTAR.
           DISPLAY(20, 10) "STOK UN YENI DURUMU :".
		   MOVE S-MIKTAR TO MS-MIKTAR.
		   DISPLAY(20, 55) MS-MIKTAR.
		   ACCEPT BOS.
		   REWRITE STOK-KAYDI INVALID KEY
		            PERFORM HATA2.
       SIFIRLA.
	       MOVE SPACE TO S-ADI.
		   MOVE ZERO TO S-KDV S-ASGARI S-MIKTAR.
		   MOVE ZERO TO S-BIRFIAT.
		   MOVE ZERO TO S-STOKNO. 						  				
