       IDENTIFICATION DIVISION.
	   PROGRAM-ID. SFS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 SECENEK PIC 9 VALUE 0.
       77 SIFRE PIC X(10) VALUE SPACE.
       SCREEN SECTION.
       01 ANA-MENU.
           05 BLANK SCREEN.
           05 LINE 1 COLUMN 1 REVERSE-VIDEO VALUE "BEBIM A.S.".
           05 LINE 2 COLUMN 1 REVERSE-VIDEO VALUE "ANA MENU". 
           05 LINE 3 COLUMN 1 PIC X(10) FROM ALL "=".
           05 LINE 6 COLUMN 5 VALUE
           "STOK FATURA SIPARIS PROGRAMI".
           05 LINE 7 COLUMN 5 PIC X(50) FROM ALL "-".
           05 LINE 8 COLUMN 5 VALUE
           "[1]: STOK KONTROL PROGRAMI ".
           05 LINE 9 COLUMN 5 VALUE
           "[2]: FATURA YAZILIMI PROGRAMI ".
           05 LINE 10 COLUMN 5 VALUE
           "[3]: SIPARIS LISTESI DOKUMU PROGRAMI ".
           05 LINE 12 COLUMN 5 VALUE
           "[4]: PROGRAMDAN CIKIS ".
           05 LINE 13 COLUMN 5 PIC X(50) FROM ALL "-".
           05 LINE 15 COLUMN 5 VALUE
           "&&&&& SECIMINIZ? &&&&&&".
           05 LINE 15 COLUMN 19 PIC 9 USING SECENEK.
       PROCEDURE DIVISION.
       A-100. DISPLAY (1 1) ERASE.
           ACCEPT (10 5) SIFRE WITH PROMPT NO-ECHO.
           IF SIFRE NOT = "BEBIM A.S." DISPLAY (1 1) ERASE
           STOP RUN. DISPLAY ANA-MENU.
       A-110. ACCEPT (15 19) SECENEK.
           IF SECENEK = 1 CALL "STOK1"
           ELSE IF SECENEK = 2 CALL "FATURA"
           ELSE IF SECENEK = 3 CALL "SIPARIS"
           ELSE IF SECENEK = 4 DISPLAY (1 1) ERASE STOP RUN
           ELSE DISPLAY (17 5) SECENEK DISPLAY (17 7)
           ".NOLU SECENEK YANLIS DOGRUSUNU GIRINIZ" GO A-110.
           DISPLAY ANA-MENU. DISPLAY (17 5) SECENEK DISPLAY (17 7)
           ".NOLU ISLEM TAMAMLANMISTIR" GO A-110.
       END-OF-JOB.          
     
            