       IDENTIFICATION DIVISION
       PROGRAM-ID. KITAP.
	   AUTHOR. MEHMET HARAS.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT KITAP ASSIGN TO DISK ORGANIZATION LINE SEQUENTIAL.
           SELECT YAZICI ASSIGN TO PRINTER.
       DATA DIVISION.
       FILE SECTION.
       FD KITAP LABEL RECORD STANDARD VALUE OF FILE-ID "KITAP.DOS".
       01 KITAP-KAYDI.
           05 K-ADI PIC X(20).
           05 Y-ADI PIC X(20).
           05 KONUSU PIC X(10).
           05 B-YILI PIC 9(4).
       FD YAZICI LABEL RECORD OMITTED.
       01 CIKTI-SATIRI PIC X(80).
       WORKING-STORAGE SECTION.
       77 SIFRE PIC X(10) VALUE SPACE.
       77 CEVAP PIC X VALUE SPACE.
       77 KONTROL PIC 99 VALUE 0.
       77 SEC PIC 9 VALUE 0.
       77 KIT PIC X(20) VALUE SPACE.
       77 YAZ PIC X(20) VALUE SPACE.
       77 CIZGI PIC X(80) VALUE ALL "ß".
       77 N PIC 99 VALUE 0.
	   77 BOSLUK PIC X(80) VALUE SPACE.  
       01 BASLIK.
           02 F PIC X(29) VALUE SPACE.
           02 F PIC X(22) VALUE "KITAP BILGILERI DOKUMU".
		   02 F PIC X(80) VALUE SPACE.
       01 BASLIK-2.
           02 F PIC X(29) VALUE SPACE.
           02 F PIC X(22) VALUE ALL "ß".
           02 F PIC X(80) VALUE ALL " ".	   
       01 YAZ-YAZ.
           02 F PIC X(9) VALUE SPACE.
           02 F PIC X(26) VALUE "DIGER SAYFA ICIN ENT BAS".
           02 F PIC X(80) VALUE SPACE.
	   01 BASLIK-1.
           02 F PIC X(8) VALUE SPACE.
           02 F PIC X(5) VALUE "SIRA".
           02 F PIC X(21) VALUE "KITAP ADI".
           02 F PIC X(21) VALUE "YAZAR ADI".
           02 F PIC X(11) VALUE "KONUSU".
           02 F PIC X(6) VALUE "B-YILI".
       01 DETAY.
           02 F PIC X(9) VALUE SPACES.
           02 S-NO PIC 99.
           02 F PIC XX VALUE SPACES.
           02 ADI PIC X(20).
           02 F PIC X VALUE SPACE.
           02 YADI PIC X(20).
           02 F PIC X VALUE SPACE.
           02 KONU PIC X(10).
           02 F PIC X VALUE SPACE.
           02 TARIH PIC 9(4).
       SCREEN SECTION.
       01 EKRAN-1.
           02 BLANK SCREEN.
           02 LINE 10 COLUMN 10 PIC X(28) FROM ALL "ß".
           02 LINE 11 COLUMN 10 VALUE "SIFREYI GIRINIZ:".
           02 LINE 11 COLUMN 26 PIC X(10) USING SIFRE.
           02 LINE 12 COLUMN 10 PIC X(28) FROM ALL "ß".
       01 EKRAN-2.
           02 BLANK SCREEN.
           02 LINE 1 COLUMN 1 BLINK VALUE "BEBIM A.S.".
           02 LINE 2 COLUMN 1 PIC X(12) FROM ALL "ß".
           02 LINE 7 COLUMN 10 PIC X(8) FROM ALL "ß".
           02 LINE 8 COLUMN 10 BLINK VALUE "ANA MENU".
           02 LINE 9 COLUMN 10 PIC X(30) FROM ALL "ß".
           02 LINE 10 COLUMN 10 VALUE "[1]:DOSYA YARATMA".
           02 LINE 11 COLUMN 10 VALUE "[2]:BILGI GIRISI".
           02 LINE 12 COLUMN 10 VALUE "[3]:BILGILERDE DEGISIKLIK".
           02 LINE 13 COLUMN 10 VALUE "[4]:YAZAR ADINA GORE DOKUM".
           02 LINE 14 COLUMN 10 VALUE "[5]:YAZICI DOKUMU".
           02 LINE 15 COLUMN 10 VALUE "[6]:PROGRAMDAN CIKIS".
           02 LINE 16 COLUMN 10 PIC X(30) FROM ALL "ß".
           02 LINE 19 COLUMN 10 BLINK VALUE "SECIMINIZ...:".
           02 LINE 19 COLUMN 23 PIC 9 USING SEC.
       01 EKRAN-3.
           03 BLANK SCREEN.
           03 LINE 1 COLUMN 1 BLINK VALUE "BEBIM A.S.". 
           03 LINE 2 COLUMN 1 PIC X(12) FROM ALL "ß".
           03 LINE 6 COLUMN 10 PIC X(37) FROM ALL "ß".
           03 LINE 7 COLUMN 10 VALUE "KITABIN ADI...:".
           03 LINE 8 COLUMN 10 VALUE "YAZARIN ADI...:".
           03 LINE 9 COLUMN 10 VALUE "KITABIN KONUSU:".
           03 LINE 10 COLUMN 10 VALUE "BASIM YILI....:".
           03 LINE 11 COLUMN 10 PIC X(37) FROM ALL "ß".
           03 LINE 7 COLUMN 25 PIC X(20) USING K-ADI.
           03 LINE 8 COLUMN 25 PIC X(20) USING Y-ADI.
           03 LINE 9 COLUMN 25 PIC X(10) USING KONUSU.
           03 LINE 10 COLUMN 25 PIC 9(4) USING B-YILI.
       PROCEDURE DIVISION.
       BASLA. DISPLAY (1 1) ERASE.
           DISPLAY EKRAN-1.
           ACCEPT(11 26) SIFRE WITH AUTO-SKIP NO-ECHO.
           IF SIFRE NOT = "BEBIM A.S."
           DISPLAY (1 1) ERASE STOP RUN.
           DISPLAY EKRAN-2.
       BB. ACCEPT EKRAN-2.
           IF SEC = 1 PERFORM YARAT
           ELSE IF SEC = 2 PERFORM GIRIS
           ELSE IF SEC = 3 PERFORM DEGISIKLIK
           ELSE IF SEC = 4 PERFORM E-DOKUM
           ELSE IF SEC = 5 PERFORM Y-DOKUM
           ELSE IF SEC = 6 PERFORM SON ELSE
           DISPLAY (23 5) SEC (23 6) ". NOLU SECENEK YANLIS" GO BB.
           DISPLAY EKRAN-2. DISPLAY (23 5) SEC (23 6) 
           "NOLU ISLEM TAMAMLANMISTIR. ". GO BB.
       YARAT SECTION.
       YY. OPEN OUTPUT KITAP CLOSE KITAP.
       GIRIS SECTION.
       GG1. OPEN EXTEND KITAP.
       GG2. MOVE ALL "." TO K-ADI Y-ADI KONUSU.                  
            MOVE 0 TO B-YILI. DISPLAY EKRAN-3.
           DISPLAY (5 10) "KITAP BILGILERI GIRISI".
       GG3. ACCEPT EKRAN-3. DISPLAY (23 1) ERASE (23 5)
           "VERILER DOGRUMU (E/H):" ACCEPT (23 27) CEVAP WITH PROMPT 
		   UPDATE. IF CEVAP = "H" GO GG3.
           WRITE KITAP-KAYDI. DISPLAY (23 1) ERASE (23 5)
           "GIRISE DEVAM EDIYORMUSUNUZ (E/H):".
           ACCEPT (23 45) CEVAP WITH PROMPT UPDATE.               
           IF CEVAP="E" GO GG2. CLOSE KITAP.
       DEGISIKLIK SECTION.
       DD1. OPEN I-O KITAP.
           DISPLAY (1 1) ERASE.
           DISPLAY (5 5) "DEGISIKLIK YAPILACAK KAYDIN ISMI:".
           MOVE ALL "." TO KIT. ACCEPT (5 38) KIT WITH PROMPT UPDATE.
       DD2. READ KITAP AT END GO UYARI.
           IF KIT NOT = K-ADI GO DD2.
           DISPLAY EKRAN-3. DISPLAY (23 1) ERASE (23 5)
           "DEGISTIRMEK ISTEDIGINIZ KITAP BU MU:".
           ACCEPT CEVAP. IF CEVAP = "H" GO DD2.
       DD3. ACCEPT EKRAN-3. DISPLAY (23 1) ERASE.
           DISPLAY (23 5) "DOGRU MU (E / H)". ACCEPT CEVAP.
           IF CEVAP = "H" GO DD3.
           REWRITE KITAP-KAYDI. DISPLAY (23 8) "DEVAM MI (E/H):"
           ACCEPT CEVAP. IF CEVAP = "E" CLOSE KITAP GO DD1 ELSE GO
           D-SON.
       UYARI. DISPLAY (23 1) ERASE. DISPLAY (23 5)
           "ARADIGINIZ KITAP DOSYADA YOK ENT BAS:"
           ACCEPT CEVAP.
       D-SON. CLOSE KITAP.
       E-DOKUM SECTION.
       EE1. OPEN INPUT KITAP.
       EE2. DISPLAY (1 1) ERASE. MOVE ALL "." TO YAZ.
           DISPLAY (5 5) "KITAPLARINI GORMEK ISTEDIGINIZ YAZAR:" 
           ACCEPT (5 43) YAZ WITH  PROMPT UPDATE.
       EE. READ KITAP AT END GO YOK.
           IF YAZ NOT = Y-ADI GO EE. MOVE 0 TO KONTROL.
       E. DISPLAY (1 1) ERASE. DISPLAY (1 1) BASLIK. 
           DISPLAY (2 1) BASLIK-2. DISPLAY (3 1) BASLIK-1. 
		   DISPLAY (4 1) CIZGI.
           MOVE 3 TO LIN.
       EE3. MOVE Y-ADI TO YADI. MOVE KONUSU TO KONU.
           MOVE B-YILI TO TARIH. MOVE K-ADI TO ADI.
           ADD 1 TO KONTROL. MOVE KONTROL TO S-NO.
           ADD 1 TO LIN. DISPLAY (LIN + 1 1) DETAY.
       E1. READ KITAP AT END GO E-SON.
	       IF YAZ NOT = Y-ADI GO E1. IF LIN > 17 DISPLAY (23 5)
		   "IKINCI SAYFA ICIN ENT BAS:" ACCEPT CEVAP PERFORM E.
           GO EE3.
	   YOK. DISPLAY (23 5) "BU YAZARA AIT HIC KITAP YOK".	      
       E-SON. DISPLAY (24 5) "DOKUM BITTI ANA MENU ICIN ENT BAS:".
           ACCEPT CEVAP. CLOSE KITAP.
       Y-DOKUM SECTION.
       YY1. OPEN INPUT KITAP. OPEN OUTPUT YAZICI.
           DISPLAY (1 1) ERASE.
       YY2. READ KITAP AT END GO UYAR. 
	       MOVE 0 TO N.
       YY. WRITE CIKTI-SATIRI FROM BASLIK AFTER 12.
           WRITE CIKTI-SATIRI FROM BASLIK-2.
           WRITE CIKTI-SATIRI FROM BOSLUK.
           WRITE CIKTI-SATIRI FROM BASLIK-1.
           WRITE CIKTI-SATIRI FROM CIZGI.
           MOVE 0 TO KONTROL.
       YY3. ADD 1 TO KONTROL. ADD 1 TO N. MOVE N TO S-NO.
           MOVE Y-ADI TO YADI. MOVE K-ADI TO ADI.
           MOVE KONUSU TO KONU. MOVE B-YILI TO TARIH.
		   WRITE CIKTI-SATIRI FROM DETAY. 
           IF KONTROL > 39 
		   WRITE CIKTI-SATIRI FROM YAZ-YAZ AFTER 2  
		   DISPLAY(22 5) "DIGER SAYFA ICIN ENT BAS"
		   ACCEPT CEVAP PERFORM YY. 
           READ KITAP AT END GO Y-SON. GO YY3.
       UYAR. DISPLAY (23 5) "DOSYADA HIC KAYIT YOK ENT BAS:"
           ACCEPT CEVAP.
       Y-SON. CLOSE KITAP YAZICI.
	   SON SECTION.
	   SSS.  EXIT PROGRAM.
